{"code": "AAAS", "name": "African American and African Studies", "courses": {"AAAS100": {"name": " Race and Community in Local to Global Perspective", "semester": "Fall of every year", "credits": " 3", "description": "Multifaceted topics and dialogue on race. Race as an intractable and enduring feature of politics and society. Racial formations. Individual identities, collective action, and social structures. Ways that racial categories remain an organizing principle. Core focus on African American, African diaspora, and continental African sites of analysis."}, "AAAS300": {"name": " Survey in Africana Studies", "semester": "Fall of every year, Summer of every year", "credits": " 3", "description": "Core conceptual elements of Africana Studies discipline and peoples (African Americans, Africans and African Diasporas), including topics in race, identity, the Black condition, representational discourses, discrimination, oppression, resistance and alternative agency. Field trip required.", "restrictions": "Approval of department."}, "AAAS390": {"name": " Special Topics in Black/Africana Studies", "semester": "Spring of every year", "credits": " 3", "description": "Special topics in African American, African, and African Diaspora studies. Topics are selected from sub-genres of Black/Africana Studies.", "restrictions": "Open to students in the African American and African Studies Specialization."}, "AAAS490": {"name": " Independent Study in African American and African Studies", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 3", "description": "Independent study in select and specialized topics in African American, African Diaspora and African Studies", "prerequisite": "Completion of Tier I Writing Requirement", "restrictions": "Open to undergraduate students in the African American History and Culture Specialization or in the African American and African Studies Minor."}, "AAAS495": {"name": " Advanced Research in African American and African Studies", "semester": "Spring of every year, Summer of odd years", "credits": " 3", "description": "Advanced undergraduate research course in African American, African and African Diaspora Studies. Review of interdisciplinary topics that inform these Africana regions, including slavery, race, colonialism, civil and human rights, identity and discourse and political philosophies, including Black Nationalism African Centered paradigms, and Black Feminism. Participation in the University Undergraduate Research and Arts Forum. Field trip required.", "prerequisite": "Completion of Tier I Writing Requirement", "restrictions": "Open to undergraduate students in the African American History and Culture Specialization or in the African American and African Studies Minor.", "alias": "AL 495"}, "AAAS890": {"name": " Independent Study in African American and African Studies", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 3", "description": "Faculty-supervised independent graduate study in African American and African Studies.", "prerequisite": "AAAS 829 and AAAS 830", "restrictions": "Open to graduate students."}, "AAAS891": {"name": " Special Topics in African American and African Studies", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": " 3", "description": "Special topics in African American, African and African Diaspora Studies.", "restrictions": "Open to graduate students."}, "AAAS893A": {"name": " Domestic Internship in African American and African Studies", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 2", "description": "Internship with community based organizations, non-governmental organizations or educational and governmental institutions whose core entrepreneurial activity and mission is to work with African American, African or African descendant communities and policy issues. Facilitates the \"communal component\" of the discipline.", "prerequisite": "AAAS 829 and AAAS 830 and AAAS 831 and AAAS 832", "restrictions": "Open to graduate students.", "alias": "AL 893A"}, "AAAS893C": {"name": " International Internship in African American and African Studies", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 2", "description": "Internship with international community based organizations, non-governmental organizations or educational and governmental institutions whose core entrepreneurial activity and mission is to work with African or African descendant communities and policy issues. Field trips required.", "prerequisite": "AAAS 829 and AAAS 830 and AAAS 831", "restrictions": "Open to graduate students.", "alias": "AL 893C"}, "AAAS898": {"name": " Master's Research", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 3", "description": "Directed research in support of Plan B master's program requirements.", "prerequisite": "AAAS 829 and AAAS 830 and AAAS 831 and AAAS 832 or approval of department", "restrictions": "Open to graduate students in the African American and African Studies major. Approval of department."}, "AAAS899": {"name": " Master's Thesis Research", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 2 to 4", "description": "Master's thesis research.", "prerequisite": "AAAS 829 and AAAS 830 and AAAS 831 or approval of department", "restrictions": "Open to graduate students in the African American and African Studies major."}, "AAAS999": {"name": " Doctoral Dissertation Research", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 6", "description": "Doctoral dissertation research.", "prerequisite": "AAAS 829 and AAAS 830 and AAAS 831 and AAAS 832", "restrictions": "Open to graduate students in the African American and African Studies Major."}}}