{"code": "ABM", "name": "Agribusiness Management", "courses": {"ABM100": {"name": " Decision-making in the Agri-Food System", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Organization and operation of the agri-food system. Economic analysis of agri-food firms and consumers. Management functions and decision-making of agri-food firms.", "alias": "FSM 200"}, "ABM130": {"name": " Farm Management I", "semester": "Fall of every year", "credits": " 3", "description": "General farm management including record keeping, income tax management, farm finance, and operational management of agricultural resources.", "alias": "AEC 050"}, "ABM203": {"name": " Data Analysis for the Agri-Food System", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Introduction to data analysis tools used in the management of food systems.", "prerequisite": "(ABM 100) and (EC 201 or concurrently)", "restrictions": "Open to undergraduate students in the Agribusiness Management Major or in the Agribusiness Management Minor or in the Environmental Economics Minor or in the Environmental Economics and Management major or in the Food Industry Management Major or in the Food Industry Management Minor."}, "ABM210": {"name": " Professional Seminar in Agribusiness Management", "semester": "Spring of every year", "credits": " 1", "description": "Industry trends in agribusiness management. Verbal, written, and visual communication techniques applied to professional situations, including professional development and career planning.", "restrictions": "Open to students in the Agribusiness Management Minor and open to students in the Animal Science Major or in the Horticulture Major or in the Agribusiness Management Major."}, "ABM222": {"name": " Agribusiness and Food Industry Sales", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Selling processes and activities within agribusiness and food firms. Principles and techniques of sales. Operation of sales organizations.", "prerequisite": "ABM 100 or EC 201 or EC 202", "restrictions": "Open to sophomores or juniors or seniors.", "alias": "FSM 320"}, "ABM224": {"name": " Information and Market Intelligence in the Agri-Food Industry", "semester": "Summer of every year", "credits": " 3", "description": "Researching agri-food issues, food industry business environments, and agri-food industry trends. Information gathering. Electronic library reference sources. Synthesis of data and information into market intelligence.", "prerequisite": "(ABM 100 or concurrently) or (EC 201 or concurrently)", "alias": "FIM 424"}, "ABM225": {"name": " Commodity Marketing I", "semester": "Fall of every year", "credits": " 3", "description": "Commodity markets in the agri-food system. Analysis of supply, demand, and pricing alternatives. Agri-food marketing processes, including marketing cooperatives.", "prerequisite": "ABM 100 or EC 201"}, "ABM260": {"name": " World Food, Population and Poverty", "semester": "Fall of every year", "credits": " 3", "description": "Description and analysis of world food, population and poverty problems. Interrelationships between developed and developing countries.", "prerequisite": "ABM 100 or EC 201 or EEM 255", "alias": "EEP 260"}, "ABM303": {"name": " Economics of Decision Making in the Agri-Food System", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Managerial economics with applications focusing on agriculture, food, and resources issues.", "prerequisite": "(MTH 124 and EC 201 and EC 202 and ABM 203) and (STT 200 or STT 201 or STT 315)"}, "ABM337": {"name": " Labor and Personnel Management in the Agri-Food System", "semester": "Fall of every year", "credits": " 3", "description": "Human resource management practices and techniques for farms, and agri-food firms", "prerequisite": "ABM 100 or ABM 130 or HRT 404", "restrictions": "Open to juniors or seniors.", "alias": "FSM 325", "exclude": "FIM 415"}, "ABM400": {"name": " Public Policy Issues in the Agri-Food System", "semester": "Spring of every year", "credits": " 3", "description": "Objectives, alternatives and consequences of public policy in the agri-food system. Analysis of economic implications for food and agribusiness firms, farmers, consumers and society.", "prerequisite": "EC 201 and EC 202", "restrictions": "Open to juniors or seniors.", "alias": "FSM 421"}, "ABM405": {"name": " Corporate Environmental Management (W)", "semester": "Spring of every year", "credits": " 3", "description": "Integration of environmental protection and pollution prevention with business management. Economic and strategic analysis of environmental protection.", "prerequisite": "(EEM 255) and (ACC 201 or ACC 230 or ABM 130) and ABM 203 and (((ABM 303 or EC 301) or approval of department) and completion of Tier I writing requirement)", "restrictions": "Open to juniors or seniors.", "alias": "PRM 405"}, "ABM410": {"name": " Advanced Professional Seminar in Agribusiness Management", "semester": "Fall of every year", "credits": " 1", "description": "Advanced professional problems and reestablishment of career planning in the agri-food system. Industry trends, career alternatives, and job search strategies. Enhanced verbal, written, and visual communication techniques.", "prerequisite": "ABM 210", "restrictions": "Open to juniors or seniors in the Agribusiness Management Minor and open to juniors or seniors in the Animal Science Major or in the Horticulture Major or in the Agribusiness Management Major."}, "ABM422": {"name": " Vertical Coordination in the Agri-Food System", "semester": "Fall of every year", "credits": " 3", "description": "Analysis of vertical coordination in the industrialized agri-food system. Agricultural cooperatives, contracts, marketing orders, and trade associations. Analysis of imperfect competition and methods of conducting business. Interaction with legal systems and government.", "prerequisite": "ABM 100 and ABM 203 and EC 201", "restrictions": "Open to juniors or seniors.", "alias": "FSM 443"}, "ABM425": {"name": " Commodity Marketing II", "semester": "Fall of every year", "credits": " 3", "description": "Advanced application of supply, space demand, and prices in commodity markets. Futures and options and their role in forward pricing. Risk management. Agricultural and food markets.", "prerequisite": "(ANS 314 or STT 200 or STT 201 or STT 315 or approval of department) and ABM 225", "alias": "FSM 441"}, "ABM427": {"name": " Global Agri-Food Industries and Markets", "semester": "Fall of every year", "credits": " 3", "description": "Strategic understanding of the international agri-food system. Analysis of global production, marketing, and consumption. Knowledge of changing conditions in international industries and markets. Global trends and opportunities.", "prerequisite": "(FIM 220 or ABM 225) and (EC 201 and EC 202) and ABM 203", "restrictions": "Open to juniors or seniors."}, "ABM430": {"name": " Farm Management II", "semester": "Fall of every year", "credits": " 3", "description": "Advanced management, planning, and control of farm production, marketing, financial activities, economic principles, budgeting and financial statements.", "prerequisite": "(ABM 130 and EC 201) and ABM 203", "restrictions": "Open to juniors or seniors.", "alias": "FSM 330"}, "ABM435": {"name": " Financial Management in the Agri-Food System", "semester": "Spring of every year", "credits": " 3", "description": "Analysis of agri-food business performance using financial statements. Capital budgeting of durable investments. Risk. Alternative methods to control capital asset services. Financial markets and credit institutions affecting agriculture and food.", "prerequisite": "(ABM 130 or ACC 201 or ACC 230) and (ABM 303 or EC 301 or approval of department)", "restrictions": "Open to juniors or seniors.", "alias": "FSM 412"}, "ABM437": {"name": " Agribusiness Strategic Management (W)", "semester": "Spring of every year", "credits": " 3", "description": "Analysis of strategic management issues for agribusiness. Formulation of business strategy and solutions to strategic problems. Integration of operations, marketing, finance, and human resource management.", "prerequisite": "(FIM 220) and ((ABM 435 or FI 320) and completion of Tier I writing requirement)", "restrictions": "Open to seniors.", "alias": "FSM 429"}, "ABM490": {"name": " Independent Study in Agribusiness Management", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 6", "description": "Independent supervised study of topics in agribusiness management.", "prerequisite": "ABM 100", "restrictions": "Not open to freshmen. Approval of department; application required. Students are limited to a combined total of 6 credits in ABM 490 and FIM 490.", "alias": "FSM 490"}, "ABM493": {"name": " Professional Internship in Agribusiness Management", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 3", "description": "Supervised professional experience in agribusiness management.", "prerequisite": "ABM 100", "restrictions": "Open to juniors or seniors in the Agribusiness Management major. Approval of department; application required. A student may earn a maximum of 6 credits in all enrollments for any or all of these courses"}}}