{"code": "ACC", "name": "Accounting", "courses": {"ACC201": {"name": " Principles of Financial Accounting", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": " 3", "description": "Purpose and content of corporate financial statements with emphasis on interpretation and understanding the effects of various transactions on these statements. Basic principles, conventions and concepts related to financial statements. Measurement of assets, liabilities, revenues and expenses. International accounting concepts.", "prerequisite": "CSE 102", "restrictions": "Open to undergraduate students in the Business - Admitted major and open to sophomores or juniors or seniors in the Hospitality Business Major."}, "ACC202": {"name": " Principles of Management Accounting", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": " 3", "description": "Management uses of accounting information. Costing products and services, planning and budgeting, performance measurement, control of organizational activities, and decision making.", "restrictions": "Open to undergraduate students in the Business - Admitted major."}, "ACC230": {"name": " Survey of Accounting Concepts", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": " 3", "description": "Basic concepts in financial and managerial accounting for non-business majors.", "restrictions": "Not open to students in the Accounting major or in the Business - Admitted major or in the Business-Preference major or in the Finance Major or in the Hospitality Business Major or in the Human Resource Management Major or in the Management Major or in the Marketing Major or in the Supply Chain Management Major.", "exclude": "ACC 202"}, "ACC250": {"name": " Preparing for an Accounting Career", "semester": "Fall of every year, Spring of every year", "credits": " 1", "description": "Changing environment and career management in professional accounting. Change management, ethics, professional certification, improving writing and speaking skills, globalization, and technology.", "restrictions": "Open to freshmen or sophomores and open to juniors in the Department of Accounting and Information Systems or approval of department."}, "ACC293": {"name": " Cooperative Education for Business Students", "semester": "Fall of every year, Spring of every year", "credits": " 1", "description": "Integration of pre-professional educational employment experiences in industry and government with knowledge and processes taught in the student's academic program. Educational employment assignment approved by the Department of Supply Chain Management.", "restrictions": "Approval of department.", "alias": "MSC 293"}, "ACC300": {"name": " Intermediate Financial Accounting I", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": " 3", "description": "U.S. and international concepts and procedures for preparing financial statements. Revenue recognition. Accounting for receivables, inventory, plant assets, intangibles and current liabilities. Applied research methods.", "prerequisite": "ACC 201 and ACC 202", "restrictions": "Open to juniors or seniors in the Department of Accounting and Information Systems or in the Department of Finance or in the Business - Admitted major or approval of department.", "exclude": "ACC 305"}, "ACC301": {"name": " Intermediate Financial Accounting II", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": " 3", "description": "U.S. and international concepts and procedures in accounting for various financial statement elements. Accounting for investments, bonds, leases, pensions, taxes, owners’ equity, earnings per share and comprehensive income.", "prerequisite": "(ACC 300 or ACC 305) and completion of Tier I writing requirement"}, "ACC305": {"name": " Intermediate Accounting for Finance Majors", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Major measurement, valuation, and reporting concepts and procedures underlying the assets, liabilities, owners' equity, revenues, and expenses contained in financial statements. Analysis, interpretation, and use of financial statements.", "prerequisite": "ACC 201 and ACC 202", "restrictions": "Open to juniors or seniors in the Finance Major or in the Human Resource Management Major or in the Management Major or in the Marketing Major or in the Supply Chain Management Major or in the Business - Admitted major.", "exclude": "ACC 300"}, "ACC308": {"name": " Governmental and Not-for-Profit Accounting", "semester": "Fall of every year, Spring of every year", "credits": " 1", "description": "Financial reporting, budgeting and auditing issues in not-for-profit entities. Government-wide and fund financial statements for state and local governments, generally accepted accounting principles for not-for-profit entities, generally accepted government auditing standards, and budgeting.", "prerequisite": "ACC 300 or ACC 305"}, "ACC321": {"name": " Accounting Information Systems", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": " 3", "description": "Conceptual modeling and implementation of accounting transaction processing systems. Enterprise value chains, documentation of workflow processing and control requirements, and modeling of accounting interoperability requirements.", "prerequisite": "ACC 201 and ACC 202"}, "ACC331": {"name": " Federal Income Tax Accounting", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": " 3", "description": "Federal income taxation of businesses and individuals. Gross income, deductions, and tax computations for corporations and individuals.", "prerequisite": "(ACC 300 or ACC 305) and completion of Tier I writing requirement", "alias": "ACC 431"}, "ACC333": {"name": " Taxation and Accounting for the Entrepreneur", "semester": "Fall of every year", "credits": " 3", "description": "Basic concepts of income taxation and accounting applicable to business entrepreneurs and their business enterprises.", "prerequisite": "ACC 201 and ACC 202", "restrictions": "Open to undergraduate students in the Eli Broad College of Business and The Eli Broad Graduate School of Management and not open to students in the Department of Accounting and Information Systems.", "exclude": "ACC 331"}, "ACC341": {"name": " Accounting for Management Decision Making", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": " 3", "description": "Identification of relevant accounting information for management decision making, planning and control. Evaluation of cost accounting system design choices for decision usefulness and effectiveness of performance measurement.", "prerequisite": "(ACC 300 or ACC 305) and (STT 200 or STT 201 or STT 315)"}, "ACC393": {"name": " Introduction to International Business", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 3", "description": "Introduction to the context of international business delivered on-site in foreign settings. Fundamental concepts and principles of globalization such as multinational corporations, foreign markets and economies, internal and external market transactions, international law, cultural influences, and multinational business strategies.", "restrictions": "Open to students in the Eli Broad College of Business and The Eli Broad Graduate School of Management or in the School of Hospitality Business."}, "ACC411": {"name": " Auditing", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": " 3", "description": "The audit process and the role of financial statement audits in organizations and financial markets. Development of the attitude, knowledge, and skills required to meet ethical and auditing standards. Plan and perform audits. Communicate audit results.", "prerequisite": "(ACC 300 or ACC 305) and ACC 321 and (STT 200 or STT 201 or STT 315)", "restrictions": "Open to seniors in the Finance Major or in the Accounting major and open to master's students in the Accounting Major."}, "ACC490": {"name": " Independent Study", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 3", "description": "Independent study in special topics in accounting under faculty supervision.", "prerequisite": "ACC 300", "restrictions": "Approval of department."}, "ACC491": {"name": " Special Topics in Accounting and Information Systems", "semester": "On Demand", "credits": "Variable from 1 to 3", "description": "Current and emerging issues in accounting and information systems.", "prerequisite": "(ACC 201 and ACC 202) and (ACC 300 or ACC 305)", "restrictions": "Open to students in the Department of Accounting and Information Systems or in the Department of Finance."}, "ACC493": {"name": " Internship", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": " 1", "description": "Professional internship in public, industrial, or governmental accounting under faculty supervision.", "prerequisite": "ACC 201 and ACC 202", "restrictions": "Approval of department."}, "ACC802": {"name": " Financial Analysis I", "semester": "Spring of every year", "credits": " 1.5", "description": "Concepts of financial analysis using U.S. and international accounting information. Supply of and demand for accounting information in financial markets.", "prerequisite": "MBA 802", "restrictions": "Open to MBA students or approval of department.", "exclude": "ACC 807"}, "ACC803": {"name": " Financial Analysis II", "semester": "Spring of every year", "credits": " 1.5", "description": "Cash flow and earnings based accounting models for business valuation.", "prerequisite": "MBA 802 and ACC 802", "restrictions": "Open to MBA students or approval of department.", "exclude": "ACC 807"}, "ACC807": {"name": " Financial Statement Analysis", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Concepts of financial analysis using U.S. and international accounting information. Cash-flow and earnings based models for business valuation, and supply of and demand for accounting information in financial markets.", "prerequisite": "MBA 802 or ACC 301", "restrictions": "Open to master's students in the Accounting major and open to MBA students or approval of department."}, "ACC808": {"name": " Contemporary Financial Reporting Decisions", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Framework for making professional judgments and decisions about accounting for contemporary financial reporting issues. Conceptual framework, standard setting, accounting for financial instruments, foreign subsidiaries, and hedging.", "prerequisite": "ACC 301", "restrictions": "Open to master's students in the Accounting major or approval of department."}, "ACC814": {"name": " Advanced Auditing", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Economic, regulatory and technology environments as it relates to auditing in the public and private sectors. Risk analysis, professional standards, audit evidence gathering and evaluations, accounting and auditing research and decision making.", "prerequisite": "ACC 411", "restrictions": "Open to master's students in the Accounting major or approval of department."}, "ACC821": {"name": " Enterprise Database Systems", "semester": "Fall of every year", "credits": " 3", "description": "Management of information in business organizations. Conceptual modeling of transaction process systems, workflow systems and enterprise-wide networks of value-added activities. Integration of decision support and policy level systems with economic event processing systems. Evolution of accounting systems.", "restrictions": "Open to master's students in the Accounting major or approval of department.", "exclude": "ACC 321"}, "ACC822": {"name": " Information Systems Project Management", "semester": "Fall of every year, Spring of every year", "credits": "Variable from 1 to 3", "description": "Management of information system projects. Modeling of business processes. Management of project scope, time and costs. Planning and control of projects. Program and portfolio management. Consulting issues for effective project management.", "restrictions": "Open to graduate students in the Accounting major and open to MBA students or approval of department."}, "ACC823": {"name": " Advanced Enterprise Database Systems", "semester": "Spring of every year", "credits": " 3", "description": "Architecture of enterprise information. Semantic and syntactic modeling of enterprise economic phenomena, relational database technology and database design for business systems, business process analysis patterns and implementation compromises.", "prerequisite": "ACC 321 or ACC 821 or ITM 821", "restrictions": "Open to graduate students in the Accounting major or approval of department."}, "ACC824": {"name": " Governance and Control of Enterprise Systems", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Governance and control of information technologies. Identification and valuation of key information and communication technologies, frameworks for assessing information system risk, information system auditing, and international standards for information technology governance and control.", "restrictions": "Open to graduate students in the Accounting major or in the Master of Business Administration in Business Administration or approval of department."}, "ACC825": {"name": " Object-Oriented Business Information Systems", "semester": "Fall of every year", "credits": " 3", "description": "Analysis and design of object-oriented business systems. Unified modeling language descriptions of business phenomena and rules, object-oriented programming, use-case analysis and specifications, and XML tag sets for transactions and reporting.", "prerequisite": "ACC 321 or ACC 821", "restrictions": "Open to graduate students in the Accounting major or approval of department."}, "ACC826": {"name": " Enterprise Information Systems", "semester": "Spring of every year", "credits": " 3", "description": "Enterprise resource planning (ERP) systems. ERP implementation issues and success factors. Use of enterprise systems, and exploring future directions in ERP systems.", "restrictions": "Open to graduate students in the Accounting major or in the Master of Business Administration in Business Administration or approval of department."}, "ACC827": {"name": " Accounting Analytics", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Develop an accounting analytics mindset. Determine and apply appropriate data analytic techniques based upon the accounting environment and situation. Use data visualization, predictive analytics and other analytics software as appropriate.", "prerequisite": "ACC 321 or ACC 821", "restrictions": "Open to master's students in the Accounting Major."}, "ACC830": {"name": " Tax Research", "semester": "Fall of every year", "credits": " 3", "description": "Writing and presentation techniques of tax research. Tax practice and procedure, and partnership taxation.", "prerequisite": "ACC 331", "restrictions": "Open to master's students in the Accounting major and open to MBA students or approval of department."}, "ACC833": {"name": " Federal Income Taxation of Corporations and Shareholders", "semester": "Fall of every year, Summer of every year", "credits": " 3", "description": "The Federal income taxation of corporations and shareholders resulting from operations, distributions, formations, liquidation, and reorganizations. Taxation of pass through entities.", "prerequisite": "ACC 331", "restrictions": "Open to master's students in the Accounting major and open to MBA students or approval of department."}, "ACC834": {"name": " Taxation of Gifts, Trusts and Estates", "semester": "Spring of every year", "credits": " 3", "description": "Transfer taxes applied to gifts and transfers at death. Transfer tax planning including the use of trusts.", "prerequisite": "ACC 331", "restrictions": "Open to master's students in the Accounting major and open to MBA students or approval of department."}, "ACC836": {"name": " U. S. Taxation of Multinational Transactions", "semester": "Spring of every year", "credits": " 3", "description": "Federal income taxation of transactions by U.S. persons outside the United States, and of investments by foreign persons in the U.S.", "prerequisite": "ACC 331", "restrictions": "Open to master's students in the Accounting major and open to MBA students or approval of department."}, "ACC841": {"name": " Strategic Management Controls Systems", "semester": "Fall of every year", "credits": "Variable from 1 to 3", "description": "Management accounting concepts for strategic management and business unit-management. Performance measurement, planning and budgeting, and control system design.", "prerequisite": "(MBA 812 or ACC 341) and (MGT 409 or (MBA 850 or concurrently))", "restrictions": "Open to master's students in the Accounting Major and open to MBA students or approval of department."}, "ACC843": {"name": " Value Chain Accounting and Analytics", "semester": "Fall of every year", "credits": "Variable from 1 to 3", "description": "Design and use of managerial accounting systems to support operational decisions in complex, real-world settings, using analytical techniques and real data.", "prerequisite": "(MBA 812 or ACC 341) and (MBA 804 or MKT 317)", "restrictions": "Open to master's students in the Accounting Major and open to MBA students or approval of department."}, "ACC844": {"name": " Management Accounting in Global Enterprises", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Accounting concepts and methods for use in global enterprises.", "prerequisite": "MBA 812 or ACC 341", "restrictions": "Open to master's students in the Accounting major and open to MBA students or approval of department."}, "ACC850": {"name": " Accounting for Multiunit Enterprises", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Financial reporting and tax issues related to business combinations and divestitures and the resulting consolidated reporting of the multi-unit enterprise's financial and tax information.", "prerequisite": "ACC 301 and ACC 331", "restrictions": "Open to graduate students in the Accounting major or approval of department.", "alias": "ACC 450"}, "ACC890": {"name": " Independent Study", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 3", "description": "Faculty-supervised study in special topics in accounting.", "restrictions": "Open only to master's students in the Professional Accounting major or approval of department."}, "ACC891": {"name": " Special Topics in Accounting and Information Systems", "semester": "Fall of every year, Spring of every year", "credits": "Variable from 1 to 3", "description": "Current and emerging issues in accounting and information systems.", "restrictions": "Open to master's students in the Accounting Major."}, "ACC914": {"name": " Research Topics in Accounting", "semester": "Summer of every year", "credits": "Variable from 1 to 3", "description": "Directed readings and written critiques of readings. Student research papers. Participation in the department workshop series, including presentations of research papers and critiques of presented papers.", "restrictions": "Open only to Ph.D. students in the College of Business."}, "ACC950": {"name": " Doctoral Seminar in Accounting Research", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Research on auditing, financial and managerial accounting, and taxation using theoretical perspectives and research methods from the social sciences and business disciplines.", "restrictions": "Open to doctoral students in the Eli Broad College of Business and The Eli Broad Graduate School of Management."}, "ACC999": {"name": " Doctoral Dissertation Research", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 24", "description": "Doctoral dissertation research.", "restrictions": "Open to doctoral students in the Accounting Major."}}}