{"code": "ACM", "name": "Arts and Cultural Management", "courses": {"ACM271": {"name": " Introduction to Arts and Cultural Management", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": " 3", "description": "Arts and cultural organization administration and management. Operations and procedures of art and humanities-based agencies. Funding and financial structures involving audience development and promotion.", "alias": "AL 271"}, "ACM461": {"name": " Strategies of Arts and Cultural Management", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Strategic theory and approaches for arts and cultural organization administration and management. Budget development and strategy; fundraising and financial strategy. Staffing and human resource management.", "prerequisite": "ACM 271", "restrictions": "Approval of college.", "alias": "AL 461"}, "ACM462": {"name": " Promotion and e-Commerce in Arts and Cultural Management", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Publicity, promotion, and outreach principles for arts and cultural management. Promoting research and strategy, outreach and education, e-Commerce strategies and social media management.", "prerequisite": "ACM 271", "restrictions": "Approval of college.", "alias": "AL 462"}, "ACM463": {"name": " Event Production and Planning for Arts and Culture", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Technical aspects of event planning, production and management. Operational procedures of presenting, producing and programming events and cultural activities. Technical and venue management procedures.", "prerequisite": "ACM 271", "restrictions": "Approval of college.", "alias": "AL 463"}, "ACM464": {"name": " Education and Outreach for Arts and Cultural Management", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Arts and cultural organization education and outreach. Understanding of K-12 school and community programs.", "prerequisite": "ACM 271 or approval of college", "restrictions": "Open to graduate students in the College of Arts and Letters or approval of college.", "alias": "AL 464"}, "ACM465": {"name": " Leadership and Innovation for Arts and Cultural Management", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Development of leadership abilities, creative, and innovative planning in arts and cultural management through readings and practical application.", "prerequisite": "ACM 271 or approval of college", "restrictions": "Open to graduate students in the College of Arts and Letters and open to undergraduate students in the Entrepreneurship and Innovation Minor or approval of college.", "alias": "AL 465"}, "ACM467": {"name": " Development and Public Relations for Arts and Cultural Management", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Arts and cultural organization development and public relations. Investigation of foundation, government, corporate and individual funding sources. Membership and subscription services, press releases, strategies and advertising campaigns.", "prerequisite": "ACM 271 or approval of college", "restrictions": "Open to graduate students in the College of Arts and Letters or approval of college.", "alias": "AL 467"}, "ACM468": {"name": " Facilities and Operations for Arts and Cultural Management", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Address the complex skills involved in the management of both private and public arts and cultural venues. Understand and analyze the skills required for building operations, policies, vendor contracting, scheduling, maintenance, daily operations, event coordination, additional fundraising opportunities; and policies required for public safety and control. Internal and external relationships required for complex arts and cultural venues.", "prerequisite": "ACM 271 or approval of college", "restrictions": "Open to graduate students in the College of Arts and Letters or approval of college.", "alias": "AL 468"}, "ACM471": {"name": " Arts and Cultural Management Seminar", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": " 3", "description": "Seminar covering key topics and approaches in arts and cultural management, and the preparation of academic and professional portfolios.", "prerequisite": "(ACM 271) and (ACM 461 or ACM 462 or ACM 463)", "restrictions": "Approval of college.", "alias": "AL 471"}, "ACM490": {"name": " Independent Study", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 3", "description": "Special project, directed reading and research arranged by an undergraduate student and a faculty member in areas supplementing regular course offerings."}, "ACM491": {"name": " Special Topics in Arts and Cultural Management", "semester": "On Demand", "credits": "Variable from 1 to 4", "description": "Special topics supplementing regular course offerings, proposed by faculty on a group study basis."}, "ACM801": {"name": " Introduction to Arts and Cultural Management", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Arts and cultural organization artistic administration and executive management. Operations and procedures of art and humanities-based agencies. Funding and financial structures involving audience development and marketing.", "restrictions": "Open to graduate students in the College of Arts and Letters or approval of college.", "alias": "AL 801"}, "ACM868": {"name": " Non-Profit Law for Arts and Cultural Management", "semester": "Fall of every year", "credits": " 3", "description": "Legal issues pertaining to the creation and operation of cultural business entities, including nonprofit organizations. Exploration of relevant aspects of nonprofit and business law, finances and taxes, contracts, intellectual property, constitutional law, artists’ moral and economic rights, estate planning for individuals and organizations. Historical and contemporary examination of reparations of cultural property.", "restrictions": "Open to graduate students in the College of Arts and Letters or approval of college.", "alias": "AL 868"}, "ACM869": {"name": " Policy and Advocacy for Arts and Cultural Management", "semester": "Spring of every year", "credits": " 3", "description": "Policymaking pertaining to local, regional, national and international arts and cultural organizations. History and practice of arts and cultural advocacy campaigns, budget administration, and the impact of arts and cultural organizations on policymaking. Exploration of community engagement, strategic messaging, project oversight, assessment, and accessibility when creating new policy including lobbying in the legislative process.", "restrictions": "Open to graduate students in the College of Arts and Letters or approval of college."}, "ACM871": {"name": " Internship in Arts and Cultural Management", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 6", "description": "Supervised internship with arts and cultural organizations associated with management and operational studies.", "restrictions": "Open to graduate students in the College of Arts and Letters or approval of college.", "alias": "AL 871"}, "ACM890": {"name": " Independent Study", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 3", "description": "Special project, directed reading, and research arranged by a graduate student and a faculty member in areas supplementing regular course offerings."}, "ACM891": {"name": " Special Topics in Arts and Cultural Management", "semester": "Fall of every year, Spring of every year", "credits": "Variable from 1 to 4", "description": "Special topics supplementing regular course offerings, proposed by faculty on a group study basis.", "restrictions": "Open to graduate students in the Arts and Cultural Management major or approval of college."}, "ACM892": {"name": " Arts and Cultural Management Seminar", "semester": "Spring of every year", "credits": " 3", "description": "Arts and cultural management issues and research explored from a variety of arts and cultural management-based perspectives.", "prerequisite": "ACM 801", "restrictions": "Open to graduate students in the College of Arts and Letters or approval of college."}}}