{"code": "ADV", "name": "Advertising", "courses": {"ADV205": {"name": " Principles of Advertising", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": " 3", "description": "Principles and practices of advertising in relation to economies, societies, and mass communication."}, "ADV210": {"name": " Concept Development", "semester": "Fall of every year, Spring of every year", "credits": " 1", "description": "Forming visual ideas with a strong narrative. Conceptualizing solutions that meet strategic advertising objectives from idea generation to the final application, regardless of media type.", "prerequisite": "CAS 110 or concurrently", "restrictions": "Open to students in the Advertising Creative major."}, "ADV222": {"name": " Introduction to Copywriting", "semester": "Fall of every year", "credits": " 3", "description": "Role of copywriting in the creative process. Iconic advertising campaigns with copywriting emphasis. Practice in writing copy with critique and rewriting. Focus on writing for print media.", "prerequisite": "(ADV 205 and (ADV 210 or concurrently)) and completion of Tier I writing requirement", "restrictions": "Open to students in the Advertising Creative major or approval of department."}, "ADV224": {"name": " Introduction to Creative Media", "semester": "Fall of every year", "credits": " 3", "description": "Communication design principles used by art directors for research, exploration, and execution. Visual communication solutions using design principles with the appropriate digital technology. Design software includes Adobe CC Illustrator, Photoshop and Indesign.", "prerequisite": "ADV 205 and (ADV 210 or concurrently)", "restrictions": "Open to students in the Advertising Creative major.", "alias": "ADV 321"}, "ADV225": {"name": " Writing for Public Relations", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": " 3", "description": "Theory and practice of preparing written business communications.", "restrictions": "Open to undergraduate students in the James Madison College or in the College of Communication Arts and Sciences or approval of department."}, "ADV245": {"name": " Multimedia Commercial Production", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Cinematography applied to 15-, 30- and 60-second spots for TV, desktop and handheld devices. The power of story telling in the production of screen-based creative advertising solutions including motion graphics and animation. Planning, writing, casting, filming, editing, sound, lighting, and evaluation.", "prerequisite": "(ADV 222 or ADV 224) and CAS 112", "restrictions": "Open to students in the Advertising Creative major."}, "ADV260": {"name": " Principles of Public Relations", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": " 3", "description": "Role and function of public relations in society. History of the field. Roles of practitioners and understanding the unique professional areas within the field of public relations.", "alias": "ADV 227"}, "ADV322": {"name": " 360-degree Copywriting", "semester": "Spring of every year", "credits": " 3", "description": "Writing across multiple channels. Focus on traditional media including television, print, out-of home, and radio. Focus on non-traditional media including digital and social media.", "prerequisite": "ADV 222 and (ADV 245 or concurrently)", "restrictions": "Open to students in the Advertising Creative major."}, "ADV326": {"name": " Advanced Creative: Media I", "semester": "Spring of every year", "credits": " 3", "description": "Applications of creative media to advertising. Design principles that enable art directors to organize information on page or screen to communicate the client's message clearly and imaginatively.", "prerequisite": "ADV 224 and (ADV 245 or concurrently)", "restrictions": "Open to students in the Advertising Creative major.", "alias": "ADV 426"}, "ADV330": {"name": " Advertising Management Strategy", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Advertising problems from the perspective of managers responsible for solving problems. Identify problems, develop alternative solutions, implement effective strategies, and evaluate proposed solutions.", "prerequisite": "ADV 205", "restrictions": "Open to undergraduate students in the Department of Advertising and Public Relations."}, "ADV334": {"name": " International Advertising", "semester": "Fall of every year", "credits": " 3", "description": "Advertising decisions and consumer behavior. Political systems, literacy rates, new technologies, consumer behavior, and culture. Decision making, strategy, media selection, creative execution and campaign evaluation.", "restrictions": "Open to juniors or seniors in the Advertising major or approval of department.", "alias": "ADV 470"}, "ADV342": {"name": " Account Planning and Research", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Principles of account planning. Strategic thinking, use of focus groups, and other qualitative and quantitative methods. Applied media research methods, practices, techniques and ethics in media settings.", "prerequisite": "ADV 205", "restrictions": "Open to sophomores or juniors or seniors in the Advertising major."}, "ADV350": {"name": " Advertising Media Planning and Strategy", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Introduction to advertising media planning. Characteristics of media, media terminology and calculations. Use of syndicated media research and development of media plans.", "prerequisite": "ADV 205", "restrictions": "Open to sophomores or juniors or seniors in the Advertising Major.", "alias": "ADV 346"}, "ADV352": {"name": " Media Sales", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Process of media sales, operation of sales and marketing departments, analyzing local media, and customized advertising using cross-selling.", "prerequisite": "ADV 205", "restrictions": "Open to undergraduate students in the Department of Advertising and Public Relations."}, "ADV354": {"name": " Interactive Advertising Design", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": " 3", "description": "Build interactive websites that are adaptable to any screen size. Apply concepts like information architecture, the grid system, an web design principles when developing websites.", "prerequisite": "ADV 224", "restrictions": "Open to students in the Advertising Creative major."}, "ADV360": {"name": " Advanced Sales Communication", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Need-based selling and leadership role in meeting client needs. Advanced methods of questioning, customer need analysis, negotiation, effective presentations and interpersonal communication relationships with clients. Sales role-playing presentations, business and technical writing, portfolio presentations, and case studies.", "prerequisite": "MKT 313 and (MKT 300 or MKT 327)", "restrictions": "Open to undergraduate students in the Sales Communication Specialization."}, "ADV375": {"name": " Consumer Behavior", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Theories of consumer behavior and their applications to promotions disciplines. Using theories to solve problems and make managerial decisions faced by practitioners in advertising agencies, suppliers, and client side marketing functions.", "prerequisite": "ADV 205 or concurrently", "restrictions": "Open to sophomores or juniors or seniors.", "alias": "ADV 473"}, "ADV386": {"name": " Campaign Competition", "semester": "Fall of every year", "credits": " 3", "description": "Research, analyze, develop, and execute an integrated marketing and advertising campaign for selected client. Written recommendations and presentations for competition.", "prerequisite": "ADV 205", "restrictions": "Approval of department; application required."}, "ADV401": {"name": " Neuromarketing and Consumer Decisions", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Exploration of the field of neuromarketing, including different methodological techniques. Examination of how the human brain makes consumer decisions. Discern valid from invalid neuromarketing practices."}, "ADV402": {"name": " Public Relations Topics in Advertising", "semester": "Fall of every year, Spring of every year", "credits": " 1", "description": "Current topics related to the practice of public relations.", "restrictions": "Open to undergraduate students in the Public Relations Specialization. A student may earn a maximum of 6 credits in any or all enrollments in ADV 402, COM 402, or JRN 402."}, "ADV413": {"name": " Issues in Contemporary Advertising", "semester": "Fall of every year, Spring of every year", "credits": "Variable from 1 to 3", "description": "Current issues in advertising and related disciplines."}, "ADV420": {"name": " New Media Driver's License", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": " 3", "description": "Digital communication for advertising and public relations. Using new media, including social media, to effectively market a business or individual to a target audience.", "restrictions": "Open to sophomores or juniors or seniors."}, "ADV422": {"name": " Advanced Copywriting: Creating Experiences", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Continued development of aesthetic and technical copywriting skills to develop ads and multi-media campaigns that solve advertising problems; emphasis on creating relevant audience experiences and self-critiquing.", "prerequisite": "ADV 322 or approval of department", "restrictions": "Open to students in the Advertising Creative major or approval of department."}, "ADV428": {"name": " Advanced Creative: Media II", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Creative execution skills to explore the power of branding. Visual solutions that reinforce the brand experience through ads, campaigns, and collateral material. Creative research, strategy development.", "prerequisite": "ADV 326 and ADV 354", "restrictions": "Open to students in the Advertising Creative major.", "alias": "ADV 417"}, "ADV430": {"name": " Social Marketing: Strategy and Practice", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Use of marketing concepts and tools from sociology, psychology, commercial marketing, and public opinion research to promote individuals' pro-social and health behaviors. Application of strategies that improve quality of life and result in behavioral and societal changes in positive ways.", "prerequisite": "(MKT 300 or concurrently) or (MKT 327 or concurrently)", "restrictions": "Open to juniors or seniors in the Department of Advertising and Public Relations or in the Department of Communication and open to juniors or seniors in the Department of Marketing."}, "ADV431": {"name": " Monitoring and Measuring Social Media of Brands", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Social media monitoring and analysis for businesses and brands including advanced keyword building and search techniques. Discovering business insights through social media listening and applying insights through a social media response plan.", "prerequisite": "ADV 420", "restrictions": "Open to students in the Department of Advertising and Public Relations or in the Sports Business Management Minor."}, "ADV432": {"name": " Digital Media Planning and Buying", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Media planning and buying for web-based business applications. Budget-building, media mix recommendations, performance analysis, and support for business decisions.", "prerequisite": "ADV 420", "restrictions": "Open to students in the Department of Advertising and Public Relations."}, "ADV433": {"name": " Internet Video Promotion Strategy", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Promotional video production focusing on brands or companies. Use of metrics and analytical tools to determine impact of promotional video. Video distribution strategies.", "prerequisite": "ADV 420"}, "ADV436": {"name": " Promotions and Sponsorships", "semester": "Spring of every year", "credits": " 3", "description": "Corporate communication activities used to elicit consumer response to a product and service mix. Non-traditional advertising strategies, cross-promotion strategies, and strategies for non-profit organizations.", "prerequisite": "ADV 375 or concurrently", "restrictions": "Open to undergraduate students in the Advertising major or in the Retailing major or in the Food Industry Management major.", "alias": "ADV 336"}, "ADV442": {"name": " Digital Analytics", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Data collection, analysis and reporting on cross- or multi-channel media analytics in order to inform strategic advertising and public relations decision making. Evaluate impact of integrated communication decisions.", "prerequisite": "ADV 342 or concurrently", "restrictions": "Open to students in the Department of Advertising and Public Relations."}, "ADV445": {"name": " Programmatic Media Buying", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Background, processes, and applications of how online advertising and public relations campaigns are planned, booked, optimized, and validated using programmatic tools. Developments and trends in programmatic advertising platform tests and entries into mainstream media channels. Targeted offers, messages, content or ads across paid, owned and earned channels.", "prerequisite": "ADV 350", "restrictions": "Open to students in the Department of Advertising and Public Relations."}, "ADV450": {"name": " Portfolio Presentation", "semester": "Fall of every year, Spring of every year", "credits": " 1", "description": "Editing past work for professional presentation. Strengthening, expanding, and finalizing individual portfolios for career enhancement. Critique by professionals.", "prerequisite": "ADV 422 or ADV 428", "restrictions": "Open to students in the Advertising Creative major."}, "ADV455": {"name": " Intensive Portfolio Workshop", "semester": "Summer of every year", "credits": "Variable from 1 to 9", "description": "Create portfolio works across various platforms (print and screen) that meet current industry standards. Teams of student art directors and copywriters collaborate to generate advertising solutions.", "prerequisite": "ADV 322 and ADV 326 and ADV 354", "restrictions": "Open to juniors or seniors. Approval of department; application required."}, "ADV456": {"name": " Interactive Advertising Management Strategy", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Theory and practice of interactive advertising, e-commerce, Internet advertising, online sales promotion, online public relations, virtual communities, and Internet research. Role of strategy in implementing interactive solutions.", "prerequisite": "ADV 330 or ADV 350", "restrictions": "Open to students in the Department of Advertising and Public Relations."}, "ADV475": {"name": " Advertising and Society", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Impact of advertising on society, culture and economy. Representation of minorities, women, and the elderly in advertising; free speech, advertising law, and regulatory organizations; ethical decision making strategies; and advertising's economic role in information, competition, price, and product choice.", "prerequisite": "ADV 330 or ADV 350", "restrictions": "Open to undergraduate students in the Department of Advertising and Public Relations.", "alias": "ADV 465"}, "ADV481": {"name": " Retail Strategy Analysis", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Strategic and financial planning for retailers.", "prerequisite": "MKT 300 or MKT 313 or MKT 327", "restrictions": "Open to undergraduate students in the Department of Advertising and Public Relations or in the Sales Leadership Minor or in the Retail Management Minor or approval of department.", "alias": "HED 481, RET 481"}, "ADV486": {"name": " Integrated Campaigns (W)", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": " 3", "description": "Development of integrated marketing and advertising campaigns for clients. Creative, media and marketing communication elements.", "prerequisite": "{(CAS 110 and ADV 342) and (ADV 330 or ADV 350) and ((ADV 442 or concurrently) or (ADV 450 or concurrently))} or (ADV 325 and completion of Tier I writing requirement)", "restrictions": "Open to undergraduate students in the Department of Advertising and Public Relations or in the Public Relations Minor."}, "ADV490": {"name": " Independent Study", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 6", "description": "Supervised individual study in an area of advertising or public relations.", "restrictions": "Open to undergraduate students. Approval of department; application required."}, "ADV492": {"name": " Special Topics in Advertising", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 8", "description": "Varied topics pertaining to the study of advertising and public relations processes.", "restrictions": "Not open to freshmen."}, "ADV493": {"name": " Advertising and Public Relations Internship", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 12", "description": "Supervised experience in a professional environment.", "prerequisite": "ADV 205", "restrictions": "Open to undergraduate students in the Department of Advertising and Public Relations. Approval of department; application required."}, "ADV494": {"name": " Practicum in Research/Creative Works and Instruction", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 4", "description": "Structured participation in departmental research teams/creative work, classroom management and applied practice in the community.", "restrictions": "Open to sophomores or juniors or seniors in the Department of Advertising and Public Relations. Approval of department."}, "ADV803": {"name": " Introduction to Quantitative Research Methods", "semester": "Fall of every year, Summer of every year", "credits": " 3", "description": "Introduction to quantitative social science research methods and applied analyses for understanding research reports and developing graduate level research projects.", "alias": "ADV 875, COM 800, JRN 817, TC 802"}, "ADV816": {"name": " Fundraising and Philanthropy in Nonprofit Organizations", "semester": "Spring of every year", "credits": " 3", "description": "Principles, function, practice, ethics, and process of fundraising and philanthropic development. Societal role of nonprofit organizations.", "restrictions": "Open to graduate students in the College of Communication Arts and Sciences."}, "ADV823": {"name": " Consumer Behavior Theories", "semester": "Fall of every year", "credits": " 3", "description": "Concepts and theories from behavioral sciences applied to consumer decision making. Application of theories to develop consumer behavior research studies, advertising and public relations programs. Interpersonal and mass communication applied to consumer decision making."}, "ADV826": {"name": " Advertising and Promotion Management", "semester": "Spring of every year", "credits": " 3", "description": "Planning promotional strategy. Establishing policies for decision-making. Execution and evaluation of advertising and sales promotion programs. Emphasis on case analysis.", "prerequisite": "MKT 805 and ADV 823 and (COM 803 or concurrently)"}, "ADV830": {"name": " Seminar in Social Marketing", "semester": "Spring of every year", "credits": " 3", "description": "In-depth reading and critical thinking about theories and principles in social marketing. Application of theory and empirical research to evaluating and planning social marketing programs."}, "ADV836": {"name": " Media Innovations", "semester": "Fall of every year", "credits": " 3", "description": "Alternative methods of advertising. Effects of non-traditional advertising strategies on consumers. Theoretical and methodological approaches."}, "ADV843": {"name": " Strategic Brand Communication", "semester": "Fall of every year", "credits": " 3", "description": "Brand communication research and strategy. Applications to new media and technology. Innovation and brand development, emphasizing futures research and perceptual mapping."}, "ADV846": {"name": " Media Strategy", "semester": "Spring of every year", "credits": " 3", "description": "Planning, execution, and control of media programs. Theory and techniques of budget allocation including marginal analysis, mathematical programming, simulation and game theory."}, "ADV850": {"name": " Public Relations Management", "semester": "Fall of every year", "credits": " 3", "description": "Managing public relations campaigns and programs, including research, planning, implementation, and evaluation. Using theory and practice to design strategic public relations programs for clients or sponsoring organizations"}, "ADV855": {"name": " Public Relations Theories", "semester": "Spring of every year", "credits": " 3", "description": "Evolving and relevant theories drawn from psychology, communication, sociology, education and management that guide research and inform the management function of effective public relations counseling.", "prerequisite": "ADV 850"}, "ADV860": {"name": " Media Relations", "semester": "Spring of every year", "credits": " 3", "description": "Theory and practice of how public relations professionals work with the news media to communicate with external publics."}, "ADV865": {"name": " Advertising and Society", "semester": "Fall of every year", "credits": " 3", "description": "Impact of advertising on individuals, society, and the economy. Public policy issues relevant to advertising. Regulation by government and industry."}, "ADV870": {"name": " International Advertising", "semester": "Spring of every year", "credits": " 3", "description": "International dimensions of advertising and other marketing communications. Comparative analysis of economic, cultural, and legal conditions that affect advertising activities. International and foreign media."}, "ADV890": {"name": " Independent Study", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 9", "description": "Directed study under faculty supervision.", "restrictions": "Open to graduate students. Approval of department."}, "ADV892": {"name": " Special Topics", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Emerging topics in advertising and public relations."}, "ADV893": {"name": " Practicum", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 3", "description": "Supervised experience in advertising and/or public relations settings.", "restrictions": "Open to graduate students in the Department of Advertising and Public Relations or approval of department."}, "ADV899": {"name": " Master's Thesis Research", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 8", "description": "Faculty supervised thesis research.", "restrictions": "Open to students in the Advertising major or in the Public Relations Major."}, "ADV900": {"name": " Theory Building in Media and Information Studies", "semester": "Fall of every year", "credits": " 3", "description": "Concepts and issues relating explanation, scientific inquiry, theory building and applications to interdisciplinary studies in media and information."}, "ADV916": {"name": " Qualitative Research Methods", "semester": "Spring of every year", "credits": " 3", "description": "Qualitative research in mass and specialized communication systems. Topics include documentary, bibliographic, case study and participant observation methods.", "restrictions": "Open to doctoral students in the College of Communication Arts and Sciences."}, "ADV921": {"name": " Theories of Media and Information", "semester": "Fall of every year", "credits": " 3", "description": "Overview of the relations between information theory, communication theory, and media theory, and an understanding of how these theories have evolved over time and which competing approaches coexist.", "restrictions": "Open to doctoral students in the College of Communication Arts and Sciences or approval of college.", "alias": "ADV 921"}, "ADV960": {"name": " Media and Technology", "semester": "Spring of every year", "credits": " 3", "description": "Theoretical frameworks concerning media and communication processes, and their interactions with technology. Social, organizational, critical, and economic perspectives.", "restrictions": "Open to doctoral students in the Communication Major or in the Media and Information Studies Major or approval of department.", "alias": "TC 960"}, "ADV975": {"name": " Introductory Methods", "semester": "Fall of every year", "credits": " 3", "description": "A survey of qualitative and quantitative research design including validity and reliability, hypothesis formation, sampling, ethics, survey, experimental, ethnographic, observational and mixed methods.", "restrictions": "Open to doctoral students."}, "ADV985": {"name": " Advanced Quantitative Analysis for Media", "semester": "Spring of every year", "credits": " 3", "description": "Multivariate research methods for media and information studies research.", "prerequisite": "ADV 975"}, "ADV990": {"name": " Independent Study", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 3", "description": "Independent research under faculty direction.", "restrictions": "Open to doctoral students in the College of Communication Arts and Sciences or approval of college."}, "ADV991": {"name": " Ways of Knowing", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Ways humans acquire, convey, organize and shape knowledge and information, and are shaped and influenced by it. Neurological, psychological linguistic, philosophical, cultural, and logical dimensions of human knowledge.", "restrictions": "Open to doctoral students in the College of Communication Arts and Sciences or approval of college."}, "ADV992": {"name": " Doctoral Seminar", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Topics on theoretical and research issues in communication and mass media.", "restrictions": "Open to doctoral students in the College of Communication Arts and Sciences or approval of college."}, "ADV993": {"name": " Research Practicum in Information and Media", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 3", "description": "Directed research collaboration with a faculty member or a team of students/faculty.", "restrictions": "Open to doctoral students in the College of Communication Arts and Sciences or approval of college."}}}