{"code": "AFRE", "name": "Agricultural, Food, and Resource Economics", "courses": {"AFRE801": {"name": " Mathematical Applications in Economics", "semester": "Fall of every year", "credits": " 3", "description": "Mathematical tools in economic analysis. Matrix algebra, derivatives, partial derivatives, optimization, integration, and linear differential equations.", "restrictions": "Open to graduate students.", "alias": "AEC 801, EC 801"}, "AFRE802": {"name": " Statistical Methods for Agricultural, Food, and Resource Economists", "semester": "Fall of every year", "credits": " 3", "description": "Applications of statistical tools for economic analysis.", "alias": "AEC 802"}, "AFRE805": {"name": " Microeconomic Analysis", "semester": "Fall of every year", "credits": " 3", "description": "Microeconomic theory with calculus. Production, costs, demand, markets, general equilibrium, and welfare theory.", "restrictions": "Open to graduate students.", "alias": "AEC 805, EC 805"}, "AFRE810": {"name": " Institutional and Behavioral Economics", "semester": "Fall of every year", "credits": " 3", "description": "Relationships among institutions, individual and collective actions, and economic performance. Public choice, property rights, and behavioral theories of firms and bureaucracies.", "alias": "AEC 810"}, "AFRE817": {"name": " Political Economy of Agricultural and Trade Policy", "semester": "Spring of every year", "credits": " 3", "description": "Concepts of policy analysis and decision. Agricultural sector problems, behavior, and policy in the development process. Macroeconomic and trade impacts. International policies affecting trade and development. Current policy issues.", "alias": "AEC 817"}, "AFRE821B": {"name": " Cross Section and Panel Data Econometrics II", "semester": "Spring of every year", "credits": " 3", "description": "Analyses of quasi-maximum likelihood estimation, count data models, fractional response models, duration models, sample selection and attrition, stratified sampling, estimating treatment effects, stochastic frontier models, and other advanced topics.", "prerequisite": "EC 821A"}, "AFRE823": {"name": " Environmental Economics Methods", "semester": "Fall of odd years", "credits": " 3", "description": "Empirical and econometric methods in environmental economics focusing on theory and application of nonmarket valuation techniques.", "prerequisite": "AFRE 805 and AFRE 835", "alias": "AEC 823"}, "AFRE829": {"name": " Economics of Environmental Resources", "semester": "Spring of every year", "credits": " 3", "description": "Economic principles, theoretical models, and empirical methods related to environmental problems and policy interventions. Applications to air, land, water, forests, energy, fish and wildlife, and climate change, including in developing countries.", "alias": "AEC 829"}, "AFRE835": {"name": " Introductory Econometrics", "semester": "Spring of every year", "credits": " 3", "description": "Estimation and interpretation of multiple regression models and their modifications when usual assumptions are not valid. Applications focus on problems faced by agricultural economists.", "alias": "AEC 835"}, "AFRE841": {"name": " Analysis of Food System Organization and Performance", "semester": "Fall of every year", "credits": " 3", "description": "Industrial organization, subsector, and transaction cost approaches to analyzing coordination and performance of agricultural markets, contracting, and integration in the food systems of industrialized and developing countries. Applications to issues of organization, control, and public policy.", "alias": "AEC 841"}, "AFRE851": {"name": " Agribusiness Operations Management", "semester": "Spring of every year", "credits": " 3", "description": "Managerial processes for agribusiness operations control. Applications of linear programming. Budgets, simulations, and dynamic programming. Statistical process control. Predictive and prescriptive analysis.", "alias": "AEC 851"}, "AFRE857": {"name": " Strategic Management in Agribusiness", "semester": "Fall of every year", "credits": " 3", "description": "Managerial problems faced by agribusiness firms. Strategies to interpret and respond to forces affecting the industry. Case study approach.", "alias": "AEC 857, AEC 891A"}, "AFRE861": {"name": " Agriculture in Economic Development", "semester": "Fall of every year", "credits": " 3", "description": "Theories and role of agriculture in economic development. Effects of policies, institutions, organizations, and technologies.", "alias": "AEC 861"}, "AFRE865": {"name": " Agricultural Benefit-Cost Analysis", "semester": "Fall of every year", "credits": " 3", "description": "Benefit-cost analysis of agricultural and natural resource projects, including financial and economic analysis. Case studies in project design and appraisal in low and high income countries.", "alias": "AEC 865"}, "AFRE874": {"name": " Empirical Methods for Field Research in Developing Countries", "semester": "Spring of every year", "credits": " 3", "description": "Research design, sampling, questionnaire design, data collection and analysis of multi-topic household surveys for international development issues.", "alias": "AEC 874, AEC 891C"}, "AFRE890": {"name": " Independent Study", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 3", "description": "Independent study of selected topics in agricultural, food, and resource economics.", "restrictions": "Open to graduate students in the Department of Agricultural, Food, and Resource Economics. Approval of department.", "alias": "AEC 890"}, "AFRE891": {"name": " Topics in Agricultural, Food, and Resource Economics", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 3", "description": "Selected topics in analytical methods, agri-food systems economics and management, and agricultural and natural resource development and policy.", "alias": "AEC 891"}, "AFRE898": {"name": " Master's Research", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 4", "description": "Master's degree Plan B research.", "restrictions": "Open to master's students in the Department of Agricultural, Food, and Resource Economics. Approval of department.", "alias": "AEC 898"}, "AFRE899": {"name": " Master's Thesis Research", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 6", "description": "Master's thesis research.", "restrictions": "Open to master's students in the Department of Agricultural, Food, and Resource Economics. Approval of department.", "alias": "AEC 899"}, "AFRE900A": {"name": " Applied Microeconomics I", "semester": "Fall of every year", "credits": " 3", "description": "Empirical analysis of microeconomic problems with emphasis on applications to agriculture, natural resources, and the food sector.", "prerequisite": "(AFRE 805 or EC 812A) and (AFRE 835 or EC 820A)", "alias": "AEC 900A"}, "AFRE900B": {"name": " Applied Microeconomics II", "semester": "Spring of every year", "credits": " 3", "description": "Extended empirical analysis of microeconomic problems with emphasis on applications to agriculture, natural resources, and the food sector.", "prerequisite": "(AFRE 805 or EC 812A) and (AFRE 835 or EC 820A)", "alias": "AEC 900B"}, "AFRE923": {"name": " Advanced Environmental Economics", "semester": "Fall of every year", "credits": " 3", "description": "Advanced economic theory of environmental management and policy. Treatment of externalities and market and non-market approaches to environmental improvement. Applications to research and policy.", "alias": "AEC 923"}, "AFRE925": {"name": " Advanced Natural Resource Economics", "semester": "Spring of every year", "credits": " 3", "description": "Economic theory of managing nonrenewable and renewable resources, including optimal use, the incentives for use under decentralized markets, and public policy design. Analysis of the co-evolution of economic and ecological systems.", "alias": "AEC 991H, AEC 925"}, "AFRE930": {"name": " Dynamic Analysis in Agriculture and Natural Resources", "semester": "Spring of every year", "credits": " 3", "description": "Methods of dynamic optimization and their application to agricultural and natural resources problems. Discrete time dynamic programming, calculus of variations, and discrete time maximum principle.", "restrictions": "Open to doctoral students in the College of Agriculture and Natural Resources or in the Eli Broad College of Business and The Eli Broad Graduate School of Management or in the College of Social Science or approval of department.", "alias": "AEC 991E, AEC 930"}, "AFRE932": {"name": " Information Economics and Institutions in Agriculture and Natural Resources", "semester": "Fall of every year", "credits": " 3", "description": "Applications to issues in agriculture, agribusiness, the food system, natural resources, and the environment. Asymmetric information, incomplete markets, principal/agent issues, transaction costs, and the design of contracts and other institutions.", "restrictions": "Open to doctoral students in the College of Agriculture and Natural Resources or in the Eli Broad College of Business and The Eli Broad Graduate School of Management or in the College of Social Science.", "alias": "AEC 932"}, "AFRE961": {"name": " Advanced Agricultural Development Economics", "semester": "Spring of every year", "credits": " 3", "description": "Theoretical and empirical models of microeconomics of international agricultural development, with emphasis on household and individual behaviors related to production, investment and marketing decisions.", "prerequisite": "EC 812A and EC 812B and EC 820A and EC 820B", "alias": "AEC 961"}, "AFRE991": {"name": " Advanced Topics in Agricultural, Food, and Resource Economics", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 3", "description": "Advanced topics such as price analysis, finance, risk and modeling techniques, agri-food systems, environmental economics and management, and agricultural and natural resource development and policy.", "restrictions": "Open to doctoral students in the College of Agriculture and Natural Resources or in the Eli Broad College of Business and The Eli Broad Graduate School of Management or in the College of Social Science.", "alias": "AEC 991"}, "AFRE999": {"name": " Doctoral Dissertation Research", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 24", "description": "Doctoral dissertation research.", "restrictions": "Open to doctoral students in the Department of Agricultural, Food, and Resource Economics or in the Agricultural, Food and Resource Economics Major. Approval of department.", "alias": "AEC 999"}}}