{"code": "AIIS", "name": "American Indian and Indigenous Studies", "courses": {"AIIS201": {"name": " Introduction to American Indian and Indigenous Studies", "semester": "Spring of every year", "credits": " 3", "description": "Introduction to the study of American Indian and other Indigenous peoples, including issues related to culture, knowledge, language, governance, colonization, sovereignty, and ongoing revitalization efforts.", "alias": "AL 202"}, "AIIS490": {"name": " Independent Study", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 6", "description": "Special project, directed reading and research arranged by an undergraduate student and a faculty member in areas supplementing regular course offerings.", "restrictions": "Approval of department."}, "AIIS491": {"name": " Topics in American Indian and Indigenous Studies", "semester": "Spring of every year", "credits": " 3", "description": "An upper-level topics course, based on the expertise of the instructor, focusing on American Indian and other Indigenous peoples, including – but not limited to – issues related to culture, knowledge, language, governance, colonization, sovereignty, and ongoing revitalization efforts."}, "AIIS493": {"name": " Internship in American Indian and Indigenous Studies", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 6", "description": "Supervised pre-professional field experience in the arts and humanities working with an American Indian or Indigenous elder, community, government, organization, agency, or business.", "restrictions": "Approval of department."}, "AIIS801": {"name": " Indigenous Theories and Methodologies", "semester": "Spring of every year", "credits": " 3", "description": "Indigenous ways of knowing. Transdisciplinary theories and methodologies. Indigenous determination. Indigenous sovereignties. Community-oriented research."}, "AIIS890": {"name": " Independent Study in American Indian and Indigenous Studies", "semester": "On Demand", "credits": "Variable from 1 to 6", "description": "Independent study in American Indian and Indigenous Studies.", "restrictions": "Approval of department."}, "AIIS891": {"name": " Special Topics in American Indian and Indigenous Studies", "semester": "On Demand", "credits": " 3", "description": "Special topics in American Indian and Indigenous Studies"}}}