{"code": "ANR", "name": "Agriculture and Natural Resources", "courses": {"ANR150": {"name": " Academic Success and Careers in Agriculture and Natural Resources", "semester": "Fall of every year", "credits": " 3", "description": "Decision making and critical thinking for success in college. Time management, classroom ethics, test taking, listening and writing. University resources and career paths in agriculture and natural resource fields.", "restrictions": "Open to freshmen."}, "ANR192": {"name": " Environmental Issues Seminar", "semester": "Fall of every year", "credits": " 1", "description": "Environmental issues and problems explored from a variety of perspectives, including legal, scientific, historical, political, socio-economic, and technical points of view.", "restrictions": "Open to students in the College of Communication Arts and Sciences or in the College of Engineering or in the College of Natural Science or in the College of Social Science. Approval of college."}, "ANR210": {"name": " Pathways in Integrated Learning", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Active, self-directed, and reflective learning associated with agriculture and natural resource issues, self and social development, and ethical choice making. Development of a learning plan and design of a learning portfolio. Individual and group presentations.", "restrictions": "Not open to seniors."}, "ANR250": {"name": " Global Issues in Agriculture and Natural Resources", "semester": "Fall of every year", "credits": " 3", "description": "Globalization. Economic, political, and social issues related to natural resources and agricultural production. Historical perspectives and future projections.", "prerequisite": "Completion of Tier I Writing Requirement", "alias": "AEE 301"}, "ANR292": {"name": " Applications in Environmental Studies", "semester": "Spring of every year", "credits": " 2", "description": "Community engagement project. Projects vary depending on student's major and area of environmental interest.", "restrictions": "Open to students in the Environmental Studies Specialization."}, "ANR310": {"name": " Integrated Learning Seminar I", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": " 3", "description": "Learner-directed critical analysis of contemporary issues in community systems. Communication of outcomes to professional communities. Collaborative learning integrated with individual experiences.", "prerequisite": "ANR 210"}, "ANR311": {"name": " Integrated Learning Seminar II", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 6", "description": "Advanced analysis and presentation of contemporary issues in community systems", "prerequisite": "ANR 310 or approval of college"}, "ANR392": {"name": " Agriculture and Natural Resources Seminar", "semester": "Spring of every year", "credits": " 1", "description": "Current agricultural, natural resources and environmental problems and solutions. Discussion leaders from various disciplines.", "restrictions": "Not open to freshmen or sophomores."}, "ANR410": {"name": " Integrated Learning Transitions", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Synthesis and analysis of structured experiences in community systems. Personal and interpersonal development, personal and professional integrity, communication competence, and critical and reflective thinking.", "prerequisite": "ANR 310", "restrictions": "Open to juniors or seniors."}, "ANR475": {"name": " International Studies in Agriculture and Natural Resources", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 2 to 6", "description": "Study-travel experience. Contemporary problems affecting agriculture and natural resources in world, national and local communities. Case studies and interviews with officials, community leaders and leading professionals.", "restrictions": "Approval of college; application required."}, "ANR490": {"name": " Independent Study in Agriculture and Natural Resources", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 4", "description": "Supervised individual study in topics related to agriculture and natural resources.", "restrictions": "Open to sophomores or juniors or seniors or graduate students in the College of Agriculture and Natural Resources."}, "ANR491": {"name": " Selected Topics", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 4", "description": "Special topics in agriculture and natural resources.", "restrictions": "Not open to freshmen or sophomores."}, "ANR493": {"name": " Professional Internship in Agriculture and Natural Resources", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": " 3", "description": "Supervised professional experiences in agencies and businesses related to a student's major field of study.", "restrictions": "Open to juniors or seniors in the College of Agriculture and Natural Resources. Approval of department; application required. A student may earn a maximum of 6 credits in all enrollments for any or all of these courses"}, "ANR820": {"name": " Proseminar in Food and Agricultural Standards", "semester": "Fall of every year", "credits": " 3", "description": "Interdisciplinary theoretical and applied perspectives on societal roles and implications of standards in food and agriculture."}, "ANR891": {"name": " Food and Agricultural Standards Seminar", "semester": "Spring of every year", "credits": " 3", "description": "Integration of multidisciplinary perspectives on Food and Agricultural Standards.", "prerequisite": "SSC 820"}}}