{"code": "AS", "name": "Aerospace Studies", "courses": {"AS111": {"name": " Foundation of the United States Air Force I", "semester": "Fall of every year", "credits": " 1", "description": "Introduction to the U.S. Air Force today. Mission and organization; group leadership problems; introduction to communication skills."}, "AS111L": {"name": " Foundation of the United States Air Force I Laboratory", "semester": "Fall of every year", "credits": " 1", "description": "Introduces new cadets to AFROTC and the Air Force. Provides cadets with basic skill and knowledge to be a functional member of the AFROTC cadet corps. Gives the cadets information to help them decide whether to continue with AFROTC and pursue a commission if the USAF. The laboratory covers five major subject areas."}, "AS112": {"name": " Foundation of the United States Air Force II", "semester": "Spring of every year", "credits": " 1", "description": "Introduction to the U.S. Air Force today. Officership and professionalism; group leadership problems; introduction to communication skills."}, "AS112L": {"name": " Foundation of the United States Air Force II Laboratory", "semester": "Spring of every year", "credits": " 1", "description": "Introduces new cadets to AFROTC and the Air Force. Provides cadets with basic skills and knowledge to be a functional member of the AFROTC cadet corp. Gives the cadets information to help them decide whether to continue with AFROTC and pursue a commission in the USAF."}, "AS211": {"name": " The Evolution of USAF Air and Space Power I", "semester": "Fall of every year", "credits": " 1", "description": "Air Force heritage. Evolution of air power concepts and doctrine; introduction to ethics and values; introduction to leadership; continuing application of communication skills."}, "AS211L": {"name": " The Evolution of USAF Air and Space Power I Laboratory", "semester": "Fall of every year", "credits": " 1", "description": "The second year of leadership laboratory provides training to ensure every cadet is mentally and physically prepared to attend field training during the following summer. The course continues and amplifies subject areas from the 100 year."}, "AS212": {"name": " The Evolution of USAF Air and Space Power II", "semester": "Spring of every year", "credits": " 1", "description": "Air Force leaders. Role of technology in the growth of air power; introduction to Quality Air Force; group leadership problems; continuing application of communication skills."}, "AS212L": {"name": " The Evolution of USAF Air and Space Power II Laboratory", "semester": "Spring of every year", "credits": " 1", "description": "The second year of leadership laboratory provides training to ensure every cadet is mentally and physically prepared to attend field training during the following summer."}, "AS321": {"name": " Air Force Leadership Studies I", "semester": "Fall of every year", "credits": " 3", "description": "Communication, management, and ethical skills for Air Force officers. Emphasizes standards and professionalism in the modern officer corps. Leadership laboratory required for AFROTC cadets."}, "AS321L": {"name": " Air Force Leadership Studies I Laboratory", "semester": "Fall of every year", "credits": " 1", "description": "Provides cadets the opportunity to exercise leadership skills in the operation and administration of the cadet wing in a constructive learning environment.", "restrictions": "Open to undergraduate students in the Department of Aerospace Studies. Approval of department."}, "AS322": {"name": " Air Force Leadership Studies II", "semester": "Spring of every year", "credits": " 3", "description": "Leadership theory, traditional Air Force management functions, and current practices. Emphasizes the application of leadership concepts by junior officers. Leadership laboratory required for AFROTC cadets."}, "AS322L": {"name": " Air Force Leadership Studies II Laboratory", "semester": "Spring of every year", "credits": " 1", "description": "Provides cadets the opportunity to exercise leadership skills in the operation and administration of the cadet wing in a constructive learning environment.", "restrictions": "Open to undergraduate students in the Department of Aerospace Studies. Approval of department."}, "AS421": {"name": " National Security Affairs", "semester": "Fall of every year", "credits": " 3", "description": "Formation and implementation of defense policy and strategy. Bureaucratic interplay and impact of nuclear technology. Investigation of current defense issues. Leadership laboratory required for AFROTC cadets."}, "AS421L": {"name": " National Security Affairs Laboratory", "semester": "Fall of every year", "credits": " 1", "description": "Cadets continue to exercise their leadership skills generally in higher-level corps leadership positions. The focus is on developing leadership skills and knowledge that will be needed at their first duty station.", "restrictions": "Open to undergraduate students in the Department of Aerospace Studies. Approval of department."}, "AS422": {"name": " National Security Affairs and Preparation For Active Duty", "semester": "Spring of every year", "credits": " 3", "description": "Role of the professional officer in a democratic society. Global security issues. Military justice and the laws of war. Leadership laboratory required for AFROTC cadets."}, "AS422L": {"name": " National Security Affairs II Laboratory", "semester": "Spring of every year", "credits": " 1", "description": "Cadets continue to exercise their leadership skills, generally in higher-level corps leadership positions.", "restrictions": "Open to undergraduate students in the Department of Aerospace Studies. Approval of department."}, "AS490": {"name": " Independent Study", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": " 3", "description": "Investigation of a particular aspect of aerospace studies.", "restrictions": "Open to juniors or seniors. Approval of department."}}}