{"code": "CE", "name": "Civil Engineering", "courses": {"CE221": {"name": " Statics", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Vector description of forces and moments. Two- and three- dimensional equilibrium of particles and rigid bodies. Analysis of trusses, frames, and machines. Coulomb friction.", "prerequisite": "{(PHY 183 or PHY 183B or PHY 193H) or (PHY 231 and PHY 233B)} and ((MTH 234 or concurrently) or (LB 220 or concurrently) or (MTH 254H or concurrently))", "alias": "MSM 205"}, "CE273": {"name": " Civil and Environmental Engineering Measurements", "semester": "Fall of every year, Spring of every year", "credits": " 2", "description": "Measurements, surveying and error analysis with applications to civil and environmental engineering problems", "prerequisite": "((MTH 132 or concurrently) or (MTH 152H or concurrently) or (LB 118 or concurrently)) and (EGR 102 or concurrently)", "alias": "CE 271"}, "CE274": {"name": " Graphics for Civil and Environmental Engineers", "semester": "Fall of every year, Spring of every year", "credits": " 1", "description": "Basic operations in CAD software with applications in civil and environmental engineering", "prerequisite": "((MTH 132 or concurrently) or (MTH 152H or concurrently) or (LB 118 or concurrently)) and (EGR 100 or concurrently)", "alias": "CE 272"}, "CE280": {"name": " Principles of Environmental Engineering and Science", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Physical, chemical and biological processes related to environmental science and engineering. Environmental systems analysis with application to air, water and soil. Analysis of environmental problems and development of engineering solutions.", "prerequisite": "(CEM 141 or CEM 151 or LB 171) and ((MTH 132 or concurrently) or (MTH 152H or concurrently) or (LB 118 or concurrently))"}, "CE305": {"name": " Introduction to Structural Analysis", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Theory of structural analysis for statically determinate structures. Qualitative structural analysis and behavior. Load estimation and placement. Introduction to structural analysis computer software. Introduction to statically indeterminate structures.", "prerequisite": "ME 222 and (CE 273 or concurrently) and (CE 274 or concurrently)", "restrictions": "Open to juniors or seniors in the Department of Civil and Environmental Engineering."}, "CE312": {"name": " Soil Mechanics", "semester": "Fall of every year, Spring of every year", "credits": " 4", "description": "Engineering properties of soil and their measurement. Effective-stress concept. Permeability and seepage. Compaction. Consolidation, shear strength, and stress-strain behavior.", "prerequisite": "ME 222 and (CE 273 or concurrently) and (CE 274 or concurrently)", "restrictions": "Open to juniors or seniors in the Department of Civil and Environmental Engineering and open to juniors or seniors in the Biosystems Engineering major."}, "CE321": {"name": " Introduction to Fluid Mechanics", "semester": "Fall of every year, Spring of every year", "credits": " 4", "description": "Fluid properties, fluid statics, fluids in motion. Conservation of mass, energy, and momentum. Dimensional analysis and similitude. Internal and external flows. Applications.", "prerequisite": "(MTH 235) and CE 221 and Completion of Tier I Writing Requirement", "restrictions": "Open to juniors or seniors in the Department of Civil and Environmental Engineering or in the Biosystems Engineering Major.", "exclude": "ME 332"}, "CE337": {"name": " Civil Engineering Materials", "semester": "Fall of every year, Spring of every year", "credits": " 4", "description": "Common civil engineering construction and paving materials", "prerequisite": "(ME 222 or concurrently) and (CE 273 or concurrently) and (CE 274 or concurrently)", "restrictions": "Open to juniors or seniors in the Department of Civil and Environmental Engineering."}, "CE341": {"name": " Transportation Engineering", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Overview of transportation system issues and problems. Fundamentals of highway design and operations. Planning and evaluation of transportation system alternatives.", "prerequisite": "((MTH 234 or concurrently) or (MTH 254H or concurrently) or (LB 220 or concurrently)) and (((CE 273 or concurrently) and (CE 274 or concurrently)) and completion of Tier I writing requirement)", "restrictions": "Open to juniors or seniors in the Department of Civil and Environmental Engineering or in the Urban and Regional Planning major.", "alias": "CE 346"}, "CE371": {"name": " Sustainable Civil and Environmental Engineering Systems", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Principles and tools of sustainable design and engineering economics in Civil and Environmental Engineering.", "prerequisite": "((MTH 234 or concurrently) or (LB 220 or concurrently) or (MTH 254H or concurrently)) and ENE 280", "restrictions": "Open to juniors or seniors in the Civil Engineering Major or in the Environmental Engineering Major.", "alias": "CE 272"}, "CE372": {"name": " Risk Analysis in Civil and Environmental Engineering", "semester": "Fall of every year, Spring of every year", "credits": " 2", "description": "Applications of probability, statistics, uncertainty and risk analysis to topics in civil and environmental engineering, characterization of system safety, and comparison tests for engineering quality control and environmental analyses.", "prerequisite": "(MTH 234 or concurrently) or (LB 220 or concurrently) or (MTH 254H or concurrently)", "restrictions": "Open to juniors in the Civil Engineering Major or in the Environmental Engineering Major and open to seniors in the Civil Engineering Major or in the Environmental Engineering Major.", "alias": "CE 272"}, "CE400": {"name": " Structural Mechanics", "semester": "Fall of every year", "credits": " 3", "description": "Matrix methods of structural analysis. Flexibility method. Direct stiffness method for plane structures. Elastic supports, inclined supports, member releases and non-prismatic members. Application software.", "prerequisite": "CE 305", "restrictions": "Open to juniors or seniors or graduate students in the College of Engineering."}, "CE405": {"name": " Design of Steel Structures", "semester": "Spring of every year", "credits": " 3", "description": "Design of steel beams, columns, tension members and connections. Stability and plastic strength.", "prerequisite": "CE 305", "restrictions": "Open to juniors or seniors or graduate students in the Department of Civil and Environmental Engineering or in the College of Engineering."}, "CE406": {"name": " Design of Concrete Structures", "semester": "Fall of every year", "credits": " 3", "description": "Design of reinforced concrete beams, slabs, columns and footings.", "prerequisite": "CE 305 and CE 337", "restrictions": "Open to juniors or seniors or graduate students in the Department of Civil and Environmental Engineering or in the College of Engineering."}, "CE407": {"name": " Materials Engineering: Properties, Selection and Processing", "semester": "Spring of every year", "credits": " 3", "description": "General families of materials, materials design process for civil and environmental engineering problems, structural materials properties, processing methods and environment, microstructure of materials, structural materials selection by utilizing bubble charts.", "prerequisite": "CE 221 and ME 222", "restrictions": "Open to juniors or seniors in the Chemical Engineering Major or in the Mechanical Engineering Major or in the Civil Engineering Major."}, "CE418": {"name": " Geotechnical Engineering", "semester": "Fall of every year", "credits": " 3", "description": "Shallow foundation design", "prerequisite": "CE 312 and (GLG 201 or GLG 301)", "restrictions": "Open to juniors or seniors or graduate students in the College of Engineering."}, "CE421": {"name": " Engineering Hydrology", "semester": "Fall of every year", "credits": " 3", "description": "Hydrologic design of storm water systems. Equilibrium hydrograph analysis, unit hydrographs, infiltration, hydrograph synthesis, and reservoir routing. Groundwater", "prerequisite": "(CE 321) and (GLG 201 or GLG 301) and (CE 372 or STT 351)", "restrictions": "Open to juniors or seniors or graduate students in the College of Engineering or in the College of Natural Science or in the Department of Plant, Soil and Microbial Sciences."}, "CE422": {"name": " Applied Hydraulics", "semester": "Spring of every year", "credits": " 3", "description": "Fundamentals of open-channel flow. Rapidly and gradually varied nonuniform flow analysis. Confined flows past submerged bodies, in pipe networks, and in turbo machinery. Design applications.", "prerequisite": "CE 321 or ME 332", "restrictions": "Open to juniors or seniors or graduate students in the College of Engineering."}, "CE431": {"name": " Pavement Design and Analysis", "semester": "Fall of every year", "credits": " 3", "description": "Highway and airfield pavement structural design. Performance measures. Failure mechanisms. Popular thickness design procedures. Design considerations for surface friction, pavement joints, and drainage.", "prerequisite": "CE 337", "restrictions": "Open to juniors or seniors or graduate students in the College of Engineering."}, "CE432": {"name": " Pavement Rehabilitation", "semester": "Spring of odd years", "credits": " 3", "description": "Engineering concepts and information needed to rehabilitate pavements. Network and project survey and evaluation", "prerequisite": "CE 337", "restrictions": "Open to seniors or graduate students in the College of Engineering."}, "CE444": {"name": " Principles of Traffic Engineering", "semester": "Fall of every year", "credits": " 3", "description": "Driver and vehicle characteristics affecting traffic flow and safety. Speed, density, capacity relationships. Signal control in street networks. Freeway management systems. Risk management and liability.", "prerequisite": "CE 341", "restrictions": "Open to juniors or seniors or graduate students in the Civil Engineering Major."}, "CE448": {"name": " Transportation Planning", "semester": "Spring of every year", "credits": " 3", "description": "Transportation planning process and procedures. Estimation of travel demand using traditional models of trip generation, trip distribution, modal split, and traffic assignment. Use of \"quick-response\" procedures. Traffic impact of new facilities.", "prerequisite": "CE 341"}, "CE449": {"name": " Highway Design", "semester": "Fall of every year", "credits": " 3", "description": "Geometric design of highways. Operation, capacity, safety, and geometric features. Alignment, drainage and pavement design. Use of CAD systems in preparing contract plans.", "prerequisite": "CE 341", "restrictions": "Open to juniors or seniors or graduate students in the College of Engineering."}, "CE461": {"name": " Computational Methods in Civil Engineering", "semester": "Spring of every year", "credits": " 3", "description": "Theoretical, numerical, and computational methods for civil engineering problems. Physical modeling, numerical techniques, and programming methods. Focus on civil engineering dynamics, solving systems of differential equations, and visualizing the results.", "prerequisite": "(EGR 102 and CE 221) and (MTH 235 or MTH 340 or MTH 347H)", "restrictions": "Open to juniors or seniors or graduate students in the Civil Engineering Major.", "alias": "CE 390", "exclude": "ME 361"}, "CE471": {"name": " Construction Engineering - Equipment, Methods and Planning", "semester": "Spring of every year", "credits": " 3", "description": "Engineering and construction fundamentals of earthwork operations, moving of materials, concrete construction, formwork, false work, and other temporary structures. Relationship to a construction project's constructability, cost, and schedule.", "prerequisite": "(CE 305 and CE 312 and CE 337) or (CMP 305 and CMP 322)", "restrictions": "Open to juniors or seniors or graduate students in the College of Engineering or in the Department of Management or in the Construction Management major."}, "CE480": {"name": " Environmental Measurements Laboratory", "semester": "Fall of every year", "credits": " 1", "description": "Basic chemical and microbiological methods used in the analysis of environmental media. Laboratory safety, quality assurance, quality control, and statistics used in laboratory analysis. Related technical communication, laboratory report writing.", "prerequisite": "(CEM 161 or CEM 185H or LB 171L) and ENE 280 and (CEM 142 or CEM 152 or CEM 182H or LB 172) and ((ENE 481 or concurrently) or (ENE 483 or concurrently)) and Completion of Tier I Writing Requirement", "restrictions": "Open to juniors or seniors or graduate students in the College of Engineering."}, "CE481": {"name": " Environmental Chemistry: Equilibrium Concepts", "semester": "Fall of every year", "credits": " 3", "description": "Chemistry of natural environmental systems and pollutants. Equilibrium concepts and calculations for acid-base, solubility, complexion, redox and phase partitioning reactions and processes. Applications to ecosystem analysis, pollutant fate and transport, and environmental protection.", "prerequisite": "{(CEM 141 and CEM 142) or (CEM 151 and CEM 152) or (CEM 181H and CEM 182H) or (LB 171 and LB 172)} and (ENE 280 or BE 230 or GLG 201 or GLG 301 or approval of department)"}, "CE483": {"name": " Water and Wastewater Engineering", "semester": "Fall of every year", "credits": " 4", "description": "Engineering and scientific basis and design of physical, chemical and biological methods for the treatment of drinking water and wastewater. Operation process selection and design. Field trips required.", "prerequisite": "(ENE 280 or BE 230) and (CE 321 or CHE 311)", "restrictions": "Open to juniors or seniors or graduate students in the College of Engineering."}, "CE485": {"name": " Landfill Design", "semester": "Spring of every year", "credits": " 3", "description": "Geotechnical and environmental design of solid waste landfills.", "prerequisite": "ENE 280 and CE 312"}, "CE487": {"name": " Microbiology for Environmental Science and Engineering", "semester": "Spring of every year", "credits": " 3", "description": "Fundamentals of microbiology. Application of these concepts to environmental processes such as wastewater treatment, human health and bioremediation.", "prerequisite": "ENE 280"}, "CE489": {"name": " Air Pollution: Science and Engineering", "semester": "Spring of every year", "credits": " 3", "description": "Basic physical and chemical principles governing indoor and atmospheric air pollution. Elements of air pollution meteorology, climate change, atmospheric transformations and transport. Air pollution sources and methods for their control. The role of local, state and federal government in air pollution control.", "prerequisite": "(CEM 141 or CEM 151 or LB 171) and (MTH 133 or MTH 153H or LB 119) and (ENE 280 or BE 230) and (CE 321 or CHE 311)", "restrictions": "Open to juniors or seniors or graduate students in the College of Engineering."}, "CE490": {"name": " Independent Study", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 3", "description": "Civil engineering problem of specific interest to the student and a faculty member. May be analysis or design.", "restrictions": "Open to seniors in the College of Engineering. Approval of department."}, "CE492": {"name": " Selected Topics in Civil Engineering", "semester": "Fall of every year, Spring of every year", "credits": "Variable from 1 to 4", "description": "Selected topics related to construction engineering, fluid mechanics, geotechnical engineering, hydrology, pavements, structural engineering, or transportation engineering.", "restrictions": "Approval of department."}, "CE495": {"name": " Senior Design in Civil and Environmental Engineering", "semester": "Fall of every year, Spring of every year", "credits": " 4", "description": "Preliminary design. Application of design concepts in civil engineering. Integrated design solutions using geotechnical, hydrological, pavement, structural, environmental, and transportation considerations. Planning the design process. Design Specifications. Cost. Written and oral presentations. Issues of professional practice.", "prerequisite": "(CE 274 and CE 371 and CE 372) and (ENE 421 or ENE 422 or ENE 483 or ENE 489 or CE 418 or CE 431 or CE 405 or CE 406 or CE 444 or CE 449) and (ENE 421 or ENE 422 or ENE 483 or ENE 489 or CE 405 or CE 406 or CE 418 or CE 431 or CE 444 or CE 449) and (ENE 421 or ENE 422 or ENE 483 or ENE 489 or CE 405 or CE 406 or CE 418 or CE 431 or CE 444 or CE 449)", "restrictions": "Open to seniors in the Civil Engineering Major or in the Environmental Engineering Major."}, "CE801": {"name": " Nonlinear Structural Mechanics", "semester": "Spring of odd years", "credits": " 3", "description": "Theory and methods related to the nonlinear behavior and analysis of structures with focus on line-type elements in two dimensions. Inelastic behavior of structural materials. Stability of structures. Nonlinear behavior and analysis of members and structural systems. Methods for iterative solution strategies and use of special computer software."}, "CE802": {"name": " Introduction to Dynamics and Earthquake Engineering", "semester": "Fall of every year", "credits": " 2", "description": "Dynamic response of single degree-of-freedom systems. Damping in structures and soils. Time domain and frequency domain methods. Analytical and numerical solution techniques. Earthquake response spectra.", "exclude": "ME 461"}, "CE803": {"name": " Structural Dynamics", "semester": "Fall of every year", "credits": " 1", "description": "Dynamic analysis of beam, frame and truss structures. Classical and finite element formulations. Model analysis and numerical integration techniques. Response to earthquakes. Computing response using a finite element program."}, "CE804": {"name": " Advanced Mechanics for Civil Infrastructure", "semester": "Fall of every year", "credits": " 3", "description": "Advanced linear mechanics. Potential energy principle. Finite element formulations. Applications to problems in structural, geotechnical and pavement engineering.", "restrictions": "Open only to graduate students in the College of Engineering."}, "CE805": {"name": " Advanced Design of Steel Structures", "semester": "Spring of every year", "credits": " 3", "description": "Flexural and torsional instability of columns and beams. Slender cross-sectional elements, design of beam-columns. Torsion, plastic design, plate girders, composite steel-concrete construction, connections."}, "CE806": {"name": " Advanced Structural Concrete Design", "semester": "Spring of even years", "credits": " 3", "description": "Analysis and design of prestressed and conventionally reinforced concrete structures.", "alias": "CE 808"}, "CE807": {"name": " Seismic Structural Design", "semester": "Spring of even years", "credits": " 3", "description": "Theory and methods for the seismic design of buildings, bridges, and other structures. Emphasis on fundamental factors influencing and controlling structural response. Philosophies for ductile design, capacity design and performance- based design. Analysis of structural systems under seismic demands for design and assessment. Introduction to retrofit strategies."}, "CE808": {"name": " Structural Fire Engineering", "semester": "Spring of even years", "credits": " 3", "description": "Fire safety, fire codes, and fire engineering design methods. High temperature material properties, and behavior of materials and structures exposed to fires. Fire resistance design of steel, concrete, composite and timber structures. Use of the computer program for thermal and structural analysis."}, "CE809": {"name": " Advanced Composite Materials and Structures", "semester": "Spring of even years", "credits": " 3", "description": "Mechanics and design of advanced composite materials and structures and their use for civil infrastructure. Elastic anisotropy and failure theories. Micro- and macro-mechanical analysis of fiber-reinforced polymer composites, particulate composites, and nanocomposites. Analysis and behavior of laminated plates and shells. Design applications to civil and mechanical structures."}, "CE812": {"name": " Properties of Soils", "semester": "Fall of odd years", "credits": " 3", "description": "Saturated and unsaturated hydraulic properties, consolidation and shear strength properties, thermal properties, and numerical modeling. Laboratory determination of soil properties including, interpretation of experimental data."}, "CE813": {"name": " Soil Dynamics", "semester": "Fall of every year", "credits": " 1", "description": "Wave propagation in visco-elastic media. Seismic site response analysis. Foundation vibrations. Dynamic soil properties. Soil liquefaction. Dynamic earth pressures. Computing dynamic response of continuous medium using a finite element program and the complex response method.", "alias": "CE 803B"}, "CE815": {"name": " Selected Topics in Geotechnical Engineering", "semester": "Spring of every year", "credits": " 3", "description": "Selected topics related to soil stabilization, highway and airport soils, and frozen ground engineering."}, "CE818": {"name": " Advanced Geotechnical Design", "semester": "Spring of every year", "credits": " 3", "description": "Foundations and earth retaining structures. Bearing capacity, settlement, and lateral resistance of deep foundations. Advanced design of retaining structures using in-situ test data. Numerical solution of geotechnical problems."}, "CE821": {"name": " Groundwater Hydraulics", "semester": "Fall of every year", "credits": " 3", "description": "Physical properties of porous media. Equations of flow in saturated media. Flow nets, well flow and parameter measurement. Transport processes and the advective-dispersion equation for conservative contaminants."}, "CE822": {"name": " Groundwater Modeling", "semester": "Spring of even years", "credits": " 3", "description": "Analysis and modeling of groundwater flow, surface water and groundwater interaction, and reactive contaminant transport. Applied numerical methods for solving groundwater flow and contaminant transport equations. Case studies."}, "CE829": {"name": " Mixing and Transport in Surface Waters", "semester": "Fall of odd years", "credits": " 3", "description": "Waves, tides and shallow-water processes. Numerical solutions and applications of shallow-water equations to lakes, rivers and estuaries. Principles and processes of sediment transport, and dispersion of materials in surface waters. Wind-driven circulation in Lake Michigan.", "prerequisite": "ENE 801"}, "CE831": {"name": " Advanced Concrete Pavement Analysis and Design", "semester": "Spring of odd years", "credits": " 3", "description": "Theoretical models for analysis of concrete pavement systems. Impact of concrete material on pavement response and performance. Formulation of improved mechanistic structural design procedures."}, "CE832": {"name": " Advanced Asphalt Pavement Analysis and Design", "semester": "Spring of even years", "credits": " 3", "description": "Mechanistic approach to asphalt pavement design. Analysis of asphalt pavement systems using theoretical models, asphalt material modeling, prediction, and performance. Formulation of improved mechanistic structural and mix design procedures."}, "CE835": {"name": " Engineering Management of Pavement Networks", "semester": "Spring of even years", "credits": " 3", "description": "Theoretical and statistical analysis of pavement networks. Engineering monitoring. Determination of distress mechanisms and engineering solutions. Assignment of priorities to engineering actions."}, "CE836": {"name": " Materials Science for Civil Engineers", "semester": "Fall of every year", "credits": " 3", "description": "Structure of materials and structure-property relationships. Principles and theories governing mechanical, physical, and durability characteristics of civil engineering materials. Material selection, production, and quality control."}, "CE837": {"name": " Advanced Concrete Materials", "semester": "Spring of odd years", "credits": " 3", "description": "Microstructure, engineering characteristics and modeling of concrete materials. Structure- property relationships in concrete materials. Control of concrete structure and properties for different infrastructure applications."}, "CE838": {"name": " Bituminous Materials", "semester": "Fall of even years", "credits": " 3", "description": "Superpave asphalt mix design, binder tests, hot mix asphalt performance tests, viscoelasticity, continuum damage models, image analysis methods."}, "CE841": {"name": " Traffic Flow Theory", "semester": "Spring of every year", "credits": " 3", "description": "Microscopic and macroscopic traffic flow models, Queueing theory. Gap acceptance. Simulation models for network analysis. Intelligent vehicle highway systems."}, "CE844": {"name": " Highway and Traffic Safety", "semester": "Fall of odd years", "credits": " 3", "description": "Analysis of highway geometric design alternatives and operational-control strategies with respect to accident probabilities. Statistical methods of pattern identification. Countermeasure selection and evaluation methodology. Risk management."}, "CE847": {"name": " Traffic Analysis and Control", "semester": "Spring of odd years", "credits": " 3", "description": "Modern traffic control and traffic modeling using state-of-the-art algorithms and computer models. Practical implications.", "prerequisite": "CE 444"}, "CE849": {"name": " Transportation Research Methods", "semester": "Spring of every year", "credits": " 3", "description": "Application and interpretation of quantitative methods and design of experiments for transportation research; ANOVA, non-parametric, discriminant analysis, factor analysis, multivariate regression, SPSS."}, "CE850": {"name": " Intelligent Transportation Systems (ITS)", "semester": "Fall of odd years", "credits": " 3", "description": "Technical and policy aspects emerging from the application of advanced technologies to transportation problems. Intelligent Transportation Systems (ITS) user services requirements, available and emerging technologies, case studies of ongoing operational tests, legal institutional and planning issues related to ITS development and deployment."}, "CE851": {"name": " Transportation and the Environment", "semester": "Spring of even years", "credits": " 3", "description": "The impact of transportation systems on the environment. Elements of Environmental Impact Statements. Policy options and their consequences. Alternatives for reducing environmental impact.", "restrictions": "Open only to graduate students in the College of Engineering."}, "CE872": {"name": " Finite Element Method", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Theory and application of the finite element method to the solution of continuum type problems in heat transfer, fluid mechanics, and stress analysis.", "alias": "AE 809, MSM 809"}, "CE878": {"name": " Autonomous Futures: Self-driving Vehicles, Domotics, and Artificial Intelligence in Smart Cities", "semester": "Fall of every year", "credits": " 3", "description": "Characteristics of autonomous systems and emerging technology. Perceptions of people on future transport, mobility, housing, and living. International perspectives on ethics and transitions towards autonomous futures. Implications for engineering, policy, business, and planning."}, "CE880": {"name": " Civil Engineering Seminar", "semester": "Fall of every year, Spring of every year", "credits": " 1", "description": "Current research in civil engineering."}, "CE890": {"name": " Independent Study in Civil Engineering", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 4", "description": "Research problems of limited scope not pertaining to thesis accomplished under CE 899 or CE 999.", "restrictions": "Open to graduate students in the Department of Civil and Environmental Engineering. Approval of department."}, "CE891": {"name": " Selected Topics in Civil Engineering", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 4", "description": "Selected topics in new or developing areas of civil engineering."}, "CE892": {"name": " Master's Research Project", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 5", "description": "Master's degree Plan B individual student research project. Original research, research replication, or survey and reporting on a research topic.", "restrictions": "Open only to master's students in the Civil Engineering major. Approval of department."}, "CE899": {"name": " Master's Thesis Research", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 8", "description": "Master's thesis research."}, "CE900": {"name": " Research Strategies and Methods in Civil Engineering", "semester": "Spring of every year", "credits": " 1", "description": "Criteria for quality research, scientific method, scientific arguments, statistical testing, critical thinking skills, reviewing journal articles, literature synthesis, writing proposals and papers, giving presentations, responsible conduct of research.", "restrictions": "Open to graduate students in the Department of Civil and Environmental Engineering.", "exclude": "ENE 900"}, "CE990": {"name": " Independent Study in Civil Engineering", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 4", "description": "Research problems of limited scope not pertaining to thesis accomplished under CE 999.", "restrictions": "Open only to doctoral students in the Civil Engineering major."}, "CE999": {"name": " Doctoral Dissertation Research", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 24", "description": "Doctoral dissertation research."}}}