{"code": "CEP", "name": "Counseling, Educational Psy &amp; Special Education", "courses": {"CEP150": {"name": " Reflections on Learning", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": " 3", "description": "Students' experiences as learners in comparison to psychological, sociological, and anthropological theories and assumptions about learning and teaching in and out of school."}, "CEP201": {"name": " Current Issues in Education", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Contemporary and perennial issues in elementary, secondary, and higher education."}, "CEP240": {"name": " Diverse Learners in Multicultural Perspective", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": " 3", "description": "Communicative, linguistic, physical, sensory, behavioral, affective, and cognitive differences in learning in multicultural classrooms. Factors that mediate access to knowledge.", "restrictions": "Open to undergraduate students in the Department of Communicative Sciences and Disorders or in the Kinesiology major or in the Special Education-Learning Disabilities major and open to undergraduate students in the Child Development major."}, "CEP260": {"name": " Dynamics of Personal Adjustment", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": " 3", "description": "Theories and issues in psychological adjustment. Dynamics operating within individuals and in their interactions with others. Implications for learning, development, and well-being."}, "CEP261": {"name": " Substance Abuse", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": " 3", "description": "Effects of mood-altering chemicals. Treatment approaches and resources. Special emphasis on adolescent users."}, "CEP301": {"name": " Literacy Instruction for Students With Mild Impairments (W)", "semester": "Spring of every year", "credits": " 3", "description": "Reading and writing instruction for struggling learners. Characteristics of literacy problems in students with mild impairments. Adaptation for teaching reading and writing.", "prerequisite": "Completion of Tier I Writing Requirement", "restrictions": "Open to juniors or seniors in the Special Education-Learning Disabilities major and open to graduate students in the Special Education major."}, "CEP345": {"name": " Language and Literacy Development and Disorders", "semester": "Fall of every year", "credits": " 3", "description": "Language and literacy development. Communication delays and disorders and their impact on reading and writing achievement. Interventions for language-based literacy problems.", "restrictions": "Open to undergraduate students in the Special Education-Learning Disabilities Major."}, "CEP370": {"name": " Educating Students with Special Needs", "semester": "Fall of even years", "credits": " 3", "description": "Categories of special education. Identification criteria, prevalence, demographics of exceptional children. Interventions and instructional practices. Law, advocacy, and family systems."}, "CEP416": {"name": " Teaching and Learning With Technology", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": " 3", "description": "Uses of multimedia technology and social media in teaching and learning. Developing plans for integrating technology in classroom. Designing digital online portfolio as tool for professional development. Teaching school subject matter with technology.", "restrictions": "Open to juniors or seniors or graduate students in the College of Education."}, "CEP449": {"name": " Behavior Management in Special Education", "semester": "Spring of every year", "credits": " 3", "description": "Management practices for behavior problems and disorders. Applied behavior analysis, social skills acquisition through cooperative learning and cooperative discipline. Focus on problem-solving and peer collaboration.", "alias": "CEP 849"}, "CEP451": {"name": " Models of Special Education Administration and Services", "semester": "Fall of every year", "credits": " 3", "description": "Application of theory and research to special education program design and implementation.", "restrictions": "Open to undergraduate students in the Special Education-Learning Disabilities major."}, "CEP452": {"name": " Assistive Technology for Students with Learning Disabilities", "semester": "Fall of every year", "credits": " 3", "description": "Assistive Technology (AT) for advancing educational outcomes for K-12 students with learning disabilities; applications of technology to compensate for disabilities and improve educational, social, and behavioral competences.", "prerequisite": "CEP 240", "restrictions": "Open to students in the Special Education-Learning Disabilities Major."}, "CEP460": {"name": " Communication Skill Training for the Helping Professional", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Interpersonal communication focusing on dynamics of listening process, interpersonal style, and barriers to communication. Emphasis on the mastery of microskills.", "restrictions": "Not open to freshmen or sophomores."}, "CEP470": {"name": " Disability in a Diverse Society", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": " 3", "description": "Needs and life experiences of persons with various physical and mental disabilities, types of services designed to meet these needs, multicultural issues relevant to disabilities, and career opportunities available in the field.", "restrictions": "Open to juniors or seniors or graduate students."}, "CEP490": {"name": " Independent Study in Counseling, Educational Psychology, and Special Education", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 6", "description": "Supervised individual or small group study of the practice of counseling, educational psychology, or special education."}, "CEP491": {"name": " Special Topics in Educational Psychology", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 3", "description": "Current issues in educational psychology and child and adolescent development in educational settings.", "restrictions": "Not open to freshmen or sophomores."}, "CEP502A": {"name": " Internship in Teaching Diverse Learners II: Learning Disabilities", "semester": "Spring of every year", "credits": " 6", "description": "Internship in heterogeneous classrooms. Increased emphasis on independent teaching. Teaching students with learning disabilities in classroom communities that ensure equitable access to important knowledge and skills. Assessing academic and social outcomes.", "restrictions": "Open only to students in the Special Education-Learning Disabilities major or to master's students in the Special Education major.", "exclude": "or CEP 502C or CEP 893F"}, "CEP800": {"name": " Psychology of Learning in School and Other Settings", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": " 3", "description": "Learning as active, socially-mediated construction of knowledge in school, home, community, and work settings. What is learned, how it is taught and learned, and what learners bring to the setting."}, "CEP801": {"name": " Psychological Development: Learner Differences and Commonalities", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": " 3", "description": "Development of differences and commonalities in learners across the lifespan. Contextual influences on development. Implications for learning in schools and other settings."}, "CEP801A": {"name": " Collaboration and Consultation in Special Education", "semester": "Spring of every year", "credits": " 3", "description": "Professional and ethical responsibilities. Models and methods of collaboration with teachers, parents, and community agencies to foster learning for students with disabilities. Advocacy for students with disabilities in school and community settings.", "restrictions": "Open to students in the Special Education-Learning Disabilities major and open to graduate students in the Special Education major and open to graduate students in the Education major."}, "CEP802": {"name": " Developing Positive Attitudes toward Learning", "semester": "Fall of every year", "credits": " 3", "description": "Behavioral, individual-difference, and cognitive perspectives on student motivation to learn."}, "CEP802A": {"name": " Reflection and Inquiry in Teaching Special Education I: Mild Impairment", "semester": "Fall of every year", "credits": " 3", "description": "Qualitative and quantitative research methods on teaching and learning of students with emotional or learning impairments. Framing educational problems in special education. Designing and assessing studies of mathematics and problem-solving.", "restrictions": "Open to master's students or educational specialists or doctoral students in the School Psychology major or in the Special Education major."}, "CEP803A": {"name": " Assessment of Students with Mild Disabilities", "semester": "Fall of every year", "credits": " 3", "description": "Informal and formal assessment methods for planning and evaluating instruction and for classifying and placing students with mild disabilities. Engaging with families to improve responsiveness to the assessment.", "restrictions": "Open to students in the Special Education-Learning Disabilities major and open to graduate students in the Special Education major and open to students in the Educational Specialist in School Psychology major."}, "CEP804A": {"name": " Literacy Instruction for Students with Mild Disabilities", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Methods for teaching literacy to students with mild disabilities. Collecting, analyzing, and interpreting data related to the teaching and programming of literacy instruction.", "restrictions": "Open to students in the Special Education-Learning Disabilities major and open to master's students in the Special Education major and open to graduate students in the Education major."}, "CEP804B": {"name": " Advanced Diagnosis and Remediation for Students with Literacy Disabilities", "semester": "Fall of every year", "credits": " 3", "description": "Diagnosis and remediation of reading disabilities, differentiated instruction; literacy assessment and intervention practices for struggling K-12 readers and writers", "restrictions": "Open to master's students in the Special Education Major."}, "CEP805": {"name": " Learning Mathematics with Technology", "semester": "Spring of every year", "credits": " 3", "description": "Current technologies for teaching and learning mathematics with understanding. Technology for multiple representations of mathematical ideas, modeling, and authentic learning environments. Psychological and mathematical perspectives on learning mathematics."}, "CEP806": {"name": " Learning Science with Technology", "semester": "Fall of every year", "credits": " 3", "description": "Possibilities, ideas, and issues associated with teaching science with technology. How K-12 teachers use Internet resources (e.g. simulations, databases, communities) to facilitate science learning. Contemporary conceptual perspectives from educational psychology on important issues of learning."}, "CEP807": {"name": " Capstone in Educational Technology", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": " 3", "description": "Culmination of the Master of Arts in Educational Technology degree experience. Assessment and synthesis of educational technology knowledge and skill development.", "restrictions": "Open to master's students in the Educational Technology major or approval of department."}, "CEP809": {"name": " Data-Driven Instruction within Multi-Tiered Systems of Support", "semester": "Fall of every year", "credits": " 3", "description": "Applying the multi-tiered systems of support framework directly to school settings. Integrating knowledge of instruction from other courses to make data-based decisions for students.", "restrictions": "Open to graduate students in the College of Education or approval of department."}, "CEP810": {"name": " Teaching for Understanding with Technology", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": " 3", "description": "Application and integration of productivity tools and web-based resources in educational settings to improve teaching and learning."}, "CEP811": {"name": " Adapting Innovative Technologies to Education", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": " 3", "description": "Application of instructional principles and methods to educational problems in the K-12 classroom. Development of technological applications which are interactive, multisensory, and innovative."}, "CEP812": {"name": " Applying Educational Technology to Issues of Practice", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": " 3", "description": "Applications of technology in K-12 settings. Identification, implementation, and evaluation of technology-based solutions to educational issues in school settings."}, "CEP813": {"name": " Electronic Assessment for Teaching and Learning", "semester": "Fall of every year", "credits": " 3", "description": "Foundational theories of assessment. Critical examination of methods (e.g., portfolios, rubrics, surveys, tests, self-evaluations), and digital tools that allow educators to gather information, analyze it, and make informed pedagogical choices. Design of assessments for learning, as learning and of learning, especially in digital contexts."}, "CEP814": {"name": " Computational Thinking for K12 Educators", "semester": "Fall of every year", "credits": " 3", "description": "Teaching computational thinking to K12 students."}, "CEP815": {"name": " Technology and Leadership", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": " 3", "description": "Professional development strategies. Project management, planning and evaluation. Relationship building. Ethical and social implications of technology integration."}, "CEP816": {"name": " Technology, Teaching and Learning Across the Curriculum", "semester": "Fall of every year", "credits": " 3", "description": "Uses of technologies in teaching subject matter. Disciplinary perspectives on teaching and learning with technology."}, "CEP817": {"name": " Learning Technology through Design", "semester": "Spring of every year, Summer of every year", "credits": " 3", "description": "Design of educational tools and software. Designing for learners. Human computer interaction. Art and aesthetics of design. Iterative design. Collaboration in design."}, "CEP818": {"name": " Creativity in Teaching and Learning", "semester": "Fall of every year, Summer of every year", "credits": " 3", "description": "Value and relevance of creativity in education. Recognizing, analyzing, and supporting creativity in multiple contexts. Psychological, motivational, and organizational aspects of creativity."}, "CEP820": {"name": " Teaching Students Online", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": " 3", "description": "Strategies for constructing and implementing online curricula aimed at students across the lifespan."}, "CEP822": {"name": " Approaches to Educational Research", "semester": "Fall of every year, Summer of every year", "credits": " 3", "description": "Alternative methods of educational research. Identifying researchable problems in education and developing a research proposal. Applications of descriptive and inferential statistics for analyzing and critiquing published studies."}, "CEP824": {"name": " Programming Concepts for K12 Educators", "semester": "Fall of every year", "credits": " 3", "description": "Fundamental concepts of programming, computing, and computing systems for K12 educators. Instruction of computer science in K12 settings and subject areas."}, "CEP832": {"name": " Educating Students with Challenging Behavior", "semester": "Spring of every year", "credits": " 3", "description": "Evidence-based classroom interventions for students with disruptive and other behavior problems within general education. Effective teaching approaches for students with challenging behavior.", "restrictions": "Open only to graduate students in the College of Education."}, "CEP833": {"name": " Creativity in K12 Computing Education", "semester": "Spring of every year", "credits": " 3", "description": "Intersections between creativity and computing in cross-disciplinary K12 contexts and subject areas."}, "CEP840": {"name": " Policies, Practices, and Perspectives in Special Education", "semester": "Summer of every year", "credits": " 3", "description": "Characteristics of students with disabilities and special needs. Implications for legal and professional responsibilities of teachers. Impact of federal and state policies on special education practices. Multicultural issues in special education.", "restrictions": "Open to graduate students in the Special Education major and open to graduate students in the Education major."}, "CEP841": {"name": " Classroom and Behavior Management in the Inclusive Classroom", "semester": "Summer of every year", "credits": " 3", "description": "Identification of behavioral, social and academic characteristics of children with special needs. Principles and techniques for classroom and behavioral management in the inclusive classroom"}, "CEP842": {"name": " Content-Area Instruction for Students with Mild Disabilities", "semester": "Spring of every year", "credits": " 3", "description": "Principles for teaching mathematics, science, and social studies in inclusive classrooms that support learning for all students. Instructional practices for providing differentiated instruction and making adaptations and accommodations in these content areas.", "prerequisite": "CEP 840", "restrictions": "Open to graduate students in the Special Education major and open to master's students in the Education major."}, "CEP843": {"name": " Autism Spectrum Disorders: Characteristics and Educational Implications", "semester": "Fall of every year", "credits": " 3", "description": "Characteristics of Autism Spectrum Disorders (ASD). History; etiology; past and present theories of autism spectrum disorders. Prevalence, comorbid conditions, research on ASD. Impact of ASD on learning, family systems, and communities.", "restrictions": "Open to graduate students in the Special Education major and open to master's students in the Education major."}, "CEP844": {"name": " Applied Behavior Analysis for Teachers", "semester": "Fall of every year", "credits": " 3", "description": "Concepts, principles, techniques, strategies, interventions, applications and research within the field of Applied Behavior Analysis (ABA). History of ABA. Data collection, measurement, design, analysis. Functional analysis. Ethical guidelines.", "restrictions": "Open to graduate students in the Department of Counseling, Educational Psychology, and Special Education and open to lifelong graduate students in the College of Education."}, "CEP845": {"name": " Autism Spectrum Disorders: Assessment and Intervention", "semester": "Spring of every year", "credits": "Variable from 3 to 4", "description": "Eligibility assessment, ongoing academic and behavioral assessment and corresponding established treatment interventions for students with Autism Spectrum Disorders.", "prerequisite": "CEP 844", "restrictions": "Open to graduate students in the Department of Counseling, Educational Psychology, and Special Education and open to lifelong graduate students in the College of Education."}, "CEP846": {"name": " Autism Spectrum Disorders: Advanced Topics", "semester": "Spring of every year", "credits": " 3", "description": "Theories, technologies, practices and research related to the education of students with Autism Spectrum Disorders. Academic, behavioral, social, and communicative programming for students with Autism Spectrum Disorders. Assistive and augmentative communication. Program evaluation. Creating service systems using ancillary, community, and family personnel.", "prerequisite": "CEP 844", "restrictions": "Open to graduate students in the Special Education major."}, "CEP848": {"name": " Supervision in Applied Behavior Analysis", "semester": "Summer of every year", "credits": " 3", "description": "Effective supervision strategies in behavior analytic practice.", "restrictions": "Open to students in the Applied Behavior Analysis Major or in the Applied Behavior Analysis in Special Education Graduate Certificate."}, "CEP850": {"name": " Technology and Literacy for Students with Mild Disabilities", "semester": "Summer of every year", "credits": " 3", "description": "Use of technology to improve literacy learning and performance for students with mild disabilities.", "prerequisite": "CEP 840", "restrictions": "Open to graduate students in the Special Education major and open to master's students in the Education major."}, "CEP851": {"name": " Concepts and Principles in Applied Behavior Analysis", "semester": "Fall of every year", "credits": " 3", "description": "Fundamental elements, concepts and principles in applied behavior analysis.", "restrictions": "Open to master's students in the Department of Counseling, Educational Psychology, and Special Education."}, "CEP852": {"name": " Experimental Analysis of Behavior", "semester": "Fall of every year", "credits": " 3", "description": "Basic behavioral processes and human and nonhuman learning with a focus on the experimental analysis of behavior.", "restrictions": "Open to master's students in the Department of Counseling, Educational Psychology, and Special Education."}, "CEP853": {"name": " Functional Behavior Assessment and Behavior Change", "semester": "Fall of every year", "credits": " 3", "description": "Foundational knowledge and applied skills to administer behavioral assessments and interventions.", "prerequisite": "(CEP 845) and (CEP 851 or CEP 942)", "restrictions": "Open to master's students in the Department of Counseling, Educational Psychology, and Special Education and open to graduate students in the Applied Behavior Analysis in Special Education Major."}, "CEP854": {"name": " Ethics in Behavior Analysis", "semester": "Spring of every year", "credits": " 3", "description": "Advanced topics in applied behavior analysis with an emphasis on the Professional and Ethical Compliance Code for Behavior Analysts outlined by the Behavior Analyst Certification Board.", "prerequisite": "CEP 844 and CEP 845", "restrictions": "Open to graduate students in the Department of Counseling, Educational Psychology, and Special Education and open to lifelong graduate students in the College of Education."}, "CEP855": {"name": " Verbal Behavior in Education", "semester": "Fall of every year", "credits": " 3", "description": "Applications of verbal behavior to language and literacy instruction for students with disabilities.", "prerequisite": "CEP 844 and CEP 845 and CEP 854", "restrictions": "Open to graduate students in the Department of Counseling, Educational Psychology, and Special Education."}, "CEP861": {"name": " Counseling Theory, Philosophy, and Ethics", "semester": "Fall of every year", "credits": " 3", "description": "Selected counseling theories. Foundations of ethical decision-making. Professional standards, guidelines, and issues concerning the training and work of the counselor and school psychologist. Legal issues and precedents.", "restrictions": "Open only to graduate students in the Counseling major or Rehabilitation Counseling major or School Psychology major."}, "CEP862": {"name": " Introduction to Individual and Group Counseling", "semester": "Spring of every year", "credits": " 3", "description": "Forming, working with, and ending groups. Building relationships. Handling obstacles. Developing and carrying out agendas in counseling. Simulated individual and group practice.", "restrictions": "Open to graduate students in the College of Education and open to graduate students in the School of Social Work and open to graduate students in the Department of Human Development and Family Studies."}, "CEP864": {"name": " Career Counseling", "semester": "Summer of every year", "credits": " 3", "description": "Career development theories and labor market and occupational information. Assessing and planning aspects of career counseling with various populations.", "restrictions": "Open to graduate students in the College of Education."}, "CEP866": {"name": " Psychoeducational Interventions for Children and Youth", "semester": "Summer of every year", "credits": " 3", "description": "Theoretical and empirical bases for designing, implementing and evaluating intervention programs. Child and youth development. Understanding risk and resiliency. At-risk youth."}, "CEP868": {"name": " Medical Aspects of Disability", "semester": "Spring of every year", "credits": " 3", "description": "Types of physical disabilities and their implications for vocational rehabilitation. Theories of adjustments to and adaptation to physical disabilities."}, "CEP870": {"name": " Foundations of Rehabilitation Counseling", "semester": "Fall of every year", "credits": " 3", "description": "History, philosophy, values, legislation, policy and practice of the field of rehabilitative counseling.", "restrictions": "Open only to master's students in the Rehabilitation Counseling major."}, "CEP871": {"name": " Cognitive and Psychological Aspects of Disability", "semester": "Spring of every year", "credits": " 3", "description": "Types of cognitive and emotional disabilities and their implications for vocational rehabilitation. Psychosocial adjustments to chronic disease and disability."}, "CEP872": {"name": " Social and Environmental Aspects of Rehabilitation", "semester": "Spring of every year", "credits": " 3", "description": "Social and political factors that handicap individuals with disabilities. The Independent Living movement, philosophy, legislation and services. Accommodations and enabling technology. Attitude modification and client empowerment."}, "CEP873": {"name": " Employment Strategies for Individuals with Disabilities", "semester": "Fall of every year", "credits": " 3", "description": "Public policy, resources, and intervention strategies for assisting persons with disabilities to adapt to the work-place and to achieve vocational outcomes. Assisting employers in accommodating and retaining employees with disabilities."}, "CEP876": {"name": " Professional Issues in Rehabilitation Counseling", "semester": "Spring of every year", "credits": " 3", "description": "Applications of case management strategies, processes and practices in rehabilitation counseling.", "restrictions": "Open only to master's students in Rehabilitation Counseling."}, "CEP877": {"name": " Assessment in Rehabilitation", "semester": "Fall of every year", "credits": " 3", "description": "Advanced assessment techniques and strategies for rehabilitation settings.", "restrictions": "Open to master's students."}, "CEP879": {"name": " Teaching College Mathematics", "semester": "Fall of even years", "credits": " 3", "description": "Curriculum materials, case studies, approaches to teaching and student learning of particular mathematics topics.", "alias": "SME 879"}, "CEP880": {"name": " Cognitive Assessment", "semester": "Fall of every year", "credits": " 3", "description": "Measurement of intelligence. Observation, practice, supervision, interpretation, and report writing in an educational setting.", "restrictions": "Open only to Ed.S. or Ph.D. students in the School Psychology or Counseling Psychology major."}, "CEP881": {"name": " Social and Emotional Assessment and Intervention", "semester": "Spring of every year", "credits": " 3", "description": "Social and emotional assessment and intervention with children and adolescents in school.", "restrictions": "Open to educational specialists or doctoral students in the School Psychology major."}, "CEP882": {"name": " Seminar in Counseling, Educational Psychology and Special Education", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 3", "description": "Seminar in the various fields of emphasis in Counseling, Educational Psychology and Special Education."}, "CEP883": {"name": " Psychology of Classroom Discipline", "semester": "Summer of every year", "credits": " 3", "description": "Theories of and strategies for the resolution of classroom discipline problems."}, "CEP884": {"name": " Roles and Functions of School Psychologists", "semester": "Fall of every year", "credits": " 3", "description": "Multiple roles of school psychologists from a systems perspective. Historical, legal, ethical, and cultural issues.", "restrictions": "Open to educational specialists or doctoral students in the School Psychology major."}, "CEP885": {"name": " Behavior Disorders in Children", "semester": "Fall of every year, Summer of every year", "credits": " 3", "description": "Characteristics, causes, and treatment of school-related behavior disorders in children within a developmental framework.", "exclude": "PSY 853 or PSY 854"}, "CEP886": {"name": " Psychological Assessment and Intervention I", "semester": "Spring of every year", "credits": " 3", "description": "Psychological and educational assessments and interventions for learning, behavioral, and developmental problems of children and adolescents. Problem-solving assessment model. Informal and formal assessment methods and related educational measurement concepts.", "restrictions": "Open to educational specialists or doctoral students in the School Psychology major."}, "CEP888": {"name": " Theories of Child Psychotherapy", "semester": "Spring of every year", "credits": " 3", "description": "Models of psychotherapy for children and adolescents. Empirically-supported, brief models appropriate for school and community-based practice. Critical appraisal of models, methods, and selected techniques.", "prerequisite": "CEP 885", "restrictions": "Open only to Ed.S. or Ph.D. students in the School Psychology major."}, "CEP889": {"name": " Consultation in School Psychology", "semester": "Spring of every year", "credits": " 3", "description": "School-based consultation, theoretical models and consultation skills. Communication and interpersonal skills, conflict management, and joint problem-solving. Ethical issues. Research on consultation.", "prerequisite": "CEP 880 and (CEP 881 or concurrently) and CEP 884 and CEP 886", "restrictions": "Open to educational specialist or doctoral students in the School Psychology Major."}, "CEP890": {"name": " Independent Study", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 6", "description": "Individual or group study guided by a faculty member."}, "CEP891": {"name": " Special Topics in Educational Psychology and Educational Technology", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 3", "description": "Special topics in various areas of study in counseling, educational psychology and special education."}, "CEP893A": {"name": " Rehabilitation Counseling Internship", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 3 to 9", "description": "Supervised internship experience in community rehabilitation settings.", "restrictions": "Open only to master's students in the Rehabilitation Counseling major."}, "CEP893F": {"name": " Special Education Internship: Teaching Children with Learning Disabilities", "semester": "Fall of every year", "credits": "Variable from 3 to 6", "description": "Supervised student teaching in elementary and secondary education programs for learning disabled students.", "restrictions": "Open to graduate students in the Special Education major."}, "CEP893J": {"name": " Special Education Internship: Teaching Children with Autism Spectrum Disorders", "semester": "Fall of every year, Summer of every year", "credits": "Variable from 3 to 6", "description": "Supervised internship at the elementary or secondary levels, working with students who are identified as having Autism Spectrum Disorder.", "restrictions": "Open to graduate students in the Special Education major."}, "CEP893K": {"name": " Practicum in School Psychology", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": " 3", "description": "Clinical experiences in a school setting as well as primary prevention, team decision making, and special education determination.", "restrictions": "Open to educational specialists or doctoral students in the School Psychology major."}, "CEP894A": {"name": " Rehabilitation Counseling Practicum", "semester": "Fall of every year, Summer of every year", "credits": " 6", "description": "Supervised practicum in a rehabilitation or human services setting.", "restrictions": "Open only to master's students in the Rehabilitation Counseling major."}, "CEP894D": {"name": " Practicum in Educational Psychology", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 3", "description": "Practicum in educational, business, or consulting settings. Possible projects include designing, developing, implementing, or evaluating instructional programs; conducting research; or working with practitioners to incorporate innovative instructional technologies.", "restrictions": "Open only to graduate students in the Learning, Technology and Culture major."}, "CEP894F": {"name": " Practicum in Applied Behavior Analysis", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 10", "description": "Supervised practicum in the use of behavior analytic practices, techniques, and strategies with children and/or adults with autism and other disabilities in school, home, or clinic-based settings.", "restrictions": "Approval of department."}, "CEP894G": {"name": " Special Education Practicum: Children and Youth with Learning Disabilities", "semester": "Fall of every year, Spring of every year", "credits": "Variable from 1 to 10", "description": "Supervised field experience with students who have learning disabilities. Planning, implementing, and critiquing instruction in elementary and secondary school settings.", "restrictions": "Open only to graduate students in the Special Education major."}, "CEP894J": {"name": " Special Education Practicum: Children and Youth with Autism Spectrum Disorders", "semester": "Fall of every year, Summer of every year", "credits": "Variable from 3 to 6", "description": "Supervised practicum, at the elementary or secondary levels, working with students who are identified as having Autism Spectrum Disorder.", "restrictions": "Open to graduate students in the Special Education major."}, "CEP894K": {"name": " Internship in School Psychology", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 3", "description": "Supervised experience in school psychology. Assessment, consultation, and intervention.", "restrictions": "Open to graduate students in the School Psychology Major.", "alias": "CEP 893B"}, "CEP895": {"name": " Research Ethics", "semester": "Summer of every year", "credits": " 1", "description": "Identifying and resolving ethical problems in research. Collegial interactions. Authorship, publication, and reviewing practices. Data management. Ownership of data and intellectual property. Conflicts of interest. Protection of human and animal subjects. Lab safety and compliance.", "restrictions": "Open to graduate students.", "alias": "PES 895"}, "CEP899": {"name": " Master's Thesis Research", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 9", "description": "Master's thesis research.", "restrictions": "Open only to master's students in the Department of Counseling, Educational Psychology and Special Education."}, "CEP900": {"name": " Proseminar in Educational Psychology and Educational Technology I", "semester": "Fall of every year", "credits": " 3", "description": "Historical, theoretical, empirical, methodological, and philosophical issues. Research literature on learning, teaching subject matter, and social-cultural contexts.", "restrictions": "Open to doctoral students in the Department of Counseling, Educational Psychology, and Special Education."}, "CEP901": {"name": " Proseminar in Educational Psychology and Educational Technology II", "semester": "Spring of every year", "credits": " 3", "description": "Further work on historical theoretical, empirical, methodological, and philosophical issues. Scholarship and research skills.", "prerequisite": "CEP 900", "restrictions": "Open to doctoral students in the Educational Psychology and Educational Technology Major."}, "CEP902": {"name": " The Psychology of Learning School Subjects", "semester": "Spring of every year", "credits": " 3", "description": "Psychological theories and research regarding learning and teaching of school subjects, including mathematics, science, and reading. Psychological learning contexts in and out of school. Transfer and representation of knowledge.", "restrictions": "Open to doctoral students."}, "CEP903": {"name": " Cognitive Development Across the Lifespan", "semester": "Fall of every year", "credits": " 3", "description": "Cognitive aspects of human development. Relationship between cognitive development and learning in school and other contexts.", "restrictions": "Open to doctoral students."}, "CEP904": {"name": " Social-Emotional Development across the Lifespan", "semester": "Spring of every year", "credits": " 3", "description": "Social and emotional aspects of human development. Relationship between social-emotional development and learning in school and other settings.", "restrictions": "Open to doctoral students."}, "CEP905": {"name": " Cultural Perspectives on Learning and Development", "semester": "Spring of even years", "credits": " 3", "description": "Theories and research in cultural psychology. Relations among culture, learning, and human development in school and other settings such as family, community, and work. Implications for educational practice."}, "CEP907": {"name": " Psychological Study of Teaching", "semester": "Spring of odd years", "credits": " 3", "description": "Research literature on psychological aspects of teachers and teaching. Topics include teacher's decision-making, learning from experience, and developmental changes.", "restrictions": "Open to doctoral students."}, "CEP909": {"name": " Cognition and Technology", "semester": "Fall of every year", "credits": " 3", "description": "Interaction of computer technologies and cognitive theories. Learning with new technologies; how technology influences theories of mind. How theories of cognition may guide the development of new technologies.", "restrictions": "Open to doctoral students."}, "CEP910": {"name": " Motivation and Learning", "semester": "Spring of every year", "credits": " 3", "description": "Enduring questions about motivation and learning. Role of skill versus will in motivation. Higher-order thinking in learning.", "restrictions": "Open to doctoral students in the College of Education."}, "CEP911": {"name": " Intellectual History of Educational Psychology", "semester": "Fall of every year", "credits": " 3", "description": "Ideas and perspectives on learning and development that have shaped educational psychology. Learning of school subject matters. Learning and development in relation to educational settings.", "restrictions": "Open to doctoral students."}, "CEP912": {"name": " Reading Comprehension: Research and Theory", "semester": "Fall of odd years", "credits": " 3", "description": "Theory and research on the development, teaching, and learning of reading comprehension birth through adulthood.", "restrictions": "Open to doctoral students."}, "CEP913": {"name": " Psychology and Pedagogy of Mathematics", "semester": "Fall of odd years", "credits": " 3", "description": "Psychological theory and research on the learning of mathematics. Development of mathematical thinking and knowledge in school and other settings.", "restrictions": "Open to doctoral students."}, "CEP915": {"name": " Literacy in Sociocultural Context", "semester": "Fall of even years", "credits": " 3", "description": "The learning and development of literacy and the role of literacy in mediating cognition, affect, and action in educational contexts. Relationship between literacy and sociocultural contexts.", "restrictions": "Open to doctoral students."}, "CEP916": {"name": " Intellectual History of Educational Technology", "semester": "Spring of every year", "credits": " 3", "description": "History of technology and learning in formal and informal settings. Historical, theoretical, empirical, methodological, and philosophical issues in the study of technology in education. Teachers’ use of educational technology.", "restrictions": "Open to doctoral students in the College of Education."}, "CEP918": {"name": " Theories of School-Based Psychological Interventions", "semester": "Spring of every year", "credits": " 3", "description": "Theories and models of school-based interventions. Theories of organization and purposes of schooling in society. Theories of prevention of psychopathology and promotion of children's competence in school settings.", "prerequisite": "CEP 884", "restrictions": "Open only to Ed.S. or Ph.D. students in the School Psychology major."}, "CEP919": {"name": " Cultural Factors and Evidence-Based Practice in Children’s Mental Health", "semester": "Fall of every year", "credits": " 3", "description": "A multicultural approach to psychology, the cultural competence to serve diverse populations, a critical perspective on the cultural validity of mental health interventions, and awareness of equity and justice in practice and research.", "restrictions": "Open to educational specialist or doctoral students in the School Psychology Major."}, "CEP920": {"name": " Basic Concepts in Educational and Social Science Measurement", "semester": "Fall of every year", "credits": " 3", "description": "Development and evaluation of standardized techniques for measuring psychoeducational constructs. Instrument development, validity, reliability, norming, and scaling using both raw score and latent trait measurement models.", "prerequisite": "CEP 932"}, "CEP921": {"name": " Psychometric Theory I", "semester": "Spring of every year", "credits": " 3", "description": "Theory-oriented introduction to psychometrics and the measurement of educational and psychological traits. Measurement, scaling, validity, true score test theory, measurement error, reliability, generalizability theory, item response theory, measurement bias, and factor analysis.", "prerequisite": "CEP 920 and CEP 933"}, "CEP922": {"name": " Psychometric Theory II", "semester": "Fall of odd years", "credits": " 3", "description": "Expansion of generalizability theory, test and item bias, and equating. Measurement of change, profile analysis, scaling approaches, and validity generalization.", "restrictions": "Open only to Ph.D. students."}, "CEP923": {"name": " Item Response Theory", "semester": "Fall of even years", "credits": " 3", "description": "Item response theory applied to test construction, scaling, and equating tests and their items."}, "CEP925": {"name": " Applied Research in Special Education", "semester": "Spring of odd years", "credits": " 3", "description": "Research design and statistical methods for special education research in laboratory and field settings.", "prerequisite": "CEP 900 and CEP 930 and CEP 932", "restrictions": "Open to doctoral students in the Special Education Major."}, "CEP926": {"name": " Proseminar in Mathematics Education I", "semester": "Fall of odd years", "credits": " 3", "description": "Research on the learning and teaching of mathematics. Focus on curriculum, discourse, equity and teacher education.", "alias": "SME 926"}, "CEP927": {"name": " Proseminar in Mathematics Education II", "semester": "Fall of even years", "credits": " 3", "description": "Research on the learning and teaching of mathematics. Focus on teaching, student learning, assessment and policy.", "alias": "SME 927"}, "CEP930": {"name": " Educational Inquiry", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Multiple sources of inquiry. Critical assessment of common assumptions about research. Relationship between data and theory. Objectivity, validity, and causal inference across research traditions. Research ethics. Relationship among researcher, researched, and audience. Question formation."}, "CEP931": {"name": " Introduction to Qualitative Methods in Educational Research", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": " 3", "description": "Concepts and assumptions underlying multiple traditions of qualitative research methods in education. Relationship between research questions and qualitative research design. Epistemology, methods, and ethical issues of ethnography, case study research, grounded theory, oral history and discourse analysis. Criteria for appraising and critiquing qualitative research designs, claims, and evidence,"}, "CEP932": {"name": " Quantitative Methods in Educational Research I", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Techniques in data collection and data analysis used in educational and psychological research. Graphical and tabular representation of data. Concepts of statistical inference in educational contexts.", "restrictions": "Open to graduate students in the College of Education and open to doctoral students in the Mathematics Education major or approval of department."}, "CEP933": {"name": " Quantitative Methods in Educational Research II", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Advanced techniques of data analysis and statistical inference used in educational and psychological research. Multiple regression, analysis of variance, and basic principles of experimental design in educational applications.", "prerequisite": "CEP 932", "restrictions": "Open to graduate students in the College of Education and open to doctoral students in the Mathematics Education major or approval of department."}, "CEP934": {"name": " Multivariate Data Analysis I", "semester": "Fall of every year", "credits": " 4", "description": "Multivariate methods, matrix algebra, and the general linear model as applied to educational research settings.", "restrictions": "Open to graduate students."}, "CEP935": {"name": " Advanced Topics in Multivariate Data Analysis II", "semester": "Spring of odd years", "credits": " 4", "description": "Application of discrete and continuous multivariate methods in educational research.", "restrictions": "Open to graduate students."}, "CEP937": {"name": " Survey Research Methods in Education", "semester": "Spring of odd years", "credits": " 3", "description": "Principles and techniques of survey research methodology. Alternative sampling designs. Development of scales and questionnaires. Data analysis procedures. Emphasis on applications in education.", "restrictions": "Open to graduate students."}, "CEP938": {"name": " Latent Variable and Structural Equation Modeling", "semester": "Spring of odd years", "credits": " 3", "description": "Principles and applications of latent variable and structural equation modeling. Testing substantive theories in the social, behavioral, educational, and biomedical sciences. Statistical modeling methodology for examining causality relationships between aspects of studied phenomena. Contributions to construct validation and theory development.", "prerequisite": "CEP 933", "restrictions": "Open to graduate students."}, "CEP939": {"name": " Seminar in Educational Measurement", "semester": "Spring of odd years", "credits": " 3", "description": "Current issues in educational measurement. Ethics and standards in testing, educational testing policy, school effectiveness indices, and parameters of teacher testing.", "prerequisite": "CEP 920", "restrictions": "Open to graduate students."}, "CEP941": {"name": " Academic Issues in Special Education for At-Risk Students", "semester": "Fall of even years", "credits": " 3", "description": "Academic assessment and instructional research in special education. Inquiry in special education related to the design and evaluation of academic programs for learning disabled, mentally retarded, emotionally impaired, and other low achieving students.", "restrictions": "Open to doctoral students in the Special Education Major."}, "CEP942": {"name": " Single-case Experimental Designs for Intervention Research", "semester": "Spring of every year", "credits": " 3", "description": "Research methodology course focused on experimental analysis of educational practices and interventions for individual students, classrooms, or schools.", "prerequisite": "(CEP 844 and CEP 845 and CEP 854) or (CEP 900 and CEP 930)", "restrictions": "Open to graduate students in the College of Education and open to lifelong graduate students in the College of Education."}, "CEP943": {"name": " Multicultural Issues in Special Education", "semester": "Fall of odd years", "credits": " 3", "description": "Relationships among race, gender, culture, social class, and disability. Individual, group and societal responses to disability. Anthropological, social and psychological theories about origins of cultural diversity.", "restrictions": "Open only to doctoral students in the Special Education major."}, "CEP944A": {"name": " Rehabilitation Counselor Pedagogy", "semester": "Fall of odd years", "credits": " 3", "description": "Pedagogical tools and issues associated with teaching and learning in pre-service rehabilitation counseling preparation programs."}, "CEP944B": {"name": " Teaching Internship in Rehabilitation Counselor Education", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": " 3", "description": "Course design and teaching experience under the direct supervision of a faculty member.", "restrictions": "Open to doctoral students in the Rehabilitation Counselor Education Major."}, "CEP944C": {"name": " Clinical Practice Practicum in Rehabilitation Counseling", "semester": "Summer of every year", "credits": " 6", "description": "Supervised counseling experience in human services, rehabilitation or educational settings to further develop skills, knowledge, and behaviors appropriate for professional counseling practice.", "restrictions": "Open to doctoral students in the Rehabilitation Counselor Education Major."}, "CEP944D": {"name": " Clinical Supervision Internship in Rehabilitation Counselor Education", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": " 3", "description": "Theory and practice of supervising prospective counselors. Approaches, models, and strategies.", "restrictions": "Open to doctoral students in the Rehabilitation Counselor Education Major."}, "CEP946A": {"name": " Regression Analysis for Education Policy", "semester": "Spring of every year", "credits": " 3", "description": "Foundations of regression analysis. Underlying assumptions. Applications to education policy with attention to challenges of establishing causal relations. STATA software skills for independent scholarly investigations.", "prerequisite": "CEP 932", "restrictions": "Open to graduate students."}, "CEP949": {"name": " Critical Issues in Special Education", "semester": "Spring of odd years", "credits": " 3", "description": "Topics in special education, including cognition and sensory impairments, literacy for at-risk students, program design, small sample research, and staff development.", "restrictions": "Open to doctoral students in the Special Education major."}, "CEP952": {"name": " Technology for Teaching and Learning in Higher Education", "semester": "Spring of every year", "credits": " 3", "description": "Technology for support of teaching and learning in higher educational settings. Theories, research, and design of online learning. Electronic portfolios. Libraries in the age of the Internet.", "restrictions": "Open to doctoral students."}, "CEP953": {"name": " Teachers and Technology", "semester": "Spring of even years", "credits": " 3", "description": "Impact of new technologies on teacher knowledge and practices of teaching. Teachers' use of technology, teacher knowledge, teacher education, and changing roles of teachers.", "restrictions": "Open to doctoral students."}, "CEP954": {"name": " Design and Methods in Mathematics Education Research", "semester": "Fall of every year", "credits": " 3", "description": "History, current trends, and issues pertaining to research design and methods in mathematics education research. Mathematics education research in the areas of policy, teaching, teacher learning, and student learning with particular attention to how research design influence research findings.", "alias": "SME 954"}, "CEP955": {"name": " Research Design and Methods for Educational Psychology and Educational Technology", "semester": "Fall of every year", "credits": " 3", "description": "Research design and methods for studying learning, development, technology, and culture in educational contexts", "prerequisite": "CEP 930 and CEP 932", "restrictions": "Open to doctoral students."}, "CEP956": {"name": " Mind, Media, and Learning", "semester": "Fall of even years", "credits": " 3", "description": "Philosophy, psychology, and sociology of new media. Media effects and learning with media. Issues of gender, identity, culture in technologically mediated environments, including Internet, virtual reality, computer games, simulations, artificial intelligence (AI) systems, and pedagogical agents.", "restrictions": "Open to doctoral students."}, "CEP957": {"name": " Learning in Complex Domains", "semester": "Spring of every year", "credits": " 3", "description": "Problems of learning in complex and ill-structured domains. Real-world knowledge application. Learning difficult subject matter. Situated, collaborative, and case-based approaches to learning in complex domains. Technologies for enabling new kinds of learning.", "restrictions": "Open to doctoral students."}, "CEP958": {"name": " History of Literacy Research and Instruction", "semester": "On Demand", "credits": " 3", "description": "Key historical, political, scholarly, and educational issues influencing literacy curriculum and pedagogy.", "restrictions": "Open to doctoral students."}, "CEP959": {"name": " Acquisition and Development of Language and Literacy", "semester": "On Demand", "credits": " 3", "description": "Language and literacy development with an alternating focus on early and middle childhood and adolescence and adulthood. Major areas of language and literacy development including phonology, orthography, morphology, semantics, syntax, and pragmatics. Connections between oral and written language development. Home and school influences on language and literacy development. Individual differences in language and literacy development.", "restrictions": "Open to doctoral students."}, "CEP960": {"name": " Theoretical Foundations of Counseling", "semester": "Fall of even years", "credits": " 3", "description": "Theoretical models of counseling, personality, behavior change, and career development. Research literature on the process and outcomes of counseling. Selected professional issues.", "restrictions": "Open only to doctoral students in the Rehabilitation Counselor Education major or educational specialists and doctoral students in the School Psychology major."}, "CEP961": {"name": " Advanced Perspectives on Culture, Diversity and Social Justice in Counseling", "semester": "Fall of even years", "credits": " 3", "description": "Culture, gender, disability, and other diversity dynamics as they affect human functioning and counseling practices and multicultural education. Strategies and techniques for multicultural perspectives in counseling and inclusive pedagogy in counselor education.", "restrictions": "Open to educational specialists or doctoral students in the Rehabilitation Counselor Education major or in the School Psychology major."}, "CEP963": {"name": " Ethics in Counseling and School Psychology", "semester": "Spring of every year", "credits": " 3", "description": "Traditional and contemporary issues in theory, research, practice, and training with a focus on ethics including ethical theory, principles, standards, codes of conduct, and legal issues.", "restrictions": "Open only to Ph.D. students in the Rehabilitation Counselor Education or Ed.S. and Ph. D. students in School Psychology."}, "CEP964": {"name": " Practice and Profession of Rehabilitation Counseling", "semester": "Spring of even years", "credits": " 3", "description": "Foundations and practice of rehabilitation. Pre-service preparation issues. Professional and policy implications.", "restrictions": "Open only to Ph.D. students in the Rehabilitation Counselor Education major."}, "CEP965": {"name": " Psychosocial Bases of Rehabilitation and Disability", "semester": "Fall of even years", "credits": " 3", "description": "Practice and research issues in rehabilitation counseling.", "restrictions": "Open to doctoral students in the Rehabilitation Counselor Education major."}, "CEP968": {"name": " Research Methods in Counseling and School Psychology", "semester": "Spring of every year", "credits": " 3", "description": "Research topics and designs in counseling psychology, with emphasis on the development of a viable research proposal.", "restrictions": "Open to doctoral students in the Rehabilitation Counselor Education major or in the School Psychology major."}, "CEP969": {"name": " Clinical Supervision in Counseling and School Psychology", "semester": "Spring of every year", "credits": " 3", "description": "Theoretical, empirical, and practical aspects of the supervisory relationship. Process and outcome variables."}, "CEP972": {"name": " Neurobiological Bases of Learning and Behavior", "semester": "Fall of every year", "credits": " 3", "description": "Development of neural systems related to learning and behavior in children who are typically developing and children who have developmental or acquired disorders. Learning neuroanatomy, brain development, and the typical and non-typical outcomes associated with how children experience academic, social and behavioral outcomes. Influence and interplay among neurodevelopmental, genetic, and environmental factors.", "restrictions": "Open to graduate students."}, "CEP973": {"name": " Child Neuropsychological Assessment", "semester": "Spring of every year", "credits": " 3", "description": "Best practice in neuropsychological assessment of children, including interviewing, assessment, hypothesis testing and feedback.", "prerequisite": "CEP 880 and CEP 972", "restrictions": "Open to graduate students."}, "CEP980": {"name": " Writing, Research, and Theory", "semester": "Fall of even years", "credits": " 3", "description": "Theory and research on the development, teaching, and learning of writing, birth through adulthood.", "restrictions": "Open to doctoral students."}, "CEP981": {"name": " Research on Literacy and Technology", "semester": "Spring of odd years", "credits": " 3", "description": "Issues, scholarship, tools, and scholars central to the research on literacy and technology.", "restrictions": "Open to doctoral students."}, "CEP982": {"name": " Seminar in Counseling, Educational Psychology and Special Education", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": " 3", "description": "Seminars in the various fields of emphasis in counseling, educational psychology, and special education.", "restrictions": "Open only to Ph.D. students in the College of Education."}, "CEP990": {"name": " Independent Study", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 6", "description": "Individual or small group study, guided by a faculty member, in the areas of Counseling, Educational Psychology and Special Education.", "restrictions": "Open only to Ph.D. students."}, "CEP991A": {"name": " Special Topics in Learning, Technology and Culture", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 3", "description": "Special topics in learning, technology, and culture in education.", "restrictions": "Open only to doctoral students in the College of Education."}, "CEP991B": {"name": " Special Topics in Educational Statistics and Research Design", "semester": "Fall of every year, Spring of every year", "credits": " 4", "description": "Special topics in educational statistics and research design.", "restrictions": "Open only to Ph.D. students."}, "CEP993K": {"name": " Practicum in PhD School Psychology", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Supervision of practicing graduate students. School psychological service delivery to school-aged populations. Clinical research.", "prerequisite": "CEP 893K and CEP 894K", "restrictions": "Open only to Ph.D. students in School Psychology."}, "CEP994D": {"name": " Laboratory and Field Experience in Special Education", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Supervised experience working with students with disabilities in K-12 classrooms, for students who need additional experience in teaching environments.", "restrictions": "Open only to Ph.D. students in Special Education. Approval of department."}, "CEP994K": {"name": " Internship in PhD School Psychology", "semester": "Fall of every year, Spring of every year", "credits": "Variable from 1 to 3", "description": "School psychological service delivery to school-aged populations. Experience in professional psychology.", "prerequisite": "CEP 993K", "restrictions": "Open to doctoral students in the School Psychology Major."}, "CEP995": {"name": " Practicum in Research Design and Data Analysis", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 3", "description": "Supervised research practicum. Design, execution, analysis, presentation, critique, and revision of research projects.", "restrictions": "Open only to doctoral students in the College of Education."}, "CEP999": {"name": " Doctoral Dissertation Research", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 23", "description": "Doctoral dissertation research.", "restrictions": "Open to doctoral students in the Department of Counseling, Educational Psychology, and Special Education."}}}