{"code": "CHE", "name": "Chemical Engineering", "courses": {"CHE201": {"name": " Material and Energy Balances", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Chemical engineering calculations. Synthesis of chemical process systems. Analysis of chemical processes using material and energy balances. Enthalpy calculations for changes in temperature, phase transitions, and chemical reactions.", "prerequisite": "(MTH 133 or MTH 153H or LB 119) and (CEM 142 or CEM 152 or LB 172) and ((CSE 131 or concurrently) or (CSE 231 or concurrently) or (EGR 102 or concurrently))"}, "CHE210": {"name": " Modeling and Analysis of Transport Phenomena", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Steady and unsteady state material and energy balances. Fluxes and rate processes. Shell balances. Balance equations for mass, heat, and momentum transport. Analogies among mass, heat, and momentum transport. Analytical and numerical solutions. Application of computational methods to problem solutions.", "prerequisite": "((MTH 235 or concurrently) or (MTH 340 or concurrently) or (MTH 347H or concurrently)) and CHE 201"}, "CHE301": {"name": " Chemical Engineering as a Profession", "semester": "Spring of every year", "credits": " 1", "description": "Professional aspects of chemical engineering. Communication skills, professionalism and ethics, teamwork skills, contemporary engineering issues, career planning, project management, and industrial processes.", "prerequisite": "(CHE 201 or concurrently) and completion of Tier I writing requirement"}, "CHE311": {"name": " Fluid Flow and Heat Transfer", "semester": "Fall of every year", "credits": " 3", "description": "Thermodynamics of fluid flow. Laminar and turbulent flow. Design of flow systems. Heat transfer in solids and flowing fluids. Interphase heat transfer. Radiant heat transfer. Multiple effect evaporation. Design of heat exchange equipment.", "prerequisite": "CHE 210 or concurrently", "restrictions": "Open to juniors or seniors in the College of Engineering."}, "CHE312": {"name": " Mass Transfer and Separations", "semester": "Spring of every year", "credits": " 4", "description": "Diffusion. Mass transfer coefficients. Design of countercurrent separation systems, both stagewise and continuous. Distillation, absorption, extraction. Multicomponent separations. Batch processes. Computer-aided design methods.", "prerequisite": "CHE 210 or concurrently", "restrictions": "Open to juniors or seniors in the Chemical Engineering Major."}, "CHE316": {"name": " Laboratory Practice and Statistical Analysis", "semester": "Spring of every year", "credits": " 4", "description": "Practical experience with unit operations equipment, including separations processes, reactor systems, and chemical processes requiring analysis of heat, mass and momentum transport. Laboratory assignments requiring teamwork. Engineering statistics with focus on model building, experimental design, and statistical quality control.", "prerequisite": "(CHE 311 and (CHE 312 or concurrently) and (CHE 321 or concurrently) and CHE 431) and completion of Tier I writing requirement", "restrictions": "Open to juniors or seniors in the Chemical Engineering Major."}, "CHE321": {"name": " Thermodynamics for Chemical Engineering", "semester": "Spring of every year", "credits": " 4", "description": "First and second laws. Thermodynamics of flow and energy conversion processes. Properties of single and multi-component systems. Phase equilibria. Chemical equilibria in reacting systems.", "prerequisite": "CHE 201"}, "CHE431": {"name": " Chemical Reaction Engineering", "semester": "Fall of every year", "credits": " 4", "description": "Design and analysis of homogeneous flow and batch reactors. Chemical kinetics and equilibria. Reaction rate expressions from mechanisms and experimental data. Mass and heat transfer in heterogeneous reactors. Heterogeneous reactor design. Catalysis.", "prerequisite": "CHE 210 or concurrently", "restrictions": "Open to juniors or seniors in the Chemical Engineering Major."}, "CHE432": {"name": " Process Analysis and Control", "semester": "Fall of every year", "credits": " 3", "description": "Modeling of process dynamics. Basics of control theory. Design of control systems and specification of control strategies. Integration of control theory with modern practice.", "prerequisite": "CHE 431", "restrictions": "Open to seniors or juniors in the Chemical Engineering Major."}, "CHE433": {"name": " Process Design and Optimization I", "semester": "Fall of every year", "credits": " 4", "description": "Applications of chemical engineering principles in design calculations. Selection of optimum design. Influence of design on capital investment, operating cost, product loss and quality. Mathematical programming methods for optimization.", "prerequisite": "(CHE 311 and CHE 312 and CHE 321 and CHE 431) and completion of Tier I writing requirement", "restrictions": "Open to seniors in the Chemical Engineering Major."}, "CHE434": {"name": " Process Design and Optimization II", "semester": "Spring of every year", "credits": " 2", "description": "Design project requiring an integrated design of chemical engineering processes. Process and project engineering. Instrumentation and control systems. Flowsheet layout and optimization. Process simulation.", "prerequisite": "CHE 433"}, "CHE468": {"name": " Biomass Conversion Engineering", "semester": "Fall of every year", "credits": " 3", "description": "Physicochemical and biological pretreatment. Biomass conversion to alcohols, biodiesel, bio-oil, syngas, and other value-added products using advanced biological, chemical, and thermochemical treatments.", "prerequisite": "(BE 351 or CHE 321) and (BE 360 or CHE 431)"}, "CHE469": {"name": " Sustainable Bioenergy Systems", "semester": "Spring of every year", "credits": " 3", "description": "Biorefinery analysis and system design. Life cycle assessment to evaluate sustainability of bioenergy systems. Current policy regulating the bioeconomy and system economics. Product commercialization.", "prerequisite": "BE 230 or CHE 201", "restrictions": "Open to juniors or seniors in the College of Engineering."}, "CHE472": {"name": " Composite Materials Processing", "semester": "Fall of every year", "credits": " 3", "description": "Manufacturing processes for thermoset and thermoplastic matrix composites. Mechanical and thermal evaluation of composites. Rheology and molding of fiber-filled materials.", "prerequisite": "CHE 311 or ME 332 or CE 321"}, "CHE473": {"name": " Chemical Engineering Principles in Polymers and Materials Systems", "semester": "Spring of every year", "credits": " 3", "description": "Application of chemical engineering principles to polymer and materials systems. Structures and properties of metals, ceramics and polymers. Thermodynamics, synthesis, rubber elasticity, viscoelasticity, kinetics, rheology, and processing of polymers systems. Application of statistics and problem-solving skills to materials systems.", "prerequisite": "CHE 311 and CHE 321 and CHE 431 and CEM 352", "alias": "CHE 371"}, "CHE481": {"name": " Biochemical Engineering", "semester": "Fall of every year", "credits": " 3", "description": "Applications of microbiology and biochemistry to biochemical engineering. Kinetics and thermodynamics of biochemical reactors. Transport phenomena in biological systems. Bioreactor design and scale-up.", "prerequisite": "{BMB 401 or (BMB 461 and BMB 462)} and CHE 431"}, "CHE482": {"name": " Science and Technology of Wine Production", "semester": "Fall of every year", "credits": " 3", "description": "Origin and history of wine and wine production. Determination and timing of harvest, methods of postharvest handling, storage, and processing of grapes into juice and wine. Physical and chemical changes in wine and processes. Analysis of must and its adjustment, fermentation, fining, and aging. Physiology of yeasts and bacteria involved in winemaking and spoilage. Cellar practices, problems, and operations.", "prerequisite": "CEM 143 or CEM 251 or CEM 351", "restrictions": "Open to seniors or graduate students in the Department of Biosystems and Agricultural Engineering or in the Department of Chemical Engineering and Materials Science or in the Department of Chemistry or in the Department of Food Science and Human Nutrition or in the Department of Horticulture or in the Department of Microbiology and Molecular Genetics or in the Lyman Briggs Chemistry Coordinate Major. Approval of department."}, "CHE483": {"name": " Brewing and Distilled Beverage Technology", "semester": "Spring of every year", "credits": " 3", "description": "Raw materials for fermentation and basics of alcohol fermentation, beer and cider production; basics of distillation; brandy and eau de vie production; whiskey production; vodka, gin and flavored spirits production; flavor chemistry", "prerequisite": "CHE 311 or (ME 410 or concurrently) or BE 350 or (BE 429 or concurrently) or (FSC 325 or concurrently)", "restrictions": "Approval of department."}, "CHE490": {"name": " Independent Study", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 3", "description": "Theoretical or experimental studies of current research topics in chemical engineering. Individual interaction with faculty adviser.", "restrictions": "Open to students in the Chemical Engineering Major. Approval of department."}, "CHE491": {"name": " Selected Topics in Chemical Engineering", "semester": "Fall of every year, Spring of every year", "credits": "Variable from 1 to 3", "description": "Study of newly developing or non-traditional chemical engineering topics in a classroom environment.", "restrictions": "Open to students in the College of Engineering. Approval of department."}, "CHE801": {"name": " Advanced Chemical Engineering Calculations", "semester": "Fall of every year", "credits": " 3", "description": "Formulation of differential equations modeling physical phenomena in chemical engineering. Application of analytical and numerical solution methods. Interpretation of solutions."}, "CHE802": {"name": " Research Methods", "semester": "Fall of every year", "credits": " 1", "description": "Skills required for graduate research. Critically reviewing the literature, defining a fundamental research problem, effective oral and written technical presentations.", "restrictions": "Open to graduate students in the Department of Chemical Engineering and Materials Science."}, "CHE804": {"name": " Foundations in Chemical Engineering I", "semester": "Spring of every year", "credits": " 3", "description": "Mass and energy balances in batch, continuous, and open systems. Process thermodynamics. Properties of substances and mixtures. Phase equilibria. Chemical reaction equilibria. Chemical reactor kinetics and design."}, "CHE805": {"name": " Foundations in Chemical Engineering II", "semester": "Summer of every year", "credits": " 3", "description": "Macroscopic and microscopic balances involving momentum, energy, and mass transfer, Compressible and incompressible fluid flow. Flow systems. Heat transfer by conduction, convection, and radiation. Heat exchangers. Mass transfer by diffusion and convection. Gas absorption and stripping. Extraction. Distillation. Dimensional analysis."}, "CHE821": {"name": " Advanced Chemical Engineering Thermodynamics", "semester": "Fall of every year", "credits": " 3", "description": "Laws of thermodynamics, unsteady state processes. Prediction and correlation of phase equilibria for nonelectrolytes. Relation of quantum theory and statistical mechanics to thermodynamic properties.", "restrictions": "Open only to Chemical Engineering majors."}, "CHE822": {"name": " Advanced Transport Phenomena", "semester": "Spring of every year", "credits": " 3", "description": "Derivation of balance equations for mass, energy, and momentum. Constitutive equations for multicomponent fluids. Estimates of transport properties. Approximate models for turbulent and boundary layer flows. Boundary value problems."}, "CHE831": {"name": " Advanced Chemical Reaction Engineering", "semester": "Spring of every year", "credits": " 3", "description": "Characterization of solid catalysts. Heterogeneous reaction rate expressions. Simultaneous mass and heat transport and chemical reaction in porous catalysts. Design of fixed-bed and fluidized-bed reactors. Industrial catalytic reactions."}, "CHE869": {"name": " Life Cycle Assessment for Bioenergy and Bioproduct Systems", "semester": "Spring of every year", "credits": " 3", "description": "Life cycle assessment to evaluate the environmental impacts of biological and chemical conversion processes. Biomass supply chain economics and technoeconomics for biomass conversion. Current policy considerations impacting the adoption of bioenergy and bioproduct systems.", "restrictions": "Open to graduate students in the College of Engineering or in the Department of Biosystems and Agricultural Engineering or approval of department.", "exclude": "BE 469"}, "CHE871": {"name": " Material Surfaces and Interfaces", "semester": "Fall of odd years", "credits": " 3", "description": "Physical and chemical nature of solid surfaces and their interaction with gases, liquids, and other solids. Characterization of surfaces and solid-solid interfaces. Relation of surface and interfacial structure to engineering phenomena.", "restrictions": "Open only to graduate students in the Department of Chemical Engineering and Materials Science or Department of Chemistry or School of Packaging.", "alias": "MSM 871"}, "CHE872": {"name": " Polymers and Composites: Manufacturing, Structure and Performance", "semester": "Spring of even years", "credits": " 3", "description": "Structure-Property Relations of Polymers, Fibers, Fabrics and Composites, Material Selection, Manufacturing Processes, Process Induced Microstructure, Prediction of Composite Mechanical Properties, Dimensional Stability, Design of Cure Cycles, Mold Design.", "restrictions": "Open only to graduate students in the College of Engineering or the Department of Chemistry."}, "CHE882": {"name": " Advanced Biochemical Engineering", "semester": "Spring of even years", "credits": " 3", "description": "Microbial strain improvement. Metabolic engineering. Structured growth models. Non-ideal bioreactor performance. Biosensors and process control of bioreactors. Separation processes for biochemicals."}, "CHE883": {"name": " Multidisciplinary Bioprocessing Laboratory", "semester": "Spring of odd years", "credits": " 3", "description": "Mentored research project conducted in multidisciplinary team. Bioprocessing research methods. Teamwork skills."}, "CHE890": {"name": " Independent Study", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 3", "description": "Supervised individual investigation of a problem in chemical engineering.", "restrictions": "Open only to Chemical Engineering majors. Approval of department."}, "CHE891": {"name": " Selected Topics", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 3", "description": "Physical and mathematical analysis of phenomena such as swirling flows or stability of reactions and transport processes.", "restrictions": "Open only to Chemical Engineering majors."}, "CHE892": {"name": " Seminar", "semester": "Fall of every year, Spring of every year", "credits": " 1", "description": "Presentations of detailed studies of specialized aspects of chemical engineering and materials science.", "restrictions": "Open to master's students in the Chemical Engineering Major or in the Materials Science and Engineering Major."}, "CHE899": {"name": " Master's Thesis Research", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 8", "description": "Master's thesis research.", "restrictions": "Open only to Chemical Engineering majors."}, "CHE992": {"name": " Seminar", "semester": "Fall of every year, Spring of every year", "credits": " 1", "description": "Presentations of detailed studies of specialized aspects of chemical engineering and materials science.", "restrictions": "Open to doctoral students in the Chemical Engineering Major or in the Materials Science and Engineering Major."}, "CHE999": {"name": " Doctoral Dissertation Research", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 12", "description": "Doctoral dissertation research.", "restrictions": "Open to graduate students in the Chemical Engineering Major."}}}