{"code": "CJ", "name": "Criminal Justice", "courses": {"CJ110": {"name": " Introduction to Criminal Justice", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Description and analysis of agencies and processes involved in administration of justice in the United States."}, "CJ210": {"name": " Introduction to Forensic Science", "semester": "Fall of every year", "credits": " 3", "description": "Techniques of crime scene search. Collection and preservation of physical evidence. Class and individual scientific tests. Rules of evidence governing admissibility of physical evidence. Expert testimony."}, "CJ220": {"name": " Criminology", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Introduction to the socio-legal foundation of crime. Crime typology and measurement procedures. Theory and public policy. Societal responses to crime and criminals.", "restrictions": "Open to students in the Peace and Justice Studies Minor or in the Sociology Major or in the Youth and Society Minor or in the Criminal Justice Major or in the Law, Justice, and Public Policy Minor or in the Conservation and Environmental Law Enforcement Minor or approval of school."}, "CJ235": {"name": " Investigation Procedures", "semester": "Fall of every year", "credits": " 3", "description": "Laws of evidence controlling investigative procedures. Crime scene concerns. Multi-agency investigation.", "alias": "CJ 435"}, "CJ275": {"name": " Criminal Procedure", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Administration of criminal law. Investigation, prosecution, adjudication, and sentencing. Constitutional safeguards and legal controls on official action.", "prerequisite": "CJ 110", "alias": "CJ 375"}, "CJ292": {"name": " Methods of Criminal Justice Research", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Logic, design, analysis, and ethical principles in criminal justice research. Indicators of crime and its control.", "prerequisite": "(STT 200 or concurrently) or (STT 201 or concurrently)", "restrictions": "Not open to freshmen and open to students in the School of Criminal Justice."}, "CJ294": {"name": " Leadership and Professional Development in Criminal Justice", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Career planning and professional development. Leadership principles and theory, as related to the field of criminal justice.", "restrictions": "Open to freshmen or sophomores in the School of Criminal Justice or approval of school."}, "CJ335": {"name": " Policing", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Roles, responsibilities, issues, and trends pertinent to contemporary law enforcement organizations in contemporary society.", "prerequisite": "CJ 110 and CJ 220", "restrictions": "Open to juniors or seniors in the Criminal Justice Major or in the Conservation and Environmental Law Enforcement Minor."}, "CJ355": {"name": " Juvenile Justice", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "The juvenile justice system and law. Theories of juvenile delinquency and deviance. Sociological, psychological, and anthropological perspectives.", "restrictions": "Open to juniors or seniors in the Peace and Justice Studies Minor or in the Criminal Justice Major."}, "CJ365": {"name": " Corrections", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Historical and contemporary views of offender management and treatment. Corrections system operation. Effects of institutionalization. Alternatives to incarceration.", "prerequisite": "CJ 110 and CJ 220", "restrictions": "Open to juniors or seniors in the Criminal Justice Major."}, "CJ385": {"name": " Private Security", "semester": "Fall of every year", "credits": " 3", "description": "Relationships of private protective services with public law enforcement. Individuals, businesses, and governments providing prevention, protection, investigation, and disaster recovery services. Protection of persons, property, and information.", "prerequisite": "CJ 110 and CJ 220", "restrictions": "Open to juniors or seniors in the Criminal Justice Major or in the Security Management Minor."}, "CJ422": {"name": " Comparative and Historical Criminal Justice", "semester": "Spring of every year", "credits": " 3", "description": "Comparative study of criminal justice systems. Theories, types, and effects of intervention.", "prerequisite": "CJ 110", "restrictions": "Open to juniors or seniors in the Criminal Justice Major."}, "CJ424": {"name": " Crime, Mass Media, and Society (W)", "semester": "Spring of every year", "credits": " 3", "description": "Representation of crime and criminal justice in the media. Relationship between media and criminal justice organizations. Images of crime, criminal justice, and trafficking. Media effects on criminal justice policy.", "restrictions": "Open to seniors in the School of Criminal Justice."}, "CJ425": {"name": " Women and Criminal Justice", "semester": "Spring of every year", "credits": " 3", "description": "Theories on women's victimization and criminality. Women's experiences as victims, offenders, and criminal justice employees. Laws and their effects on the rights of women in the criminal justice system.", "restrictions": "Open to juniors or seniors."}, "CJ426": {"name": " Violence Against Women (W)", "semester": "Spring of every year", "credits": " 3", "description": "Intimate partner violence, rape and stalking. Theoretical causes of violence against women and factors commonly associated with it. Physical, mental and legal consequences, institutional responses and prevention efforts.", "prerequisite": "Completion of Tier I Writing Requirement", "restrictions": "Open to juniors or seniors in the School of Criminal Justice or approval of school."}, "CJ427": {"name": " Criminology and Public Policy (W)", "semester": "Fall of every year", "credits": " 3", "description": "Advanced study of criminological theory. Examination of policies implied by different theories of crime. Evaluation of crime control policies.", "prerequisite": "(CJ 110 and CJ 220) and completion of Tier I writing requirement", "restrictions": "Open to juniors or seniors in the Criminal Justice Major."}, "CJ429": {"name": " Interdisciplinary Topics in CyberSecurity", "semester": "Spring of every year", "credits": " 3", "description": "Technical, legal, criminal, medical business, and communication aspects of CyberSecurity.", "prerequisite": "CSE 101 or CSE 131 or CSE 231", "restrictions": "Open to juniors or seniors or graduate students."}, "CJ430": {"name": " Advanced Seminar in Policing (W)", "semester": "Fall of every year", "credits": " 3", "description": "Advanced issues in policing. Police strategies and evaluation. Behavioral determinants of policing. Socialization and culture of police. Police coercion. Police deviance.", "prerequisite": "(CJ 110 and CJ 220 and CJ 335) and completion of Tier I writing requirement", "restrictions": "Open to juniors or seniors in the Criminal Justice Major."}, "CJ432": {"name": " Community Policing", "semester": "Spring of every year", "credits": " 3", "description": "Community policing philosophy, applications, issues, and contemporary research. Community policing models.", "restrictions": "Open to juniors or seniors in the Criminal Justice Major."}, "CJ433": {"name": " Law Enforcement Intelligence Operations", "semester": "Spring of every year", "credits": " 3", "description": "Law enforcement intelligence as an analytic tool for case development and resource allocation. Historical, ethical, legal, and operational issues affecting current practice.", "restrictions": "Open to juniors or seniors in the Criminal Justice Major."}, "CJ434": {"name": " Police Administration", "semester": "Fall of every year", "credits": " 3", "description": "Organizational theory, leadership, communications, and labor relations in police administration. Historical and legal perspectives.", "restrictions": "Open to seniors in the Criminal Justice Major."}, "CJ439": {"name": " Homeland Security", "semester": "Fall of every year", "credits": " 3", "description": "Definition of terrorism and terrorist groups. Fundamental principles of emergency management and homeland security. Historical perspectives and modern threats. Public health and environmental protection. Private sector role and impacts. Security vs. civil liberties. Science, technology, and research issues.", "restrictions": "Open to juniors or seniors in the Defense Studies and Leadership Minor or in the Criminal Justice Major."}, "CJ445": {"name": " Cyber-Crime and Cyber-Security (W)", "semester": "Fall of every year", "credits": " 3", "description": "Internet crimes and problems and procedures for cybersecurity.", "prerequisite": "Completion of Tier I Writing Requirement", "restrictions": "Open to juniors or seniors in the School of Criminal Justice or approval of school."}, "CJ450": {"name": " Introduction to Product Counterfeiting", "semester": "Spring of odd years", "credits": " 3", "description": "Introduction to the crime of product counterfeiting through an analysis of theory, empirical studies, and case histories. Understanding of product counterfeiting.", "restrictions": "Not open to freshmen."}, "CJ465": {"name": " Critical Issues in Corrections (W)", "semester": "Spring of every year", "credits": " 3", "description": "Advanced topics in corrections. Probation and parole. Community corrections. Recidivism and reentry. Evolution of punishment. Comparative systems of confinement.", "prerequisite": "(CJ 365) and completion of Tier I writing requirement", "restrictions": "Open to juniors or seniors in the Criminal Justice major."}, "CJ466": {"name": " Corrections Organizations and Systems", "semester": "Fall of every year", "credits": " 3", "description": "Management of correctional organizations. Interactions between correctional organizations and their political and cultural environments.", "prerequisite": "CJ 355 or CJ 365", "restrictions": "Open to juniors or seniors in the Criminal Justice Major."}, "CJ471": {"name": " Law of Corrections", "semester": "Fall of odd years", "credits": " 3", "description": "Constitutional limitations and the impact of law on correctional practice. Due process, prisoners' rights, and parole and probation.", "restrictions": "Open to juniors or seniors in the Criminal Justice Major."}, "CJ473": {"name": " Comparative Constitutional Law", "semester": "Spring of every year", "credits": " 3", "description": "Comparative constitutional law. Courts with constitutional jurisdiction. Allocation of constitutional powers. Relationship among levels of government. Individual constitutional rights.", "prerequisite": "CJ 275 or approval of school"}, "CJ474": {"name": " Law and Criminal Justice Policy", "semester": "Spring of every year", "credits": " 3", "description": "Impact of law on police practices, court processes, and corrections institutions and programs. Development, implementation, and evaluation of judicial policies.", "restrictions": "Open to juniors or seniors in the School of Criminal Justice or in the Interdisciplinary Studies in Social Science major."}, "CJ485": {"name": " Critical Issues in Private Security", "semester": "Spring of every year", "credits": " 3", "description": "Advanced topics in private security. Planning and administering. Organizing and staffing. Human relations. Management styles. Media relations.", "prerequisite": "CJ 385", "restrictions": "Open to juniors or seniors in the School of Criminal Justice."}, "CJ490": {"name": " Independent Study", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 3", "description": "Individual study in fields of criminal justice, under direct supervision of a faculty member.", "prerequisite": "CJ 335 or CJ 355 or CJ 365 or CJ 385", "restrictions": "Open to juniors or seniors in the Criminal Justice Major. Approval of school."}, "CJ491": {"name": " Topics in Criminal Justice", "semester": "Fall of every year, Spring of every year", "credits": "Variable from 1 to 4", "description": "Special issues in criminal justice.", "prerequisite": "CJ 292", "restrictions": "Open to juniors or seniors in the Criminal Justice major."}, "CJ494": {"name": " Criminal Justice Practicum", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 3 to 12", "description": "Observation, participation, and study in selected criminal justice agencies.", "prerequisite": "CJ 335 or CJ 355 or CJ 365 or CJ 385", "restrictions": "Open to juniors or seniors in the School of Criminal Justice. Approval of school."}, "CJ801": {"name": " Crime Causation, Prevention, and Control", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Theories of crime causation. Translation of theory to policy.", "restrictions": "Open to graduate students in the School of Criminal Justice ."}, "CJ802": {"name": " Proseminar in Law Enforcement Intelligence Operations", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": " 3", "description": "Law enforcement intelligence as an analytic tool for case development and resource allocation. Historical, ethical, legal, and operational issues affecting current practice.", "restrictions": "Open to graduate students in the Criminal Justice major or in the Law Enforcement Intelligence and Analysis major."}, "CJ803": {"name": " Foundations in Homeland Security", "semester": "Spring of every year", "credits": " 3", "description": "Homeland security's definition of terrorism and terrorist groups. Fundamental principles of emergency management and homeland security. Historical perspectives and modern threats. Public health and environmental protections. Private sector role and impacts. Security versus civil liberties. Science technology and research issues.", "restrictions": "Open to graduate students in the Criminal Justice major or in the Law Enforcement Intelligence and Analysis major."}, "CJ804": {"name": " Crime Scene Investigation", "semester": "Fall of odd years", "credits": " 1", "description": "Introduction to crime scene investigation. Documentation, evidence collection, presumptive chemical and biological tests, and collection and preservation of impression evidence.", "restrictions": "Open to graduate students in the Forensic Science Major."}, "CJ805": {"name": " Survey in Forensic Science", "semester": "Fall of even years", "credits": " 3", "description": "Scientific analysis of physical evidence. Four major aspects of physical evidence using real criminal and civil cases", "restrictions": "Open to students in the Forensic Science Major."}, "CJ809": {"name": " Issues in Criminal Justice", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 4", "description": "Special issues in criminal justice research and management.", "restrictions": "Open only to master's students in the School of Criminal Justice or to doctoral students in the Social Science-Criminal Justice major."}, "CJ810": {"name": " Proseminar in Criminal Justice", "semester": "Fall of every year", "credits": " 3", "description": "Survey of classical and recent literature in criminal justice. Trends and issues that transcend the components of the criminal justice system.", "restrictions": "Open only graduate students in the School of Criminal Justice."}, "CJ811": {"name": " Design and Analysis in Criminal Justice Research", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Scientific methods in criminal justice research. Design, data collection and analysis, interpretation of findings, and ethical concerns. Computer use in data analysis.", "restrictions": "Open to graduate students in the School of Criminal Justice ."}, "CJ812": {"name": " Criminal Justice Management Seminar", "semester": "Spring of every year", "credits": " 3", "description": "Organization theory and behavior for the criminal justice agency. Organization and policy planning, budgeting, forecasting, human resource management, and project implementation.", "restrictions": "Open to graduate students in the School of Criminal Justice or approval of school."}, "CJ814": {"name": " Seminar in Management Topics", "semester": "Fall of odd years", "credits": " 3", "description": "Critical application of selected analytical tools to managing justice agencies. Human and financial resources. Organizational design. Productivity measurement and enhancement. Resource acquisition and allocation.", "restrictions": "Open only to graduate students in the School of Criminal Justice."}, "CJ815": {"name": " Proseminar in Criminal Investigation", "semester": "Spring of every year", "credits": " 3", "description": "Research on the criminal justice process. Investigation and role of evidence in the administration of justice. Ethical issues.", "restrictions": "Open only to graduate students in the School of Criminal Justice."}, "CJ817": {"name": " Law and Forensic Science", "semester": "Fall of odd years", "credits": " 2", "description": "Legal aspects of forensic science. Adjudicative process, admissibility of scientific evidence, laboratory reports, hearsay, relevant case materials, and expert testimony.", "restrictions": "Open to students in the Forensic Science Major."}, "CJ819": {"name": " Forensic Analysis of Drugs and Alcohol", "semester": "Fall of odd years", "credits": " 3", "description": "Techniques and processes in analysis of physical evidence including spectroscopy, chromatography, and microscopy. Emphasis on controlled substances.", "restrictions": "Open to graduate students in the Forensic Science Major."}, "CJ820": {"name": " Forensic Chemistry and Microscopic Evidence", "semester": "Spring of odd years", "credits": " 3", "description": "Continuation of CJ 819. Analysis of trace evidence including hairs and fibers, paints and coatings, explosives and fire residues, glass and soil.", "restrictions": "Open to graduate students in the Forensic Science Major."}, "CJ821": {"name": " Food Protection and Defense", "semester": "Fall of every year", "credits": " 3", "description": "Food systems and criminal justice approaches to prepare for and solve issues relating to food safety and defense.", "restrictions": "Open to graduate students in the College of Veterinary Medicine or in the Food Safety major or in the Veterinary Medicine major or in the Criminal Justice major or approval of college."}, "CJ822": {"name": "  Comparative Criminal Justice", "semester": "Spring of even years", "credits": " 3", "description": "Globalization, crime causation, measurement, and control in comparative and cross-national contexts. Nature of policing, courts, and corrections in select countries.", "prerequisite": "CJ 801", "restrictions": "Open to graduate students in the School of Criminal Justice."}, "CJ823": {"name": " Globalization of Crime", "semester": "Fall of even years", "credits": " 3", "description": "International crimes and organized crime. Trafficking in women, children, and body parts. Related problems such as firearm violence, money laundering, and corruption that transcend national boundaries.", "restrictions": "Open to graduate students in the School of Criminal Justice."}, "CJ829": {"name": " National and Global Trends in Court Planning", "semester": "Spring of every year", "credits": " 3", "description": "Emerging judicial trends. Stakeholder expectations. Impact on judicial branch planning. Regional, national, and global trends that frame strategic issues, planning, actions, and leadership.", "restrictions": "Open to graduate students in the School of Criminal Justice or approval of school."}, "CJ830": {"name": " Foundations of Police Studies", "semester": "Spring of every year", "credits": " 3", "description": "Police practice. The police role, socialization, discretion, strategies, deviance.", "prerequisite": "CJ 810", "restrictions": "Open to graduate students in the School of Criminal Justice."}, "CJ836": {"name": " Assessment of Police Policies and Operations", "semester": "Spring of even years", "credits": " 3", "description": "Recent policy-related research and its application to the deployment of human resources.", "restrictions": "Open only to graduate students in the School of Criminal Justice."}, "CJ837": {"name": " The Intelligence Process and Counterterrorism", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Law enforcement intelligence process for domestic and international terrorist threats. Current issues and trends in terrorism and counterterrorism, and the role of law enforcement intelligence.", "restrictions": "Open to graduate students in the School of Criminal Justice."}, "CJ838": {"name": " Issues in Terrorism", "semester": "Spring of every year, Summer of every year", "credits": " 3", "description": "Origins, history, and mutable definitions of terrorism. Ideologies, organizational features, ideologies, and state responses. Influential contemporary and historical terrorist movements. Force multipliers and media.", "restrictions": "Open to graduate students in the School of Criminal Justice."}, "CJ839": {"name": " Analytic Thinking and Intelligence", "semester": "Fall of every year", "credits": " 3", "description": "Analytic processes, tools, applications, and contemporary issues as used in law enforcement intelligence processes.", "restrictions": "Open to graduate students in the School of Criminal Justice or approval of school."}, "CJ840": {"name": " Anti-Counterfeit Strategy and Product Protection", "semester": "Summer of every year", "credits": " 3", "description": "Theory and applied techniques for anti-counterfeit strategies and product protection for food and consumer products.", "restrictions": "Open to graduate students in the School of Criminal Justice or in the School of Packaging or in the Food Safety major or approval of department."}, "CJ845": {"name": " Environmental Risk Perception and Decision-Making", "semester": "Spring of odd years", "credits": " 3", "description": "Theoretical underpinnings of individual decision-making and risk perception processes. Case studies of the interplay of risk perception and decision-making in an environmental and or criminological context.", "restrictions": "Open to master's students or doctoral students in the School of Criminal Justice or in the Department of Fisheries and Wildlife or approval of school."}, "CJ846": {"name": " Corporate Environmental Crime and Risk", "semester": "Spring of even years", "credits": " 3", "description": "Theoretical accounts and multiple interventions relevant to corporate environmental crime and risk. Use of “Smart Regulation” principles to design interventions to match specific problems.", "restrictions": "Open to master's students or doctoral students in the Department of Fisheries and Wildlife or in the School of Criminal Justice or approval of school."}, "CJ847": {"name": " Global Risks, Conservation, and Criminology", "semester": "Fall of every year", "credits": " 3", "description": "Theories, actors, characteristics and legal instruments associated with risk, conservation, and criminology related to globalization. Current case studies in criminological conservation.", "restrictions": "Open to graduate students or approval of school."}, "CJ850": {"name": " Product Counterfeiting", "semester": "Fall of odd years", "credits": " 3", "description": "Advanced theoretical and empirical perspectives from criminology, victimology, and organizational behavior to analyze the crime of product counterfeiting."}, "CJ856": {"name": " Advanced Topics in Policing", "semester": "Spring of every year", "credits": " 3", "description": "Special topics on policing such as crime analysis, problem solving, police recruitment, retention and development, police behavior and ethics.", "restrictions": "Open to graduate students in the School of Criminal Justice or approval of school."}, "CJ858": {"name": " Gender, Justice and Environmental Change : Issues and Concepts", "semester": "Fall of every year", "credits": " 3", "description": "Issues and concepts related to gender, ecology, and environmental studies. Key debates and theoretical approaches to addressing environmental issues from a gender and social justice perspective. Gender and environment issues and processes from a global perspective."}, "CJ860": {"name": " Historical Foundations/Contemporary Frameworks of Judicial Administration", "semester": "Fall of every year", "credits": " 3", "description": "Foundations in the legal and historical evolution of courts. Contemporary methods, practices, and theories of court administration, including purposes and responsibilities of courts, rule of law, caseflow management, and court governance and leadership models.", "restrictions": "Open to graduate students in the School of Criminal Justice or approval of department."}, "CJ861": {"name": " Budget Planning and Resource Allocation for Court Performance", "semester": "Summer of every year", "credits": " 3", "description": "Financial resources for courts and court systems. Resource acquisition and allocation strategies, output and outcome measurement for expenditure assessment, efficient and effective resource management, techniques for budget presentation in the public-sector context, alternative budget planning and justification formats, audit formats, revenue enhancement sources and strategies.", "restrictions": "Open to graduate students in the School of Criminal Justice or approval of department."}, "CJ862": {"name": " Workforce Planning and Management in the Courts", "semester": "Summer of every year", "credits": " 3", "description": "Workforce planning and management in the judicial branch. Selections and forms of employment, including elected and appointed judges and other judicial officers, at-will employees, civil servants, contractual labor and services. Succession planning, methods of employee development, coaching, mentoring, and continuing education.", "restrictions": "Open to graduate students in the School of Criminal Justice or approval of department."}, "CJ863": {"name": " Courthouse Planning: Space, Technology, Security, and Disaster Recovery", "semester": "Summer of every year", "credits": " 3", "description": "Planning for building or remodeling of courthouse and courtroom facilities. Requirements for federal and state courts. Safe public space, efficient workflow, technology infrastructure for electronic courts, security, and disaster planning and recovery.", "restrictions": "Open to graduate students in the School of Criminal Justice or approval of department."}, "CJ864": {"name": " Elements of Essential Court Operations", "semester": "Spring of every year", "credits": " 3", "description": "Court management infrastructure systems. Contemporary developments in problem-solving courts. Methods for measuring court inputs, outputs, and outcomes. Constitutional mandates, judicial branch independence and interdependence, transparency, and accountability.", "restrictions": "Open to graduate students in the School of Criminal Justice or approval of department."}, "CJ865": {"name": " Adult Corrections", "semester": "Fall of odd years", "credits": " 3", "description": "Traditional and contemporary adult correctional practices. Social, political, economic, and organizational factors affecting correctional policies.", "restrictions": "Open only to graduate students in the School of Criminal Justice."}, "CJ870": {"name": " Introduction to Crime Analysis", "semester": "Fall of every year", "credits": " 3", "description": "Theoretical foundations of crime analysis. Techniques and processes used by law enforcement agencies to document and respond to patterns of crime.", "restrictions": "Open to master's students in the Criminal Justice Major or in the Law Enforcement Intelligence and Analysis Major."}, "CJ871": {"name": " Advanced Crime Analysis", "semester": "Spring of every year", "credits": " 3", "description": "Advanced application of intelligence and crime analysis skills and techniques."}, "CJ872": {"name": " Open Source Information Analysis", "semester": "Spring of every year", "credits": " 3", "description": "Techniques for collection and intelligence analysis of open source information. Ethical issues for collection of publicly available information and validation of sources."}, "CJ885": {"name": " Security Management", "semester": "Spring of odd years", "credits": " 3", "description": "Organization and management of security operations in business, industry, and government.", "restrictions": "Open to graduate students in the School of Criminal Justice."}, "CJ886": {"name": " Security Administration", "semester": "Fall of odd years", "credits": " 3", "description": "Administrative and quantitative techniques for security operations. Statistical analyses. Analysis of financial statements. Operations research and computer techniques.", "restrictions": "Open to graduate students in the School of Criminal Justice."}, "CJ887": {"name": " Quantitative Methods in Criminal Justice Research", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Descriptive and inferential statistics and computer use in criminal justice research.", "prerequisite": "CJ 811", "restrictions": "Open to graduate students in the Criminal Justice Major or in the Judicial Administration Major."}, "CJ890": {"name": " Independent Study", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 6", "description": "Individual research and writing under faculty supervision.", "restrictions": "Open only to graduate students in the School of Criminal Justice. Approval of school."}, "CJ894": {"name": " Practicum", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 6", "description": "Observation, study, and work in selected criminal justice agencies. Participation in domestic and foreign criminal justice systems.", "restrictions": "Open only to graduate students in the School of Criminal Justice. Approval of school."}, "CJ895": {"name": " Methods for Policy Development and Implementation", "semester": "Fall of every year", "credits": " 3", "description": "Public policy process and organizational change with regard to crime and justice. Methods and techniques for diagnosing problems, designing policies, and implementing change in organizations and governmental jurisdictions.", "restrictions": "Open to master's students in the School of Criminal Justice."}, "CJ896": {"name": " Policy Analysis under Conditions of Change", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Methods of policy analysis in criminal justice settings. Policy analysis for the formulation, adoption, and implementation of changes.", "prerequisite": "CJ 811 and (CJ 887 or concurrently)", "restrictions": "Open to graduate students in the School of Criminal Justice ."}, "CJ897": {"name": " Comprehensive Threat Assessment", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": " 3", "description": "Methods of conducting a comprehensive threat assessment in criminal justice settings. Comprehensive threat assessment for the formulation, adoption, and implementation of prevention and intervention practices.", "prerequisite": "CJ 837", "restrictions": "Open to graduate students in the Law Enforcement Intelligence and Analysis Major."}, "CJ899": {"name": " Master's Thesis Research", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 6", "description": "Planned research and writing directed by student's thesis committee.", "restrictions": "Open only to graduate students in the School of Criminal Justice."}, "CJ901": {"name": " Seminar in Contemporary Criminal Justice Theory", "semester": "Spring of every year", "credits": " 3", "description": "Theoretical perspectives and issues in criminal justice and criminology", "prerequisite": "CJ 801", "restrictions": "Open to doctoral students in the Criminal Justice Major."}, "CJ904": {"name": " Criminal Justice Organizations and Processes", "semester": "Spring of every year", "credits": " 3", "description": "Theoretical perspectives on organizations and processes in criminal justice. Evaluation of organizational performance in justice agencies.", "restrictions": "Open only to doctoral students in the School of Criminal Justice."}, "CJ905": {"name": " Law and Society", "semester": "Fall of even years", "credits": " 3", "description": "Theoretical perspectives on law. Impact of law on society and the criminal justice system.", "restrictions": "Open to doctoral students in the Criminal Justice Major."}, "CJ906": {"name": " Advanced Quantitative Methods in Criminal Justice Research", "semester": "Spring of every year", "credits": " 3", "description": "Applications of quantitative techniques to criminal justice data. Use of multiple regression and SPSS.", "prerequisite": "CJ 887 and STT 421", "restrictions": "Open to doctoral students in the Criminal Justice major."}, "CJ907": {"name": " Advanced Topics in Criminal Justice Data Analysis", "semester": "Spring of every year", "credits": " 3", "description": "Advanced quantitative analysis techniques for criminal justice data.", "prerequisite": "CJ 906", "restrictions": "Open only to doctoral students in the School of Criminal Justice."}, "CJ908": {"name": " Advanced Topics in Criminal Justice", "semester": "Spring of every year", "credits": " 3", "description": "Intensive study of one subfield of criminal justice. Critical evaluation of the literature.", "restrictions": "Open only to doctoral students in the School of Criminal Justice."}, "CJ909": {"name": " Advanced Research Methods", "semester": "Fall of every year", "credits": " 3", "description": "Methodological approaches to conducting sound, ethical criminal justice and criminological research. Research ethics, study design, and data collection methods.", "restrictions": "Open to doctoral students in the School of Criminal Justice."}, "CJ999": {"name": " Doctoral Dissertation Research", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 12", "description": "Doctoral dissertation research.", "restrictions": "Open to doctoral students in the Criminal Justice major."}}}