{"code": "CMP", "name": "Construction Management Program", "courses": {"CMP101": {"name": " Principles of Construction Management", "semester": "Fall of every year, Spring of every year", "credits": " 2", "description": "Historical developments, current issues and trends in commercial and residential construction industries.", "restrictions": "Not open to seniors.", "alias": "BCM 101"}, "CMP124": {"name": " Residential Construction Materials and Methods", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Properties of construction materials and their application in residential construction.", "prerequisite": "CMP 101 or concurrently", "restrictions": "Not open to seniors.", "alias": "BCM 124"}, "CMP210": {"name": " Commercial Construction Methods", "semester": "Fall of every year", "credits": " 3", "description": "Commercial construction", "prerequisite": "CMP 124 or concurrently", "alias": "BCM 210"}, "CMP222": {"name": " Statics and Strengths of Materials", "semester": "Spring of every year", "credits": " 3", "description": "Equilibrium of forces. Free body diagrams. Force components. Bending moments. Stress and strain. Mechanical properties of materials. Beams and trusses. Computer applications. Indeterminate structures.", "prerequisite": "(CMP 210 and CMP 211) and (MTH 124 or MTH 132 or LB 118) and (PHY 183 or PHY 231)", "alias": "BCM 222", "exclude": "CE 221"}, "CMP230": {"name": " Utility Systems", "semester": "Spring of every year", "credits": " 4", "description": "Design and analysis of utility and environmental systems in residential and commercial construction with a focus on mechanical, electrical, and plumbing systems", "prerequisite": "(CMP 210) and (MTH 124 or MTH 132 or LB 118) and (PHY 183 or PHY 231)", "restrictions": "Not open to seniors.", "alias": "BCM 230"}, "CMP245": {"name": " Principles of Green Building", "semester": "Spring of every year", "credits": " 3", "description": "Origins of green building in the U.S. Codes, regulations, and standards governing green building practice. The whole building concept and airflow, thermal, and moisture movement in buildings. Sustainable building systems and modern green construction practices.", "prerequisite": "CMP 210 and (CMP 230 or concurrently)"}, "CMP305": {"name": " Site Construction and Measurement", "semester": "Fall of every year", "credits": " 3", "description": "Site construction methods, materials and equipment for buildings, soil, foundation, erosion, and storm water. Layout, leveling, surveying, and underground utilities.", "restrictions": "Open to juniors or seniors in the Construction Management Major.", "alias": "BCM 305"}, "CMP311": {"name": " Construction Project Scheduling", "semester": "Spring of every year", "credits": " 3", "description": "Basic construction project scheduling procedures. Work breakdown structure, critical path method, and scheduling logic. Activity durations, status reports, resource allocation, and control.", "prerequisite": "(STT 200 or STT 201 or STT 315 or STT 421) and (CMP 305 and CMP 322)", "restrictions": "Open to juniors or seniors in the Construction Management Major or in the Civil Engineering Major or approval of school.", "alias": "BCM 411, CMP 411"}, "CMP315": {"name": " Construction Quantity Surveying", "semester": "Spring of every year", "credits": " 3", "description": "Measurement of quantities for construction projects. Work breakdown structure. Industry standards.", "prerequisite": "CMP 305 and (CSE 101 or CSE 131 or CSE 231 or CSS 110)", "restrictions": "Open to juniors or seniors in the Construction Management Major or in the Civil Engineering Major or approval of school.", "alias": "BCM 315"}, "CMP322": {"name": " Structural Systems", "semester": "Fall of every year", "credits": " 3", "description": "Structural design using wood, steel and concrete. Beams, columns, footings, and foundation walls. Loading, soils.", "prerequisite": "CMP 222 or CE 221 or ME 222", "restrictions": "Open to juniors or seniors in the Construction Management major or in the Civil Engineering Major or approval of school.", "alias": "BCM 322"}, "CMP325": {"name": " Real Estate Principles and Construction Finance", "semester": "Fall of every year", "credits": " 4", "description": "Financial methods and instruments utilized in construction, rehabilitation, development, and purchase of real estate. Terms, contracts, valuation, brokerage, taxation, risk, and interest rate analysis.", "prerequisite": "EC 201 or EC 202 or EC 251H or EC 252H", "restrictions": "Open to juniors or seniors in the Construction Management Major or approval of department.", "alias": "BCM 325"}, "CMP328": {"name": " Construction Presentation Graphics and Building Information Modeling", "semester": "Fall of every year", "credits": " 2", "description": "Graphic communication methods used in construction organizations. Use of Building Information Modeling software.", "prerequisite": "CMP 210 and CMP 230", "restrictions": "Open to juniors or seniors in the Construction Management Major or approval of department.", "alias": "BCM 328"}, "CMP385": {"name": " Construction Documents and Contracts (W)", "semester": "Spring of every year", "credits": " 3", "description": "Construction contracts for commercial and residential projects. Contract procedures, bidding, changes, substitutions. Specifications. Insurance, bonding, claims, disputes, and payments. Responsibilities of owners and contractors.", "prerequisite": "(CMP 305) and completion of Tier I writing requirement", "restrictions": "Open to juniors or seniors in the Construction Management Major or in the Civil Engineering Major and open to juniors or seniors in the Interior Design Major or in the Bachelor of Landscape Architecture or approval of department.", "alias": "BCM 385"}, "CMP401": {"name": " Construction Safety Management", "semester": "Fall of every year", "credits": " 3", "description": "Construction safety with Occupational Safety and Health Administration (OSHA) emphasis. General safety and health provisions, records, and safety management programs. Personnel protection and lifesaving equipment. Economic impact of safety program.", "prerequisite": "CMP 305", "restrictions": "Open to juniors or seniors in the Construction Management Major or in the Civil Engineering Major or approval of department.", "alias": "BCM 401"}, "CMP415": {"name": " Cost Estimating and Analysis", "semester": "Fall of every year", "credits": " 3", "description": "Estimation of construction project costs", "prerequisite": "CMP 315 and CMP 385", "alias": "BCM 415"}, "CMP423": {"name": " Construction Project Management", "semester": "Fall of every year", "credits": " 3", "description": "Construction project management principles and practices. Project start up, administration, and documentation. Project controls.", "prerequisite": "CMP 385 and CMP 311 and (CMP 415 or concurrently)", "restrictions": "Open to seniors in the Construction Management Major or in the Civil Engineering Major or approval of department.", "alias": "BCM 423"}, "CMP435": {"name": " Residential Building and Development Projects (W)", "semester": "Fall of every year", "credits": " 3", "description": "Working in teams, applying skills of construction project management to develop a residential project and business plan that addresses preconstruction, construction, and marketing areas", "prerequisite": "{(ACC 201 and ACC 202) or ACC 230} and ((CMP 423 or concurrently) and completion of Tier I writing requirement)", "restrictions": "Open to seniors in the Construction Management Major.", "alias": "BCM 435"}, "CMP445": {"name": " Green and Energy Efficient Building Construction", "semester": "Spring of every year", "credits": " 3", "description": "Best building practices in building construction, based upon the Leadership in Energy and Environmental Design and National Green Building Standard, and other national programs.", "prerequisite": "CMP 245", "exclude": "CMP 845"}, "CMP453": {"name": " Land Development", "semester": "Fall of every year", "credits": " 3", "description": "Methods and practices of land development, market research, financial feasibility, land use regulations, legal documentation, and site analysis and design. Case studies.", "prerequisite": "(CMP 305 and CMP 325) or UP 458", "restrictions": "Open to juniors or seniors in the College of Agriculture and Natural Resources or in the School of Planning, Design and Construction or in the Construction Management major or in the Civil Engineering Major or in the Urban and Regional Planning major.", "alias": "BCM 353, CMP 353"}, "CMP479": {"name": " Wood and Engineered Composites Science and Technologies", "semester": "Spring of every year", "credits": " 3", "description": "Sciences and technologies governing industrial and manufacturing processes for lumber, engineered wood, and composite wood products.", "prerequisite": "FOR 414 or concurrently"}, "CMP490": {"name": " Independent Study", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 4", "description": "Special problems in acquisition and development of residential land, design, construction technology, building materials, finance, marketing, construction management, or land use codes and regulations.", "restrictions": "Open to undergraduate students in the Construction Management major. Approval of department; application required.", "alias": "BCM 490"}, "CMP491": {"name": " Special Topics in Construction Management", "semester": "Fall of every year, Spring of every year", "credits": "Variable from 1 to 4", "description": "Topics such as computer methods in construction management, construction technology, solar energy, special land use codes, or new technology management.", "restrictions": "Open to undergraduate students in the Construction Management major. Approval of department.", "alias": "BCM 491"}, "CMP492": {"name": " Capstone Project Competitions", "semester": "Fall of every year", "credits": " 3", "description": "Process, evaluation, bidding, procurement, value engineering, and management through simulated construction projects within the context of construction competitions. Field trips may be required.", "prerequisite": "CMP 385 and CMP 311 or approval of school", "restrictions": "Open to seniors in the Construction Management major."}, "CMP493": {"name": " Professional Internship in Construction Management", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": " 3", "description": "Supervised professional experiences in agencies and businesses related to a student's major field of study.", "restrictions": "Open to students in the Construction Management major. Approval of department; application required. A student may earn a maximum of 6 credits in all enrollments for any or all of these courses", "alias": "BCM 493"}, "CMP801": {"name": " Construction, Building, and Energy Systems", "semester": "Fall of every year", "credits": " 3", "description": "Construction, building, and energy systems in the U.S. including steel and wood construction and mechanical, electrical, and plumbing systems.", "restrictions": "Open to graduate students in the School of Planning, Design and Construction or in the Civil Engineering Major or approval of department."}, "CMP811": {"name": " Advanced Project Scheduling", "semester": "Fall of every year", "credits": " 3", "description": "Critical path analysis for effective and logical scheduling of construction projects. Identification of project activities and their relationships. Schedule development, analysis, and updating. Relationship of project costs and resources to the schedule. Effective communication of schedule information.", "alias": "BCM 811"}, "CMP815": {"name": " Advanced Cost Estimating and Analysis", "semester": "Fall of every year", "credits": " 3", "description": "Advanced estimation of construction project costs"}, "CMP817": {"name": " Construction Project Management and Information Systems", "semester": "Spring of every year", "credits": " 3", "description": "Construction project administration, project controls, information generation and utilization for the management of construction projects. Integration of construction management software, and knowledge-based models.", "alias": "BCM 817", "exclude": "CMP 423"}, "CMP822": {"name": " Contracts and Legal Issues in Construction", "semester": "Spring of every year", "credits": " 3", "description": "Construction contracts and documents. Application of Michigan and federal case law to construction and development claims and litigation.", "restrictions": "Open to master's students or doctoral students in the Construction Management major or in the Interior Design and Facilities Management major or in the Civil Engineering major or in the Master in Urban and Regional Planning."}, "CMP828": {"name": " Advanced Virtual Design and Construction", "semester": "Fall of every year", "credits": " 3", "description": "Advanced mechanisms, applications, and practices of virtual design and construction (VDC) in the construction management using Building Information Modeling (BIM) technology.", "restrictions": "Open to graduate students in the School of Planning, Design and Construction or approval of department."}, "CMP831": {"name": " Lean Construction Principles and Methods", "semester": "Spring of every year", "credits": " 3", "description": "Origins and elements of lean production. Principles of lean construction. Production management. Project and production computer simulation. Last Planner System. Work structuring."}, "CMP845": {"name": " Advanced Green and Energy Efficient Building Construction", "semester": "Spring of every year", "credits": " 3", "description": "Best building practices in building construction, based upon the Leadership in Energy and Environmental Design and National Green Building Standard, and other national standards; basic understanding on building energy modeling.", "restrictions": "Open to graduate students in the School of Planning, Design and Construction or in the Civil Engineering Major. Approval of department.", "exclude": "CMP 445"}, "CMP890": {"name": " Special Problems", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 9", "description": "Individual study in land acquisition and development, design, construction, management, finance, marketing, and structural analysis.", "restrictions": "Open to graduate students in the College of Agriculture and Natural Resources. Approval of department; application required.", "alias": "BCM 890"}, "CMP891": {"name": " Advanced Topics in Building Construction Management", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 4", "description": "Advanced topics in building construction management.", "restrictions": "Open only to graduate students in College of Agriculture and Natural Resources. Approval of department.", "alias": "BCM 891"}, "CMP893": {"name": " Elements and Methods of Research for Built Environment", "semester": "Spring of every year", "credits": " 3", "description": "Current areas and topics of research in built environment. Responsible conduct of research. Techniques to search for, analyze, and synthesize published literature. Critical analysis of existing research. Development of a preliminary proposal. Verbal and written communication of technical information.", "restrictions": "Open to graduate students in the School of Planning, Design and Construction or in the Civil Engineering Major or approval of department.", "alias": "CMP 892, BCM 892"}, "CMP898": {"name": " Master's Research", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 3", "description": "Master's degree research paper.", "restrictions": "Open only to master's students in the Construction Management major.", "alias": "BCM 898"}, "CMP899": {"name": " Master's Thesis Research", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 10", "description": "Master's thesis research.", "restrictions": "Open only to master's students in the Construction Management major.", "alias": "BCM 899"}}}