{"code": "CSS", "name": "Crop and Soil Sciences", "courses": {"CSS101": {"name": " Introduction to Crop Science", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Principles of crop production including integrated crop management. Sustainable agriculture. International agriculture. Environmental challenges to crop production.", "restrictions": "Open to undergraduate students or agricultural technology students."}, "CSS101L": {"name": " Introduction to Crop Science Laboratory", "semester": "Fall of every year", "credits": " 1", "description": "Identification of crops, seeds, plant structures; plant nutrient deficiency symptoms; crop growth stages and environmental stresses including pests, nutrients, drought, and temperature. Field trips required.", "prerequisite": "CSS 101 or concurrently", "restrictions": "Open to undergraduate students or agricultural technology students."}, "CSS105": {"name": " Agricultural Industries Seminar", "semester": "Fall of every year", "credits": " 1", "description": "Preparation for academic and professional success. Introduction to opportunities in the agriculture industry.", "restrictions": "Open to agricultural technology students in the Agricultural Industries Major.", "alias": "AEE 105"}, "CSS110": {"name": " Computer Applications in Agronomy", "semester": "Fall of every year", "credits": " 2", "description": "Use of computers in agriculture. Basic computer operating systems. Management and use of storage media. Laboratory experience in word processing, spreadsheets, databases, programming languages, networking, and software related to agriculture.", "restrictions": "Open to undergraduate students or agricultural technology students in the College of Agriculture and Natural Resources.", "exclude": "CSE 101"}, "CSS120": {"name": " Issues in Food and Agriculture", "semester": "Fall of every year", "credits": " 3", "description": "Current and historical issues impacting food and agriculture.", "restrictions": "Open to undergraduate students or agricultural technology students."}, "CSS124": {"name": " Introduction to Sustainable Agriculture and Food Systems", "semester": "Fall of every year, Spring of every year", "credits": " 2", "description": "Contemporary research and movements involving agricultural and food system sustainability. Socio-cultural factors influencing food and agriculture.", "restrictions": "Open to undergraduate students or agricultural technology students."}, "CSS126": {"name": " Introduction to Weed Management", "semester": "Fall of every year", "credits": " 2", "description": "Biology, identification, and management of weeds.", "prerequisite": "CSS 101 or CSS 232 or HRT 109", "restrictions": "Open to students in the Institute of Agricultural Technology.", "alias": "CSS 156"}, "CSS135": {"name": " Crop Scouting and Investigation", "semester": "Spring of every year", "credits": " 3", "description": "Crop scouting and agricultural clientele interactions for improved crop management. Offered first ten weeks of semester.", "prerequisite": "CSS 101 or HRT 203", "restrictions": "Open to undergraduate students or agricultural technology students."}, "CSS143": {"name": " Introduction to Soil Science", "semester": "Fall of every year, Spring of every year", "credits": " 2", "description": "S oil and its impact on plant growth, plant and water relations, drainage, nutrients, soil as a resource, and erosion control techniques.", "restrictions": "Open to agricultural technology students in the Institute of Agricultural Technology.", "exclude": "CSS 210"}, "CSS151": {"name": " Seed and Grain Quality", "semester": "Spring of every year", "credits": " 2", "description": "Principles and practices of producing, conditioning, testing and marketing field crop seed. Grain grading and quality evaluation. Offered first ten weeks of semester.", "restrictions": "Open to undergraduate students or agricultural technology students.", "alias": "CSS 051"}, "CSS171": {"name": " Operations Budgeting for Golf Course Managers", "semester": "Spring of every year", "credits": " 2", "description": "Budgeting. Financial analysis. Purchasing and materials management for golf course operations. Offered first ten weeks of semester.", "alias": "CSS 071"}, "CSS178": {"name": " Turfgrass Irrigation", "semester": "Spring of every year", "credits": " 3", "description": "Turfgrass irrigation systems. Installation and maintenance including water management. Offered first ten weeks of semester.", "prerequisite": "CSS 232"}, "CSS181": {"name": " Pesticide and Fertilizer Application Technology", "semester": "Spring of every year", "credits": " 3", "description": "Effective and efficient application of pesticides and fertilizers to turf and ornamentals. Pesticide handling, legal, and environmental concerns. Calibration of equipment. Offered first ten weeks of semester.", "alias": "CSS 081"}, "CSS192": {"name": " Professional Development Seminar I", "semester": "Fall of every year", "credits": " 1", "description": "Career development, critical issues analysis, resume writing, scientific presentations and public speaking in crop and soil sciences.", "restrictions": "Open to students in the Department of Plant, Soil and Microbial Sciences."}, "CSS201": {"name": " Forage Crops", "semester": "Fall of every year", "credits": " 3", "description": "Forage crop production, management, and utilization; crop identification; soil fertilization; planting and harvesting of grasses and legumes.", "restrictions": "Open to undergraduate students or agricultural technology students."}, "CSS202": {"name": " World of Turf", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": " 2", "description": "Role of turf in society and the environment. Principles underlying establishment and maintenance of turf on athletic fields, parks, home lawns, and golf courses. Aesthetic, safety, and economic aspects of turfgrass management practices.", "exclude": "CSS 232"}, "CSS202L": {"name": " World of Turf Lab", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": " 1", "description": "Turfgrass identification. Site analysis and recommendations. On campus facility and venue visits. Mowing equipment and practices. Turf establishment. Soil cultivation and amendments. Fertilizer and pest management. Field trips required.", "prerequisite": "CSS 202 or concurrently", "exclude": "CSS 232"}, "CSS210": {"name": " Fundamentals of Soil Science", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Agricultural and natural resource ecosystems", "restrictions": "Open to undergraduate students or agricultural technology students."}, "CSS212": {"name": " Advanced Crop Production", "semester": "Fall of every year", "credits": " 2", "description": "Systems approach to production of field crops including corn, soybeans, small grains, sugar beets, and dry beans.", "prerequisite": "CSS 101", "restrictions": "Open to undergraduate students or agricultural technology students."}, "CSS222": {"name": " New Horizons in Biotechnology", "semester": "Fall of every year", "credits": " 2", "description": "Perspectives on biotechnology for safer food production, environmental quality, and improved human health. Impacts of biotechnology on the national economy. Political and ethical ramifications of applied biotechnology.", "restrictions": "Open to undergraduate students or agricultural technology students."}, "CSS224": {"name": " Sustainable Farm and Food Systems Field Studies", "semester": "Fall of every year", "credits": " 1", "description": "Field visits to farm and food system operations that utilize sustainable practices in Michigan. Offered first half of semester.", "prerequisite": "CSS 124", "restrictions": "Not open to freshmen or agricultural technology students."}, "CSS226L": {"name": " Weed Science Laboratory", "semester": "Fall of every year", "credits": " 1", "description": "Weed and weed seed collection and identification. Mechanical and chemical tools involved in managing weeds. Herbicide application and calibration. Weed and crop selectivity, crop injury symptoms.", "prerequisite": "((CSS 126 or concurrently) or (CSS 326 or concurrently)) and (CSS 101 or CSS 232 or HRT 203 or HRT 109)", "alias": "CSS 156, CSS 302, CSS 402"}, "CSS232": {"name": " Turfgrass Management", "semester": "Fall of every year", "credits": " 4", "description": "Turfgrass utilization, identification, establishment and management principles. Responses to various cultural practices.", "prerequisite": "CSS 210 or concurrently"}, "CSS251": {"name": " Organic Farming Principles and Practices", "semester": "Spring of every year", "credits": " 3", "description": "History and principles of organic farming. Farms as ecological systems. Certification process and agencies. Organic matter management, the soil food web, and nutrient availability. Biodiversity, crop rotations, plant competition, ground cover, and plant health. Integrating crops and animals. Organic animal husbandry. Field trip required."}, "CSS262": {"name": " Turfgrass Management Seminar", "semester": "Fall of every year", "credits": " 1", "description": "Presentations by turf students and industry professionals. Topics include internship experiences, technical expertise, and keys to successful career pathways.", "prerequisite": "CSS 232 or concurrently"}, "CSS264": {"name": " Golf Course Design and Construction Techniques", "semester": "Fall of every year", "credits": " 2", "description": "Concepts and theory of golf course design and construction including location, space, topography, clientele, and environmental concerns.", "prerequisite": "CSS 210 and CSS 232 and CSS 267", "alias": "CSS 164"}, "CSS267": {"name": " Performance Turf Design and Construction", "semester": "Spring of every year", "credits": " 2", "description": "Performance turfgrass design, construction, renovation and establishment principles.", "prerequisite": "CSS 232"}, "CSS269": {"name": " Turfgrass Strategies: Integration and Synthesis", "semester": "Spring of every year", "credits": " 2", "description": "Issues in turfgrass management including employee relations, cultural, and environmental problems. Offered first ten weeks of semester.", "prerequisite": "CSS 232 and CSS 267"}, "CSS272": {"name": " Turfgrass Soil Fertility", "semester": "Spring of every year", "credits": " 2", "description": "Soil-plant relationships, soil acidity and alkalinity, macro- and micro-nutrients, fertilizer materials, soil fertility, evaluations, and fertilizer programming. Offered first ten weeks of semester.", "alias": "CSS 044, CSS 342"}, "CSS282": {"name": " Turfgrass Physiology", "semester": "Spring of every year", "credits": " 2", "description": "Physiological principles of turfgrass growth and development. Water relations, light, temperature, respiration, photosynthesis, mineral nutrition, and hormone action. Impact of mowing, cultivation, and traffic on turfgrass growth. Offered first ten weeks of semester.", "prerequisite": "(CSS 232) Completion of Tier I writing requirement.", "alias": "CSS 382, CSS 068, CSS 332"}, "CSS290": {"name": " Independent Study in Crop and Soil Science", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 4", "description": "Field, laboratory, or library research problems.", "restrictions": "Open to students in the Institute of Agricultural Technology. Approval of department; application required.", "alias": "CSS 057"}, "CSS294": {"name": " Issues in International Agriculture", "semester": "Spring of every year", "credits": " 1", "description": "Global issues related to food production, soil resources and sustainability of agriculture in developing and developed countries.", "prerequisite": "Completion of Tier I Writing Requirement", "restrictions": "Open to undergraduate students or agricultural technology students.", "alias": "CSS 494"}, "CSS313": {"name": " Data Interpretation and Writing in the Agronomic Sciences", "semester": "Spring of every year", "credits": " 2", "description": "Data analysis, interpretation, integration, and technical writing in agronomic sciences.", "prerequisite": "(CSS 110 and CSS 210) and (CSS 101 or CSS 232)", "restrictions": "Not open to freshmen."}, "CSS326": {"name": " Weed Science", "semester": "Fall of every year", "credits": " 2", "description": "Weed biology and ecology. Integrated weed management including cultural, mechanical, biological, and chemical control practices. Herbicide mode of action, selectivity in plants, environmental considerations.", "prerequisite": "CSS 101 or CSS 232 or HRT 203", "restrictions": "Not open to students in the Institute of Agricultural Technology.", "alias": "CSS 302, CSS 402"}, "CSS330": {"name": " Soil Chemistry", "semester": "Spring of every year", "credits": " 2", "description": "Organic and inorganic soil processes including mineralogy, adsorption, desorption, and precipitation. Chemistry of soil organic matter and inorganic soil components.", "prerequisite": "CSS 210 and CEM 141"}, "CSS331": {"name": " Water Management in Agriculture and Food Systems", "semester": "Spring of every year", "credits": " 3", "description": "Principles of water management, use efficiency and conservation in agricultural production, natural resources and food processing facilities. Best agricultural water management practices, water rights, irrigation scheduling, irrigation systems selection, evaluation and management and drainage principles. Large scale water use, management and conservation in food processing.", "prerequisite": "MTH 103 or MTH 124 or MTH 132 or LB 118", "alias": "TSM 431"}, "CSS340": {"name": " Applied Soil Physics", "semester": "Spring of every year", "credits": " 2", "description": "Soil physical properties including solids, water, air, and heat. Transport processes in soil.", "prerequisite": "CSS 210"}, "CSS343": {"name": " Principles of Precision Agriculture", "semester": "Fall of every year", "credits": " 3", "description": "Global positioning systems (GPS), yield monitors, and computer software. Analysis and interpretation of field maps. Variable-rate application. Economics of precision agriculture.", "prerequisite": "MTH 103 or MTH 114 or MTH 116 or MTH 124 or MTH 132"}, "CSS350": {"name": " Introduction to Plant Genetics", "semester": "Spring of every year", "credits": " 3", "description": "Fundamentals of plant genetics with applications to agriculture and natural resources.", "prerequisite": "PLB 105 or BS 161", "restrictions": "Not open to freshmen."}, "CSS360": {"name": " Soil Biology", "semester": "Fall of every year", "credits": " 3", "description": "Overview of organismal diversity and biological soil processes. Role of macroorganisms and microorganisms in soil processing, including nutrient cycling.", "prerequisite": "CSS 210"}, "CSS424": {"name": " Sustainable Agriculture and Food Systems: Integration and Synthesis", "semester": "Fall of every year", "credits": " 3", "description": "Biogeochemical and socio-economic aspects of food, fiber, and fuel production. Environmental impacts and social context. Experiential learning projects.", "prerequisite": "CSS 124 and (CSS 224 or concurrently)", "restrictions": "Open to juniors or seniors or graduate students."}, "CSS425": {"name": " Microbial Ecology", "semester": "Spring of every year", "credits": " 3", "description": "Microbial population and community interactions. Microbial activities in natural systems, including associations with plants or animals.", "alias": "MPH 425"}, "CSS431": {"name": " International Agricultural Systems", "semester": "Spring of every year", "credits": " 3", "description": "World production capacity for food, fiber and biofuel as related to soil, biology and climatic resources. Principles and case studies of sustainable systems presented from developing and developed countries. Emerging issues in agricultural globalization and biodiversity.", "prerequisite": "(ANR 250 or ISS 310 or ISS 315 or ISS 318 or ISS 320 or ISS 330A or ISS 330B or ISS 330C or ISS 336) and completion of Tier I writing requirement", "restrictions": "Not open to freshmen."}, "CSS441": {"name": " Plant Breeding and Biotechnology", "semester": "Spring of even years", "credits": " 3", "description": "Plant improvement by genetic manipulation. History of plant breeding. Traditional and biotechnological means of improving plant cultivars by genetic manipulation. Importance of plant breeding to our food system, economy, and environment.", "prerequisite": "(CSS 350 or concurrently) or (IBIO 341 or concurrently)"}, "CSS442": {"name": " Agricultural Ecology", "semester": "Fall of every year", "credits": " 3", "description": "Ecological principles in the design and management of agricultural ecosystems. Integration of ecological factors regulating crop and rangeland productivity.", "restrictions": "Open to juniors or seniors or graduate students."}, "CSS445": {"name": " Evolution (W)", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": " 3", "description": "Processes of evolutionary change in animals, plants. Microbes. Population genetics, microevolution, speciation, adaptive radiation, macroevolution. Origin of Homo sapiens.", "prerequisite": "(IBIO 341 or CSS 350) and completion of Tier I writing requirement", "restrictions": "Not open to freshmen.", "alias": "ZOL 345, ZOL 445"}, "CSS451": {"name": " Biotechnology Applications for Plant Breeding and Genetics", "semester": "Spring of every year", "credits": " 3", "description": "Principles, concepts, and techniques of agricultural plant biotechnology. Recombinant DNA technology, plant molecular biology and transformation in relation to plant improvement.", "prerequisite": "CSS 350 or IBIO 341", "restrictions": "Open to juniors or seniors or graduate students."}, "CSS452": {"name": " Watershed Concepts", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": " 3", "description": "Watershed hydrology and management. The hydrologic cycle, water quality, aquatic ecosystems, and social systems. Laws and institutions for managing water resources.", "alias": "ESA 452, RD 452, CSUS 452"}, "CSS455": {"name": " Environmental Pollutants in Soil and Water", "semester": "Spring of every year", "credits": " 3", "description": "Environmental sources, physiochemical and biological processes, management of plant nutrients, heavy metals, organic contaminants, pesticides and pharmaceuticals in soil and water.", "prerequisite": "CEM 143 or CEM 251", "restrictions": "Open to juniors or seniors or graduate students."}, "CSS461": {"name": " Seminar in Plant, Animal and Microbial Biotechnology", "semester": "Spring of every year", "credits": " 1", "description": "Current applications of plant, animal and microbial biotechnology in agriculture and related industries. Technologies under development and factors associated with moving from laboratory to product development. Field trips required.", "prerequisite": "(ANS 425 or concurrently) or (BE 360 or concurrently) or (CSS 451 or concurrently) or (MMG 445 or concurrently)"}, "CSS464": {"name": " Statistics for Biologists", "semester": "Fall of every year", "credits": " 3", "description": "Biological random variables. Estimation of population parameters. Testing hypotheses. Linear correlation and regression. Analyses of counted and measured data to compare several biological groups including contingency tables and analysis of variance.", "prerequisite": "MTH 103 or MTH 110 or MTH 116 or MTH 132"}, "CSS467": {"name": " BioEnergy Feedstock Production", "semester": "Fall of every year", "credits": " 3", "description": "Agronomic, economic, technological, and environmental principles involved in bioenergy feedstock production. Cultivation, harvest, transportation, and storage of agricultural and forest biomass.", "prerequisite": "MTH 103 or MTH 116 or MTH 124 or MTH 132 or LB 118 or MTH 152H or MTH 133 or MTH 153H or LB 119"}, "CSS470": {"name": " Soil Resources", "semester": "Fall of every year", "credits": " 3", "description": "Evaluation of the properties, genesis, and classification of soil resources to assist in making land-use decisions.", "prerequisite": "CSS 210", "restrictions": "Not open to freshmen or sophomores."}, "CSS477": {"name": " Pesticides in Pest Management", "semester": "Fall of even years", "credits": " 3", "description": "Chemistry, modes of action, product development and regulation of pesticides. Environmental and social aspects of pesticide use.", "restrictions": "Open to juniors or seniors or graduate students."}, "CSS480": {"name": " Soil Fertility and Management", "semester": "Fall of every year", "credits": " 3", "description": "Comprehensive management of agricultural soils. Soil fertility, including liming and fertilizer materials and other nutrient sources. Site specific soil management. Environmental impacts including soil erosion, runoff, and organic matter mineralization.", "prerequisite": "CSS 210 and (CSS 330 or CSS 340 or CSS 360 or (CSS 470 or concurrently))", "restrictions": "Open to seniors in the Agronomy minor or in the Crop and Soil Sciences major."}, "CSS486": {"name": " Biotechnology in Agriculture: Applications and Ethical Issues", "semester": "Fall of even years", "credits": " 3", "description": "Current and future roles of biotechnology in agriculture", "prerequisite": "BS 161 or PLB 105", "restrictions": "Not open to freshmen or sophomores."}, "CSS488": {"name": " Agricultural Cropping Systems: Integration and Problem Solving", "semester": "Spring of every year", "credits": " 3", "description": "Integration and synthesis of agronomic and related concepts in agricultural cropping systems. Problem solving and application of information.", "prerequisite": "(CSS 101 and CSS 210) and completion of Tier I writing requirement.", "restrictions": "Open to seniors in the Agronomy minor or in the Crop and Soil Sciences major."}, "CSS490": {"name": " Independent Study", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 4", "description": "Individual work on field, laboratory, or library research problem of special interest to the student.", "prerequisite": "CSS 101 or CSS 210", "restrictions": "Approval of department; application required."}, "CSS491": {"name": " Special Topics", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 4", "description": "Topics from crop production, crop physiology, turfgrass management, organic soils, turfgrass soils, soil fertility, plant and soil relationships, genetics, biotechnology, environmental science, or sustainable agriculture.", "prerequisite": "CSS 101 or CSS 210"}, "CSS492": {"name": " Professional Development Seminar II", "semester": "Fall of every year", "credits": " 1", "description": "Synthesis, integration and application of agronomic principles to current issues in agronomy via discussion and oral and written communication.", "prerequisite": "(CSS 192 or CSS 262) and (CSS 210 and completion of Tier I Writing requirement)", "restrictions": "Open to seniors in the Department of Plant, Soil and Microbial Sciences."}, "CSS493": {"name": " Professional Internship in Crop and Soil Sciences", "semester": "Summer of every year", "credits": " 3", "description": "Supervised professional experiences in crop and soil sciences.", "prerequisite": "Completion of Tier I Writing Requirement", "restrictions": "Approval of department; application required. A student may earn a maximum of 6 credits in all enrollments for any or all of these courses"}, "CSS499": {"name": " Undergraduate Research", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": " 3", "description": "Faculty supervised research in a selected area of crop and soil sciences or environmental soil science.", "restrictions": "Approval of department; application required."}, "CSS802": {"name": " Weed Biology", "semester": "Spring of even years", "credits": " 2", "description": "Weed biology, including weed seed production and dispersal and seed fate. Weed life history traits and ecophysiology, including invasive species. Data collection in weed ecology research."}, "CSS805": {"name": " Herbicide Action and Metabolism", "semester": "Spring of odd years", "credits": " 2", "description": "Properties and characteristics of herbicides. Processes involved in herbicide action, transport, and fate in plants and soils."}, "CSS814": {"name": " Advanced Statistics for Biologists", "semester": "Spring of every year", "credits": " 4", "description": "Concepts of reducing experimental error for biological and agricultural research. Covariance, randomized block designs, latin squares, split plots, repeated-measures designs, regression applications, and response surface designs. Analyses using statistical software."}, "CSS819": {"name": " Advanced Plant Breeding", "semester": "Fall of even years", "credits": " 3", "description": "Genetic expectations resulting from breeding strategies with cross- and self-pollinated crop plants. Germplasm collections, mapping populations, and modifications of reproductive biology useful for crop improvement."}, "CSS820": {"name": " Plant Reproductive Biology and Polyploidy", "semester": "Spring of odd years", "credits": " 1", "description": "Genetic processes underlying variations in plant reproductive biology and polyploidy. Utilization of these characteristics in plant breeding."}, "CSS840": {"name": " Soil Physics", "semester": "Fall of odd years", "credits": " 3", "description": "Physical properties of soil including texture, structure, consistency, aeration, moisture content, and temperature. Quantitative measurement of plant growth. Agronomic and engineering practices.", "restrictions": "Open to graduate students in the College of Agriculture and Natural Resources or in the College of Engineering or in the College of Natural Science."}, "CSS846": {"name": " Integrated Climate and Cropping System Modeling", "semester": "Spring of odd years", "credits": " 3", "description": "Crop simulation modeling for water and nutrient use under resource limitations and varying climatic conditions."}, "CSS850": {"name": " Soil Chemistry", "semester": "Spring of every year", "credits": " 3", "description": "Ion activities, ionic exchange and equilibrium reactions. Soil pH, macro- and micronutrients, saline soils and availability of nutrients to plants.", "restrictions": "Open to graduate students in the College of Agriculture and Natural Resources or in the College of Engineering or in the College of Natural Science."}, "CSS853": {"name": " Plant Mineral Nutrition", "semester": "Fall of odd years", "credits": " 3", "description": "Inorganic ion transport in plant cells and tissues. Physiological responses and adaptation to problem soils. Genetic diversity in nutrient uptake and use by plants. Physiological roles of elemental nutrients in crop growth."}, "CSS863": {"name": " Mineral-Water Interactions", "semester": "Fall of even years", "credits": " 4", "description": "Mineralogy, petrology and geochemistry of fluid-rock reactions in geologic, sedimentary and geochemical cycles. Rock and mineral weathering, soil formation, genesis and burial diagenesis of sediments and sedimentary rocks, and metamorphism.", "restrictions": "Open only to graduate students in the Department of Crop and Soil Sciences or Department of Geological Sciences or Department of Geography."}, "CSS865": {"name": " Environmental Fate of Organic Contaminants in Soils", "semester": "Spring of even years", "credits": " 3", "description": "Chemistry and biology of toxicants in soils as determinants of environmental fate."}, "CSS880": {"name": " Scientific Communication and Professional Development", "semester": "Spring of every year", "credits": " 1", "description": "Interactive professional experiences including grant preproposal preparation and presentation, scientific presentations, mock position interviews, and resume preparation."}, "CSS890": {"name": " Independent Study", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 6", "description": "Individual study on field, laboratory, or library research.", "restrictions": "Open to graduate students in the College of Agriculture and Natural Resources or in the College of Engineering or in the College of Natural Science."}, "CSS891": {"name": " Current Topics in Ecology and Evolution", "semester": "Summer of every year", "credits": "Variable from 1 to 2", "description": "Presentation and critical evaluation of theoretical and empirical developments in ecology and evolutionary biology by visiting scientists.", "alias": "ZOL 891"}, "CSS891B": {"name": " Selected Topics in Plant Breeding and Genetics", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 2", "description": "Selected topics in plant breeding.", "restrictions": "Open only to graduate students in the Plant Breeding and Genetics major or Genetics major. Approval of department."}, "CSS892": {"name": " Plant Breeding and Genetics Seminar", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": " 1", "description": "Experience in review, organization, oral presentation, and analysis of research."}, "CSS892B": {"name": " Ecological Food and Farming Systems Seminar", "semester": "Fall of every year, Spring of every year", "credits": " 1", "description": "Experiential learning, and multidisciplinary and applied research, in ecological food and farming systems."}, "CSS893": {"name": " Selected Topics", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 3", "description": "Selected topics in crop and soil sciences of current interest and importance.", "restrictions": "Open to graduate students in the College of Agriculture and Natural Resources or in the College of Engineering or in the College of Natural Science."}, "CSS899": {"name": " Master's Thesis Research", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 12", "description": "Master's thesis research.", "restrictions": "Open to master's students in the Department of Plant, Soil and Microbial Sciences."}, "CSS941": {"name": " Quantitative Genetics in Plant Breeding", "semester": "Spring of even years", "credits": " 3", "description": "Theoretical and genetic basis of statistical analysis of quantitative traits using genetic markers. Computational tools for the study of quantitative traits."}, "CSS999": {"name": " Doctoral Dissertation Research", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 24", "description": "Doctoral dissertation research.", "restrictions": "Open to doctoral students in the Department of Plant, Soil and Microbial Sciences."}}}