{"code": "CSUS", "name": "Community Sustainability", "courses": {"CSUS124": {"name": " Introduction to Sustainable Agriculture and Food Systems", "semester": "Fall of every year, Spring of every year", "credits": " 2", "description": "Contemporary research and movements involving agricultural and food system sustainability. Socio-cultural factors influencing food and agriculture.", "restrictions": "Open to undergraduate students or agricultural technology students."}, "CSUS200": {"name": " Introduction to Sustainability", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Introduction to sustainability and personal role in sustainability initiatives. Implications of individual actions for key sustainability challenges. Application of sustainability principles and leadership skills in community.", "alias": "RD 200, ESA 200"}, "CSUS207": {"name": " Great Lakes: Biology and Management", "semester": "Spring of every year", "credits": " 3", "description": "Living aquatic resources of the Great Lakes, environmental history, and biological resources and their management. Policy issues."}, "CSUS215": {"name": " International Development and Sustainability", "semester": "Spring of every year", "credits": " 3", "description": "Theories, concepts and themes in international development and sustainability."}, "CSUS221": {"name": " Seminar in Environmental and Sustainability Careers", "semester": "Spring of every year", "credits": " 1", "description": "Societal value of, and opportunities in, environment and sustainability careers. Career planning, including engagement with employers and alumni.", "restrictions": "Open to students in the Environmental Studies and Sustainability Major or approval of department."}, "CSUS222A": {"name": " Seminar in Instructional Theory I - Agriculture, Food and Natural Resources Education", "semester": "Fall of every year", "credits": " 1", "description": "Professional involvement and introductory instructional theory in formal and non formal agriculture, food and natural resources education. Requires 10 hours of observation in a K-12 Ag, Food, and Natural Resource Education (AFNRE) classroom.", "restrictions": "Open to undergraduate students."}, "CSUS222B": {"name": " Seminar in Instructional Theory II - Agriculture, Food and Natural Resources Education", "semester": "Fall of every year", "credits": " 1", "description": "Principles of experiential learning theory in formal and nonformal agriculture, food and natural resources education. Requires 10 hours of observation in a K-12 Ag, Food, and Natural Resource Education (AFNRE) classroom.", "prerequisite": "CSUS 222A"}, "CSUS222C": {"name": " Seminar in Instructional Theory III - Agriculture, Food and Natural Resources Education", "semester": "Fall of every year", "credits": " 1", "description": "Application of problem-based learning theory in formal and nonformal agriculture, food and natural resources education. Requires 10 hours of observation in a K-12 Ag, Food, and Natural Resource Educational (AFNRE) classroom.", "prerequisite": "CSUS 222B"}, "CSUS223A": {"name": " Seminar in Leadership Theory I - Agriculture, Food and Natural Resources Education", "semester": "Spring of every year", "credits": " 1", "description": "Introductory leadership theory in formal and nonformal agriculture, food and natural resources education."}, "CSUS223B": {"name": " Seminar in Leadership Theory II - Agriculture, Food and Natural Resources Education", "semester": "Spring of every year", "credits": " 1", "description": "Practical applications of leadership theory in agriculture, food and natural resources education within Michigan communities.", "prerequisite": "CSUS 223A"}, "CSUS223C": {"name": " Seminar in Leadership Theory III - Agriculture, Food and Natural Resources Education", "semester": "Spring of every year", "credits": " 1", "description": "Applied mentoring and leadership evaluation in formal and nonformal agriculture, food, and natural resources education.", "prerequisite": "CSUS 223B"}, "CSUS224": {"name": " Sustainable Farm and Food Systems Field Studies", "semester": "Fall of every year", "credits": " 1", "description": "Field visits to farm and food system operations that utilize sustainable practices in Michigan. Offered first half of semester.", "prerequisite": "CSS 124", "restrictions": "Not open to freshmen or agricultural technology students."}, "CSUS250": {"name": " Global Issues in Agriculture and Natural Resources", "semester": "Fall of every year", "credits": " 3", "description": "Globalization. Economic, political, and social issues related to natural resources and agricultural production. Historical perspectives and future projections.", "prerequisite": "Completion of Tier I Writing Requirement", "alias": "AEE 301"}, "CSUS259": {"name": " Sustainable Energy and Society", "semester": "Spring of every year", "credits": " 3", "description": "Sustainable fuels and technologies, energy systems, energy transitions, and personal and societal roadblocks to achieving sustainable energy. Energy poverty, justice and decision-making."}, "CSUS265": {"name": " Exploring Environmental and Sustainability Issues and Policy Using Film", "semester": "Spring of every year", "credits": " 3", "description": "Environmental and sustainability issues, themes, and perspectives in feature films and documentaries.", "alias": "ESA 235"}, "CSUS273": {"name": " Introduction to Travel and Tourism", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Overview of the travel and tourism industry. History, scope and management of the tourism system. Tourism demand, destination management, major travel segments, tourism marketing.", "alias": "PRR 214"}, "CSUS276": {"name": " Sustaining Our National Parks and Recreation Lands", "semester": "Spring of every year", "credits": " 3", "description": "Scope, history and management of federal, state and local public recreation lands. Future management options strengthening sustainability. Careers in natural resource recreation.", "alias": "PRR 210, PRR 211"}, "CSUS278": {"name": " Introduction to Conservation, Recreation and Environmental Enforcement", "semester": "Fall of every year", "credits": " 1", "description": "Scope, history and application of conservation, recreation and environmental law enforcement at the international, federal, state and local level. Integration with traditional policing, resource management and public lands. Career opportunities.", "restrictions": "Not open to freshmen."}, "CSUS300": {"name": " Theoretical Foundations of Sustainability", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Foundations of sustainability theory. History and evolution of interdisciplinary thought about sustainability. Principles of systems thinking as applied to complex problems. Application of theory in community systems.", "prerequisite": "((CSUS 200) and completion of Tier I writing requirement) and (EC 201 or EC 202)", "restrictions": "Open to juniors or seniors or approval of department."}, "CSUS301": {"name": " Community Engagement for Sustainability (W)", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Application of principles of change theory, citizenship, sustainability, and community engagement at multiple scales. Public and participatory decision making in diverse contexts. Techniques and skills for community engagement. Examination of personal identities as citizens. Leadership and communication challenges in active practice of engagement.", "prerequisite": "(CSUS 200) and completion of Tier I writing requirement", "restrictions": "Not open to freshmen."}, "CSUS310": {"name": " History of Environmental Thought and Sustainability", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": " 3", "description": "History of attitudes and values associated with the environment, wilderness, environmentalism, conservation, preservation, and sustainability. Perceptions and assessment of modern environmental problems and issues.", "prerequisite": "Completion of Tier I Writing Requirement", "restrictions": "Open to sophomores or juniors or seniors.", "alias": "PRR 302"}, "CSUS320": {"name": " Environmental Planning and Management", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": " 3", "description": "Concepts, principles and objectives of planning and management. Demand, supply and impacts of natural resources use. Suitability assessment for sustainable development and land use planning.", "prerequisite": "Completion of Tier I Writing Requirement", "alias": "ESA 320, RD 320"}, "CSUS322": {"name": " Leadership for Community Sustainability", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Leadership theory, practice, and reflection. Individual and team leadership in the context of community sustainability.", "prerequisite": "Completion of Tier I Writing Requirement", "alias": "ESA 312"}, "CSUS343": {"name": " Community Food and Agricultural Systems", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": " 3", "description": "Food and agricultural systems. Inputs, production, processing, distribution, consumption and disposal. Industrialization, globalization and centralization of power. Community goals including ecological sustainability, social justice, economic viability and democracy.", "prerequisite": "Completion of Tier I Writing Requirement", "alias": "ESA 343"}, "CSUS354": {"name": " Water Resources Management", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Biophysical, community, and institutional components of comprehensive water resources management. Biophysical and social processes that control the quality and quantity of aquatic resources at the watershed level.", "prerequisite": "Completion of Tier I Writing Requirement", "alias": "ESA 324"}, "CSUS418": {"name": " Community Sustainability Study Abroad", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 6", "description": "Study and travel experience emphasizing contemporary problems in sustainability in world, national, and local communities.", "prerequisite": "CSUS 200 or approval of department", "restrictions": "Approval of department; application required.", "alias": "ESA 475"}, "CSUS419": {"name": " International Studies in Community Sustainability", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 6", "description": "Contemporary problems affecting community sustainability outside the United States. Ecological, socio-dynamic, and cultural influences on environmental management. Study-travel experience.", "prerequisite": "CSUS 200 or approval of department", "restrictions": "Not open to freshmen. Approval of department; application required.", "alias": "ESA 480, RD 480"}, "CSUS424": {"name": " Sustainable Agriculture and Food Systems: Integration and Synthesis", "semester": "Fall of every year", "credits": " 3", "description": "Biogeochemical and socio-economic aspects of food, fiber, and fuel production. Environmental impacts and social context. Experiential learning projects.", "prerequisite": "CSS 124 and (CSS 224 or concurrently)", "restrictions": "Open to juniors or seniors or graduate students."}, "CSUS425": {"name": " Environmental Impact Assessment", "semester": "Fall of every year", "credits": " 3", "description": "Environmental impact assessment of proposed and built projects and plans. Regulatory frameworks and implementation issues.", "prerequisite": "((CSUS 200 or CSS 210 or GEO 206 or GLG 201) or approval of department) and completion of Tier I writing requirement", "restrictions": "Open to juniors or seniors in the Department of Community Sustainability or approval of department.", "alias": "ESA 415"}, "CSUS429": {"name": " Program Evaluation for Community Sustainability", "semester": "Fall of every year", "credits": " 3", "description": "Concepts, theories, and procedures in program evaluation. Practical methods and skills to plan and implement evaluations of community, agriculture, and natural resources programs.", "prerequisite": "{{(MTH 103) and (STT 200 or STT 201)} or (MTH 103 and MTH 114) or MTH 116 or MTH 124} and ((CSUS 200 or EEM 255) and completion of Tier I writing requirement)", "alias": "ACR 415"}, "CSUS430": {"name": " Non-Profit Organizational Management for Community Sustainability", "semester": "Fall of every year", "credits": " 3", "description": "Sustainable management and operation of non-profit organizations. Legal foundations, policy, funding, management responsibilities, ethical decision-making and management functions.", "prerequisite": "(CSUS 200 or CSUS 273 or CSUS 276) and completion of Tier I writing requirement", "restrictions": "Open to juniors or seniors or graduate students.", "alias": "CSUS 330, PRR 370"}, "CSUS431": {"name": " Interpretation and Visitor Information Systems", "semester": "Spring of every year", "credits": " 3", "description": "Interpretation principles and practice for nonformal settings, such as community development organizations, parks, museums, zoos, aquaria, nature and visitor centers, and historic sites. Goals and functions of interpretation for community development, visitor and tourist experience enhancement, achievement of resource and visitor management goals. Planning, implementation, and evaluation of interpretive programs for diverse audiences. Information systems and visitor services. National certification optional. Field trips required.", "prerequisite": "((CSUS 200 or CSUS 276) or approval of department) and completion of Tier I writing requirement", "restrictions": "Open to juniors or seniors or graduate students.", "alias": "PRR 451"}, "CSUS433": {"name": " Grant Writing and Fund Development", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Theoretical and practical background for proposal writing. Program and strategic planning. Fund-raising and organizational advancement.", "prerequisite": "Completion of Tier I Writing Requirement", "restrictions": "Open to juniors or seniors or graduate students.", "alias": "ESA 413, RD 313"}, "CSUS445": {"name": " Community-Based Environmental and Sustainability Education", "semester": "Fall of every year", "credits": " 3", "description": "Methods, materials and theory for non-formal environmental and sustainability education. Focuses on non-profit and agency education programming in conservation, food systems, parks and recreation, and community engagement and outreach. Consideration of relationships among non-formal, informal and K-12 education systems. Field trips required.", "prerequisite": "(CSUS 200 or approval of department) and completion of Tier I writing requirement", "restrictions": "Open to juniors or seniors or graduate students.", "alias": "ESA 435"}, "CSUS446": {"name": " Environmental Issues and Public Policy", "semester": "Fall of every year", "credits": " 3", "description": "Interrelationship of science and public policy in resolving environmental issues. Technical, social, economic, and legal influences. Case study approach.", "restrictions": "Not open to freshmen or sophomores.", "alias": "ZOL 446"}, "CSUS447": {"name": " Community Economic Development", "semester": "Spring of every year", "credits": " 3", "description": "Theories, frameworks, policies, concepts, principles, models, and skills for community economic development. Community participation in local development initiatives.", "prerequisite": "EC 201 or EC 202", "alias": "ESA 470, RD 470"}, "CSUS453": {"name": " Watershed Planning and Management", "semester": "Spring of every year", "credits": " 3", "description": "Foundations of watershed planning and management in the United States. Physical, chemical and socioeconomic conditions; legal, financial and institutional dimensions; management alternatives; stakeholders; educational campaigns; evaluation.", "prerequisite": "CSUS 354"}, "CSUS463": {"name": " Food Fight: Politics of Food", "semester": "Spring of odd years", "credits": " 3", "description": "Social power and its influence in US agrifood system. Structural and cultural issues related to politics of food consumption, production, labor, processing, retail, techno-science, policy, resistance movements.", "prerequisite": "CSUS 200 or SOC 100", "restrictions": "Not open to freshmen or sophomores."}, "CSUS464": {"name": " Environmental and Natural Resource Policy in Michigan", "semester": "Spring of every year", "credits": " 3", "description": "State legislative process and its role in environmental and natural resource policy formulation. Influence of lobbying, citizen engagement and political factors.", "prerequisite": "CSUS 200 or EEM 255 or approval of department", "alias": "ESA 440, RD 440"}, "CSUS465": {"name": " Environmental and Natural Resource Law", "semester": "Fall of every year", "credits": " 3", "description": "Legal principles and process related to the environment and natural resources. Common law, constitutional law, statutory and administrative law.", "prerequisite": "CSUS 200 or EEM 255", "restrictions": "Open to juniors or seniors or graduate students.", "alias": "ESA 430, RD 430"}, "CSUS473": {"name": " Social Entrepreneurship and Community Sustainability", "semester": "Spring of every year", "credits": " 3", "description": "Start-up and management of private sector, non-profit, and public organizations. Identifying and overcoming the challenges associated with the sustainable operations of small organizations.", "prerequisite": "(CSUS 200 or CSUS 273) and completion of Tier I writing requirement", "restrictions": "Open to juniors or seniors or graduate students.", "alias": "PRR 473"}, "CSUS474": {"name": " Advanced Topics in Tourism Management", "semester": "Spring of every year", "credits": " 3", "description": "Tourism as a form of economic and community development. Tourism planning, marketing and management. Tourism and sustainability. Tourism research.", "prerequisite": "CSUS 273 or HB 100 or GEO 259", "restrictions": "Open to juniors or seniors or graduate students.", "alias": "PRR 474"}, "CSUS476": {"name": " Natural Resource Recreation Management", "semester": "Fall of every year", "credits": " 4", "description": "Natural resource recreation management principles, tools and models. Applications to trail, camping, watercraft and dispersed recreation settings. Security of visitors, resources and facilities. Case studies and integrated problem solving. Offered first half of semester.", "prerequisite": "(CSUS 276 or FOR 101 or FOR 202 or FW 101) and completion of Tier I writing requirement", "restrictions": "Open to juniors or seniors or graduate students.", "alias": "PRR 448"}, "CSUS489": {"name": " Seminar in Zoo and Aquarium Science", "semester": "Fall of every year, Spring of every year", "credits": " 1", "description": "Scientific writing and oral presentations related to zoo and aquarium studies.", "restrictions": "Approval of department.", "alias": "ZOL 489"}, "CSUS490": {"name": " Independent Study in Community Sustainability", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 4", "description": "Individual supervised study of selected topics", "restrictions": "Approval of department; application required.", "alias": "ACR 490, ESA 490, PRR 490"}, "CSUS491": {"name": " Special Topics in Community Sustainability", "semester": "On Demand", "credits": "Variable from 1 to 4", "description": "Selected issues in community sustainability derived from current and emerging topics of interest.", "restrictions": "Open to juniors or seniors.", "alias": "ACR 491, ESA 491, PRR 491"}, "CSUS493": {"name": " Professional Internship in Community Sustainability", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 3 to 6", "description": "Off campus supervised capstone professional experience in an organization related to student’s major in the Department of Community Sustainability", "prerequisite": "(CSUS 200) and completion of Tier I writing requirement", "restrictions": "Open to seniors in the Department of Community Sustainability. Approval of department; application required. A student may earn a maximum of 6 credits in all enrollments for any or all of these courses", "alias": "ESA 493, PRR 493"}, "CSUS800": {"name": " Foundations of Community Sustainability I", "semester": "Fall of every year", "credits": " 3", "description": "Theoretical and conceptual foundations of community sustainability. Sustainability practice. Introduction to ethics and community engagement for sustainability. Field trips required.", "restrictions": "Open to graduate students in the Department of Community Sustainability.", "alias": "ACR 800"}, "CSUS801": {"name": " Foundations of Community Sustainability II", "semester": "Spring of every year", "credits": " 3", "description": "Applications of sustainability science and systems thinking for community engagement. Boundary-crossing and organizations. Social change. Sustainability ethics. Facilitation of participatory community processes. Participatory virtues for sustainability. Group dynamics in interdisciplinary and community contexts.", "prerequisite": "CSUS 800", "restrictions": "Open to graduate students in the Department of Community Sustainability."}, "CSUS802": {"name": " Introduction to Interdisciplinary Inquiry", "semester": "Fall of every year", "credits": " 3", "description": "Interdisciplinary, multidisciplinary and transdisciplinary research design. Community engagement as related to research and inquiry. Practical skills for developing inquiry projects.", "restrictions": "Open to graduate students in the Department of Community Sustainability.", "alias": "ACR 802"}, "CSUS805": {"name": " Proposal Development for Interdisciplinary Inquiry", "semester": "Spring of every year", "credits": " 1", "description": "Preparation of proposals for inquiry in practical and research settings. Application of inquiry concepts and practices in designing projects or research. Professional oral and written communications in sustainability inquiry. Processes of peer support and critique. Offered first ten weeks of semester.", "prerequisite": "CSUS 800 and CSUS 802", "restrictions": "Open to graduate students in the Department of Community Sustainability."}, "CSUS811": {"name": " Community, Food and Agriculture: A Survey", "semester": "Fall of every year", "credits": " 3", "description": "Philosophical, socio-economic, health and political issues related to food and farming in the United States.", "alias": "ACR 811"}, "CSUS814": {"name": " Sustainable Tourism and Protected Area Management: Theories and Applications", "semester": "Fall of odd years", "credits": " 3", "description": "Historical antecedents and current concepts of leisure, travel, and tourism. Tourism theory and applications.", "alias": "ACR 814, PRR 874"}, "CSUS816": {"name": " Environmental Design Theory", "semester": "Fall of every year", "credits": " 3", "description": "Differences between normative theories, scientific theories, models, and constructs. Exploration of normative theories related to thesis or practicum."}, "CSUS823": {"name": " Contemporary Issues in Animal-Human Relationships", "semester": "Fall of even years", "credits": " 3", "description": "Contemporary issues in animal-human relationships, including agriculture and food systems, local communities, and enclosed parks. Nature as a fluid network of relations including humans, nonhumans, and technologies.", "alias": "ACR 823"}, "CSUS824": {"name": " Sustainable Development", "semester": "Spring of odd years", "credits": " 3", "description": "Measurement of social and economic welfare at national and local scales. Consumption and economic growth as welfare indicators. Theories of development, utility, and economic growth. Indicators of sustainable development. Environmental and social dimensions of human well-being.", "alias": "ACR 824"}, "CSUS826": {"name": " International Development: Theory and Practice", "semester": "Spring of every year", "credits": " 3", "description": "Evolution of international development theory across disciplines. Changing conceptualizations, measurements, processes and effects of development and poverty. Ethnicity, social class, gender, and community influences on socioeconomic processes. Current issues, concerns, and strategic alternatives.", "alias": "ACR 826, RD 826"}, "CSUS829": {"name": " Economics of Environmental Resources", "semester": "Spring of every year", "credits": " 3", "description": "Economic principles, theoretical models, and empirical methods related to environmental problems and policy interventions. Applications to air, land, water, forests, energy, fish and wildlife, and climate change, including in developing countries.", "alias": "AEC 829"}, "CSUS831": {"name": " Foundations of Qualitative Research", "semester": "Spring of every year", "credits": " 5", "description": "Qualitative project design. Relationship of epistemology to theory, methodology, and method. Collection and analysis of qualitative data. Project-based. In-depth interviews, focus groups, observation, memos, coding displays, report writing.", "alias": "RD 812, ACR 831"}, "CSUS833": {"name": " Program Evaluation in Agriculture and Natural Resources", "semester": "Spring of every year", "credits": " 3", "description": "Concepts, theories, procedures and applications of program evaluation. Planning and implementing evaluations of food, agriculture and natural resources programs. Logic models, evaluation plans and instruments, data analysis and written reports.", "alias": "ACR 833"}, "CSUS834": {"name": " Survey Research and Design", "semester": "Spring of every year", "credits": " 3", "description": "Theory and practice of designing and conducting surveys in the study of community sustainability.", "restrictions": "Open to graduate students or approval of department."}, "CSUS836": {"name": " Modeling Natural Resource Systems", "semester": "Spring of every year", "credits": " 3", "description": "System dynamics modeling in human-environment systems. Sustainability applications, including renewable and non-renewable resource use, greenhouse gas emissions and climate change, pollutants and limits to growth.", "alias": "ACR 851, CSUS 851"}, "CSUS838": {"name": " Participatory Modes of Inquiry", "semester": "Fall of every year", "credits": " 3", "description": "Participatory and action research literature across the disciplines. Epistemological and theoretical foundations, fields of application, points of emphasis for practice. Skill building in reflexivity, surfacing assumptions, dialogue, and active listening.", "alias": "ACR 838"}, "CSUS848": {"name": " Community Based Natural Resource Management in International Development", "semester": "Spring of every year", "credits": " 3", "description": "Community-based natural resource management in developing countries. Determinants of conservation, productivity, and income distribution. Interaction of human and natural systems, perceptions of scarcity, property rights, collective action, and governance. Policy tools for promoting conservation.", "alias": "ACR 848, RD 823"}, "CSUS855": {"name": " Political Ecology of Food", "semester": "Fall of even years", "credits": " 3", "description": "Interactions between food, society and the environment. Ecological impacts and sociopolitical power in international and domestic contexts.", "restrictions": "Open to graduate students or approval of department."}, "CSUS858": {"name": " Gender, Justice and Environmental Change : Issues and Concepts", "semester": "Fall of every year", "credits": " 3", "description": "Issues and concepts related to gender, ecology, and environmental studies. Key debates and theoretical approaches to addressing environmental issues from a gender and social justice perspective. Gender and environment issues and processes from a global perspective."}, "CSUS859": {"name": " Gender, Justice, and Environmental Change: Methods and Application", "semester": "Spring of every year", "credits": " 3", "description": "Methods and case studies related to gender, ecology, and environmental studies. Methodological and fieldwork issues from a feminist perspective in international and intercultural contexts. Qualitative and quantitative methods for integrating social and environmental data."}, "CSUS860": {"name": " Youth Leadership: Theory and Practice", "semester": "Summer of even years", "credits": " 3", "description": "Foundations of theory and practice in youth leadership. Youth development and leadership in families, schools, organizations, and communities. Review of youth organizations at the local, state, national, and international levels. Field trips required.", "alias": "CSUS 422"}, "CSUS861": {"name": " Educational Theory and Application of Experiential Learning in AFNR", "semester": "Summer of odd years", "credits": " 3", "description": "Foundations of experiential learning in theory and practice. Experiential learning within the context of families, schools, organizations and communities as a function of an educational system. Application of experiential learning within formal and nonformal educational settings. Field trips required.", "alias": "CSUS 423"}, "CSUS863": {"name": " Agriculture, Food and Natural Resources Education Laboratory Instruction: Theory and Practice", "semester": "Summer of every year", "credits": " 3", "description": "Research-based pedagogy and application of laboratory experiences in teaching and learning. Current principles and practice in AFNRE laboratory learning in formal and non-formal education. Field trips required."}, "CSUS864": {"name": " Agriculture, Food and Natural Resources Educator Induction", "semester": "Fall of every year", "credits": " 3", "description": "Induction and persistence theory and research. Personal development. Professional identity. Curriculum expansion. Teaching method enhancement. Community-centered programming. Program evaluation."}, "CSUS865": {"name": " Facilitative Leadership", "semester": "Fall of every year", "credits": " 1", "description": "Facilitative leadership in groups, organizations and communities. Techniques, processes, and skills for leading groups to generate and prioritize ideas, set goals, and create action plans. Practical experience emphasized.", "alias": "ACR 865"}, "CSUS873": {"name": " Culture, Communities and Tourism", "semester": "Fall of even years", "credits": " 3", "description": "Multi-disciplinary exploration of culture, heritage, cultural landscapes, ecotourism. Contribution of cultural institutions and resources to economy, tourism and community development. Relationship between natural environment and cultural expression. Positive and negative impacts of cultural tourism. Domestic and international examples.", "alias": "ACR 873"}, "CSUS886": {"name": " Fundamentals of Museum Studies", "semester": "Fall of every year", "credits": " 3", "description": "Introduction to the history of museums and current practices, standards, issues and ethics related to education, administration, visitor studies and the development, care and use of museum collections.", "restrictions": "Open to lifelong graduate students in the College of Arts and Letters or in the Department of Anthropology or in the Department of History. Approval of department.", "alias": "AL 886", "exclude": "MUSM 485"}, "CSUS890": {"name": " Independent Study in Community Sustainability", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 6", "description": "Supervised individual study in an area of community sustainability or sustainable tourism and protected area management.", "restrictions": "Open to graduate students. Approval of department.", "alias": "ACR 890"}, "CSUS891": {"name": " Selected Topics in Community Sustainability", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 9", "description": "Selected topics in community sustainability or sustainable tourism and protected area management of current interest and importance.", "restrictions": "Open to graduate students in the College of Agriculture and Natural Resources or in the Department of Community Sustainability or in the Community, Agriculture, Recreation and Resource Studies major. Approval of department.", "alias": "ACR 891"}, "CSUS891B": {"name": " Advanced Topics in Community, Food and Agriculture", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 3", "description": "Selected, advanced topics in community, food and agriculture.", "alias": "ACR 891B"}, "CSUS894": {"name": " Field Practicum in Community Sustainability", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 3", "description": "Integration of knowledge, skills and program objectives with field-based scholarship or training in programs in domestic or foreign settings. Practice, observation, and analysis through field experiences. Writing, analysis, and evaluation.", "restrictions": "Open to graduate students in the Department of Community Sustainability.", "alias": "ACR 894"}, "CSUS897": {"name": " Practicum in Museum Studies", "semester": "On Demand, On Demand, On Demand", "credits": "Variable from 1 to 3", "description": "Practical experience in museum studies.", "alias": "AL 897"}, "CSUS898": {"name": " Master's Professional Project", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 3", "description": "Master's project, non-thesis research, practicum or other professional development capstone experiences.", "restrictions": "Open to master's students in the Department of Community Sustainability.", "alias": "ACR 898"}, "CSUS899": {"name": " Master's Thesis Research", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 6", "description": "Master's thesis research.", "restrictions": "Open to master's students in the Department of Community Sustainability.", "alias": "ACR 899"}, "CSUS999": {"name": " Doctoral Dissertation Research", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 12", "description": "Doctoral dissertation research.", "restrictions": "Open to doctoral students in the Department of Community Sustainability.", "alias": "ACR 999"}}}