{"code": "EAD", "name": "Educational Administration", "courses": {"EAD201": {"name": " Current Issues in Education", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Contemporary and perennial issues in elementary, secondary, and higher education."}, "EAD315": {"name": " Student Leadership Training", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Student leadership role, skills, and technique, consistent with the principles and demands of a democratic multicultural society."}, "EAD361": {"name": " Educational Reform and Policy Analysis", "semester": "Fall of every year", "credits": " 3", "description": "Analysis of prominent current K-12 and higher educational reforms and policies in the United States."}, "EAD362": {"name": " Student Culture and Higher Education", "semester": "Spring of odd years", "credits": " 3", "description": "Historical and contemporary college student cultures in U.S. and global contexts."}, "EAD363": {"name": " Diversity and Higher Education", "semester": "Fall of even years", "credits": " 3", "description": "Historical and contemporary aspects of diversity and multiculturalism in higher education."}, "EAD491": {"name": " Special Topics in Student Affairs", "semester": "Spring of every year, Summer of every year", "credits": " 3", "description": "Introduction to the student affairs profession and field.", "restrictions": "Not open to freshmen or sophomores and not open to master's students in the Higher, Adult, and Lifelong Education Major or in the Student Affairs Administration Major."}, "EAD800A": {"name": " Professional Seminar in Educational Leadership", "semester": "Fall of every year", "credits": " 1", "description": "Fundamentals of school leadership. Enduring problems in educational administration. Program orientation, including organizing perspectives and expectations for students. Technological tools and resources for learning."}, "EAD801": {"name": " Leadership and Organizational Development", "semester": "Spring of every year, Summer of every year", "credits": " 3", "description": "Interaction of leadership with organizational culture and development within a variety of educational organizations."}, "EAD805": {"name": " Administration in Higher Education", "semester": "Fall of every year", "credits": " 3", "description": "Theories, systems, structures, and processes of college and universities. Comparison of the organization, leadership, and governance of higher education institutions to other non-profit organizations."}, "EAD806": {"name": " Evolving Practice of School Leaders", "semester": "Fall of every year", "credits": " 3", "description": "Historical analysis of K-12 school leadership. Comparative analysis of leadership and school improvement. Leadership theory. Ethical leadership. Critical thinking and reflection of one's own leadership.", "restrictions": "Open to graduate students in the K-12 Educational Administration major."}, "EAD811": {"name": " Inquiry and Analysis of Teaching and Learning", "semester": "Fall of every year", "credits": " 3", "description": "Inquiry and applied research methods and skills. Data-based decision making for instructional improvement. Computer skills for data analysis. Methods of data use for teachers and leaders. Legal and ethical use of data.", "exclude": "EAD 854"}, "EAD812": {"name": " Inquiry and Analysis of School Organizations", "semester": "Spring of every year", "credits": " 3", "description": "Inquiry and applied research methods and skills. Data-based decision making for organizational improvement. Analyzing schools as rational, natural, and open systems. Methods of data use for school administration. Legal and ethical concerns of data use.", "prerequisite": "EAD 811", "exclude": "EAD 855 or EAD 856"}, "EAD820": {"name": " School Leadership Internship", "semester": "Fall of every year", "credits": "Variable from 1 to 3", "description": "Supervised internship in an educational institution focused on school leadership issues.", "restrictions": "Open to graduate students in the K-12 Educational Administration major."}, "EAD821": {"name": " Internship in Educational Administration II", "semester": "Spring of every year, Summer of every year", "credits": "Variable from 1 to 3", "description": "Supervised internship in an educational and/or community organization focused on school-community leadership issues.", "restrictions": "Open only to graduate students in K-12 Educational Administration."}, "EAD822": {"name": " Engaging Diverse Students and Families", "semester": "Fall of every year", "credits": " 3", "description": "Comparative and historical analysis of education within the broader social, cultural, and linguistic contexts of schools. Students in contemporary schools. Social problems, social policies, and school practice. School, family, and community relationships.", "exclude": "EAD 853B"}, "EAD824": {"name": " Leading Teacher Learning", "semester": "Spring of every year, Summer of every year", "credits": " 3", "description": "Instructional leadership. Learning environment for teachers and students. Teacher supervision and evaluation. Staff development and teacher collaboration. Improvement of instructional program. Assessing student achievement.", "exclude": "EAD 853C"}, "EAD830": {"name": " Issues in Urban Education: Racial Achievement Gap", "semester": "Spring of every year", "credits": " 3", "description": "Institutional, class, race systemic factors that contribute to the racial achievement gap. Strategies for improving urban schools; uncover areas of study for future research."}, "EAD840": {"name": " Inquiry in Postsecondary Education", "semester": "Spring of every year", "credits": " 3", "description": "Inquiry concepts and methods related to postsecondary education; problems of theory and practice in teaching and learning, administration, and leadership."}, "EAD850": {"name": " Issues and Strategies in Multicultural Education", "semester": "Spring of every year", "credits": " 3", "description": "Historical, pedagogical, and administrative considerations of multicultural education in K-16 educational settings."}, "EAD852": {"name": " The School Principalship", "semester": "Fall of every year, Summer of every year", "credits": " 3", "description": "Administration of K-12 schools. Alternative organizational arrangements, curricula, and practices. Problems and strategies for improving schools.", "exclude": "EAD 852A or EAD 852B"}, "EAD853": {"name": " Education Finance and Policy", "semester": "Fall of every year, Summer of every year", "credits": " 3", "description": "Alternative policies to fund public schools. Equity and adequacy in school finance. Cost-effective education practices. Privatization of education service provision.", "exclude": "EAD 853A"}, "EAD860": {"name": " Concept of a Learning Society", "semester": "Fall of every year", "credits": " 3", "description": "Learning in the Knowledge Age with special focus on the role of technology as a partner in the learning process and in extending intelligence."}, "EAD861": {"name": " Adult Learning", "semester": "Fall of every year", "credits": " 3", "description": "Learning and change in the adult years. Motivation and barriers to participation. Cognitive, emotional, developmental, and socio-cultural processes involved in adult learning. Understanding differences among adults in approaches to learning.", "alias": "EAD 861A"}, "EAD863": {"name": " Training and Professional Development", "semester": "Fall of every year", "credits": " 3", "description": "Design of training and professional development programs for postsecondary education contexts.", "alias": "EAD 862A"}, "EAD864": {"name": " Adult Career Development", "semester": "Spring of every year", "credits": " 3", "description": "Psychological, social and institutional elements of careers. Cases and theories of career and adult development in the context of changing conditions of work and learning across the life-span.", "alias": "EAD 862B"}, "EAD866": {"name": " Teaching in Postsecondary Education", "semester": "Spring of every year", "credits": " 3", "description": "Philosophies and beliefs undergirding teaching strategies. Effective teaching strategies and formal learning environments. Assessment of teaching and of student learning.", "alias": "EAD 861B"}, "EAD867": {"name": " Case Studies in Educational Leadership", "semester": "Summer of every year", "credits": " 3", "description": "Case-based learning to examine contemporary K-16 leadership."}, "EAD868": {"name": " Pro-Seminar in Higher and Adult Education", "semester": "Fall of every year", "credits": " 3", "description": "Foundations and development of higher and adult education as a professional discipline. Traditional and contemporary issues in theory, research, and practice.", "restrictions": "Open to master's students in the Higher, Adult, and Lifelong Education major."}, "EAD870": {"name": " Foundations of Postsecondary Education", "semester": "Fall of every year", "credits": " 3", "description": "Historical, philosophical and social forces that shaped development of colleges and universities. Emphasis on higher education in the United States."}, "EAD871": {"name": " Collegiate Contexts for Teaching and Learning", "semester": "Spring of every year", "credits": " 3", "description": "Sociocultural contexts of teaching and learning in collegiate environments. Organizational strategies to improve learning contexts for diverse students.", "alias": "EAD 871B"}, "EAD872": {"name": " Legal Issues in Higher Education", "semester": "Spring of every year", "credits": " 3", "description": "Legal aspects of administrative practice in institutions of higher education. Governance, academic freedom, due process, and anti-discrimination."}, "EAD873": {"name": " College Student Development", "semester": "Fall of every year", "credits": " 3", "description": "Research, theory, and literature related to student development in the college years.", "restrictions": "Open to master's students in the Student Affairs Administration major."}, "EAD874": {"name": " Introduction to Student Affairs", "semester": "Fall of every year", "credits": " 3", "description": "History, development, philosophy, organization, and administration of college student personnel as a profession. Needed services, programs and skills.", "restrictions": "Open to master's students in the Student Affairs Administration major."}, "EAD875": {"name": " Issues and Strategies in Student Affairs", "semester": "Fall of every year", "credits": " 3", "description": "Student affairs work in colleges and universities. Integration of theory with practice.", "prerequisite": "EAD 874", "restrictions": "Open to master's students in the Student Affairs Administration major."}, "EAD876": {"name": " Budgeting and Finance in Higher Education", "semester": "Spring of every year", "credits": " 3", "description": "Fundamentals of higher education budgeting and finance, including external sources of funding, internal resource allocation processes, social and economic principles and values regarding the distribution of resources among competing concerns.", "alias": "EAD 971C"}, "EAD877": {"name": " Program Planning and Evaluation in Postsecondary Contexts", "semester": "Fall of every year", "credits": " 3", "description": "Planning and evaluating programs for learning in diverse educational contexts.", "alias": "EAD 871A"}, "EAD878": {"name": " Education in the Digital Age", "semester": "Fall of every year, Summer of every year", "credits": " 3", "description": "An exploration of the historical, philosophical, critical, and practical questions associated with the technological transformation of all levels of education."}, "EAD881": {"name": " Workshops in Educational Administration", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 3", "description": "Laboratory experiences focused on common supervisory and administrative problems."}, "EAD882": {"name": " Seminars in Educational Administration", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": " 3", "description": "Seminars in various fields in K-12 educational administration and in higher, adult, and lifelong education."}, "EAD889": {"name": " Research and Assessment in Student Affairs", "semester": "Spring of every year", "credits": " 3", "description": "Introduction to strategies for research and inquiry in student affairs.", "restrictions": "Open to master's students in the Student Affairs Administration major."}, "EAD890": {"name": " Independent Study", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 3", "description": "Individual study in an area of K-12 administration or higher, adult, and lifelong education.", "restrictions": "Approval of department."}, "EAD893": {"name": " Professional Development Seminar in Student Affairs", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": " 1", "description": "Supervised work experience in student affairs.", "restrictions": "Open to students in the Student Affairs Administration major.", "alias": "EAD 894A"}, "EAD894": {"name": " Laboratory and Field Experiences", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 6", "description": "Supervised graduate practica, observations, internships, or externships in K-12 administration and in higher, adult, and lifelong education."}, "EAD895": {"name": " Research Ethics", "semester": "Summer of every year", "credits": " 1", "description": "Identifying and resolving ethical problems in research. Collegial interactions. Authorship, publication, and reviewing practices. Data management. Ownership of data and intellectual property. Conflicts of interest. Protection of human and animal subjects. Lab safety and compliance.", "restrictions": "Open to graduate students.", "alias": "PES 895"}, "EAD899": {"name": " Master's Thesis Research", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 9", "description": "Master's thesis research."}, "EAD901": {"name": " Urban Education: An Historical Overview", "semester": "Fall of even years", "credits": " 3", "description": "Emergence and evolution of urban schools. Social, economic, and political factors affecting their development."}, "EAD907": {"name": " Educational Policy for Immigrant and English Language Learner Students", "semester": "Fall of odd years", "credits": " 3", "description": "Impact of recent increases in immigration on racial, ethnic, and linguistic diversity in schools in the United States. Contemporary education policy issues that affect immigrant and ELL students. Language learning policy. Social context of education for immigrant and ELL students."}, "EAD920": {"name": " Political Economy of Schooling", "semester": "Fall of every year", "credits": " 3", "description": "Impacts of education on economic outcomes; impacts of student socioeconomic status on school outcomes. Multiple goals of public education. Historical development of public school system. Workplace skills, occupational structure, social mobility. School governance and education politics. Alternative policies to improve education outcomes."}, "EAD921": {"name": " Educational Leadership and Transformation", "semester": "Fall of every year", "credits": " 3", "description": "Creating organizational value through leadership. Leading through conflict. Personal and collective leadership development. Connecting schools with civic life. Convening community groups for democratic deliberation.", "restrictions": "Open to graduate students in the Educational Leadership Major."}, "EAD922": {"name": " Analyzing Education Systems", "semester": "Fall of every year", "credits": " 3", "description": "Analyzing systems of educational organizations, including schools, local education agencies, and state education agencies. Theory and research on educational organizations to actual cases in order to identify interdependent strengths and weaknesses that support and/or undermine instructional improvement."}, "EAD923": {"name": " Organizing for Learning", "semester": "Spring of every year", "credits": " 3", "description": "Curriculum leadership. Competing approaches to curriculum and pedagogy. Ensuring instructional program coherence. Managing and evaluation of human resources. Planning and coordinating professional development. Implementing systemic use of instructional technology."}, "EAD924": {"name": " Data and Decisions", "semester": "Fall of every year", "credits": " 3", "description": "Data collection and analysis for school improvement. Decision making criteria. Assessment of resource use and instructional learning outcomes. Data management. Legal and ethical use of data. Communication strategies.", "restrictions": "Open to graduate students in the Educational Leadership Major."}, "EAD925": {"name": " Policy and Practice in Education", "semester": "Fall of odd years", "credits": " 3", "description": "Multiple conceptions of the relationship between policy and practice in K-12 education.", "alias": "EAD 944"}, "EAD926": {"name": " School Finance and Operations", "semester": "Fall of every year", "credits": " 3", "description": "School funding and resource allocation. Alternative employee compensation and service delivery options. School facilities; safe and healthy school environments."}, "EAD928": {"name": " Proseminar in Educational Policy", "semester": "Fall of every year", "credits": " 3", "description": "Disciplinary perspectives on policy issues. Influence of research on policy process. Politics and educational practice as determinents of policy choice."}, "EAD929": {"name": " Collaborative Inquiry", "semester": "Summer of every year", "credits": " 3", "description": "Designing and implementing school or community-based action research. Collaborative, multi-disciplinary inquiry. Democratic and civic engagement. Ethics of collaborative research. Reflective practice. Moving from inquiry to action.", "restrictions": "Approval of department."}, "EAD931": {"name": " Introduction to Qualitative Methods in Educational Research", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": " 3", "description": "Concepts and assumptions underlying multiple traditions of qualitative research methods in education. Relationship between research questions and qualitative research design. Epistemology, methods, and ethical issues of ethnography, case study research, grounded theory, oral history and discourse analysis. Criteria for appraising and critiquing qualitative research designs, claims, and evidence,"}, "EAD942": {"name": " Economics of Education", "semester": "Spring of every year", "credits": " 3", "description": "Economic effects of education. Economic analysis of policy issues in education. Applications to the United States and other countries.", "restrictions": "Open to graduate students."}, "EAD943": {"name": " Politics of Education", "semester": "Spring of every year", "credits": " 3", "description": "Politics of education in the United States. Interplay of key institutions (e.g., school boards, state governments, Congress, mayors) and actors (e.g. elected officials, parents, teachers unions, and the general public) shaping the public education system.", "restrictions": "Open to graduate students."}, "EAD944": {"name": " Social Context of Education", "semester": "Fall of every year", "credits": " 3", "description": "Evolution of educational institutions and practices in response to economic, political, demographic and social change. Legacies of change for instruction, curriculum, segmentation of students, and students’ school experiences. Effect of family and community on students and schools. Conflicting goals/purposes of public education. Struggles for educational equity and opportunity.", "restrictions": "Open to graduate students."}, "EAD946A": {"name": " Regression Analysis for Education Policy", "semester": "Spring of every year", "credits": " 3", "description": "Foundations of regression analysis. Underlying assumptions. Applications to education policy with attention to challenges of establishing causal relations. STATA software skills for independent scholarly investigations.", "prerequisite": "CEP 932", "restrictions": "Open to graduate students."}, "EAD946B": {"name": " Econometric Analysis for Education Policy", "semester": "Fall of even years", "credits": " 3", "description": "Econometric techniques for identifying and estimating causal relationships for education policy analysis.Extensions of linear regression analysis. Evaluation of randomized control trials.", "restrictions": "Open to graduate students."}, "EAD947": {"name": " Comparative International Education Policy", "semester": "Fall of every year", "credits": " 3", "description": "International and comparative education policy. National and international policy actors. Cross-national education policy research. Insights from international research for U.S. education policy.", "restrictions": "Open to graduate students."}, "EAD948": {"name": " Advanced Economics of Education", "semester": "Spring of odd years", "credits": " 3", "description": "Advanced research in the intersection of economics and education. Returns to education, education production,school choice, teacher quality and compensation, financial aid, and postsecondary access.", "prerequisite": "EC 820B or approval of department", "restrictions": "Open to graduate students."}, "EAD949": {"name": " Advanced Seminar in Education Policy", "semester": "Fall of every year", "credits": " 3", "description": "Seminars on rotating topics in advanced, contemporary education policy research.", "restrictions": "Open to graduate students."}, "EAD950A": {"name": " Proseminar I in K-12 Educational Administration", "semester": "Fall of every year", "credits": " 1", "description": "Disciplinary perspectives of K-12 educational leadership and management. Influence of research on leadership practice."}, "EAD950B": {"name": " Proseminar II in K-12 Educational Administration", "semester": "Spring of every year", "credits": " 1", "description": "Synthesis and analysis of disciplinary perspectives of K-12 educational leadership and management. Influence of research on leadership practice.", "prerequisite": "EAD 950A"}, "EAD952A": {"name": " Externship in Educational Administration", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Current administrative problems and solution strategies in education."}, "EAD955B": {"name": " Field Research Methods in Educational Administration", "semester": "Spring of every year", "credits": " 3", "description": "Methods used in conducting field studies in educational organizations, with emphasis on interviews, observation, and participant observation."}, "EAD960": {"name": " Proseminar in Postsecondary Education", "semester": "Fall of every year", "credits": " 3", "description": "Questions, trends, issues and resources in higher, adult, and lifelong education. Development of skills in problem identification, literature analysis, and scholarly writing.", "restrictions": "Open only to doctoral students in the Higher, Adult, and Lifelong Education major."}, "EAD963": {"name": " Leadership in Postsecondary Education", "semester": "Spring of every year", "credits": " 3", "description": "Leadership as a complex social phenomenon in higher, adult, and lifelong educational settings. Interdisciplinary theories of leadership as applied to postsecondary education."}, "EAD964": {"name": " Comparative Higher Education", "semester": "Spring of every year", "credits": " 3", "description": "National systems of higher education, policy challenges, international and comparative research."}, "EAD965": {"name": " Diversity and Equity in Postsecondary Education", "semester": "Fall of every year", "credits": " 3", "description": "Promise, challenge, and management of diversity and equity in higher education. Analysis of data and policy. Management responses and strategies."}, "EAD966": {"name": " Students in Postsecondary Education", "semester": "Spring of every year", "credits": " 3", "description": "Research and theoretical foundations concerning traditional and non-traditional college students. Literature from diverse fields such as higher education, adult learning, and multicultural education. Psychosocial and cognitive development of college students, learning and development across the life-span, experiences of diverse populations, impact of collegiate environments and structures on students.", "restrictions": "Open only to doctoral students in the Higher, Adult, and Lifelong Education major."}, "EAD967": {"name": " Policy Development and Analysis in Postsecondary Education", "semester": "Fall of every year", "credits": " 3", "description": "Higher education policy issues, policy-related research and development approaches.", "restrictions": "Open only to doctoral students in the Higher, Adult, and Lifelong Education major."}, "EAD968": {"name": " Teaching, Learning, and Curriculum in Postsecondary Education", "semester": "Spring of every year", "credits": " 3", "description": "Theories and current issues about teaching, learning, and curriculum in postsecondary education. Topics include learning contexts, learners, teachers, the learning process, curriculum.", "restrictions": "Open only to doctoral students in the Higher, Adult, and Lifelong Education major."}, "EAD970": {"name": " Organization and Administration in Postsecondary Education", "semester": "Fall of every year", "credits": " 3", "description": "Principles and patterns of organization and governance characteristic of colleges and universities. Administrative, trustee, faculty, and student roles.", "restrictions": "Open only to doctoral students in the Higher, Adult, and Lifelong Education major.", "alias": "EAD 970A"}, "EAD972": {"name": " International and Comparative Issues in Higher and Adult Education", "semester": "Summer of every year", "credits": " 3", "description": "Higher and adult education in international contexts. Policy, organizational structures and behavior, curriculum, pedagogy, and student affairs."}, "EAD980": {"name": " Engaged Educational Leadership", "semester": "Summer of every year", "credits": "Variable from 1 to 3", "description": "Developing skills for engaged leadership. Convening forums to discuss and disseminate ideas for improvement of educational organizations and educational policy. Developing leadership skills that encourage and support agency of stakeholders.", "restrictions": "Approval of department."}, "EAD981A": {"name": " Capstone I", "semester": "Fall of every year", "credits": " 4", "description": "Capstone group project."}, "EAD981B": {"name": " Capstone II", "semester": "Spring of every year", "credits": " 4", "description": "Capstone group project.", "prerequisite": "EAD 981A"}, "EAD982A": {"name": " Capstone Seminar", "semester": "Fall of every year", "credits": " 2", "description": "Capstone seminar to support ongoing work for capstone projects."}, "EAD982B": {"name": " Capstone Seminar II", "semester": "Spring of every year", "credits": " 2", "description": "Capstone support seminar.", "prerequisite": "EAD 982A"}, "EAD990": {"name": " Independent Study", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 3", "description": "Advanced individual study in an area of K-12 administration or higher, adult, and lifelong education."}, "EAD991A": {"name": " Special Topics in K-12 Administration", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": " 3", "description": "Special topics in K-12 administration."}, "EAD991B": {"name": " Special Topics in Higher, Adult, and Lifelong Education", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": " 3", "description": "Special topics in the field of higher, adult and lifelong education."}, "EAD991C": {"name": " Special Topics in Education Policy", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": " 3", "description": "Special topics in education policy.", "restrictions": "Open to graduate students."}, "EAD994": {"name": " Laboratory and Field Experience in Educational Administration", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 6", "description": "Supervised advanced graduate practica, observations, internships, or externships in K-12 administration and in higher, adult, and lifelong education.", "restrictions": "Open only to doctoral students."}, "EAD995": {"name": " Research Practicum in Educational Administration", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 3", "description": "Supervised research practicum. Design, execution, analysis, presentation, critique, and revision of research projects.", "restrictions": "Open only to doctoral students in the College of Education. Approval of department."}, "EAD999": {"name": " Doctoral Dissertation Research", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 23", "description": "Doctoral dissertation research.", "restrictions": "Open to doctoral students in the College of Education or in the Department of Educational Administration."}}}