{"code": "EEM", "name": "Environmental Economics and Management", "courses": {"EEM203": {"name": " Data Analysis for the Agri-Food System", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Introduction to data analysis tools used in the management of food systems.", "prerequisite": "(ABM 100) and (EC 201 or concurrently)", "restrictions": "Open to undergraduate students in the Agribusiness Management Major or in the Agribusiness Management Minor or in the Environmental Economics Minor or in the Environmental Economics and Management major or in the Food Industry Management Major or in the Food Industry Management Minor."}, "EEM255": {"name": " Ecological Economics", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Relationship between the economy and the natural environment. Economic organization and sustainability. Economic concepts applied to natural resources and agriculture.", "prerequisite": "EC 201 or concurrently", "alias": "PRM 255, EEP 255"}, "EEM260": {"name": " World Food, Population and Poverty", "semester": "Fall of every year", "credits": " 3", "description": "Description and analysis of world food, population and poverty problems. Interrelationships between developed and developing countries.", "prerequisite": "ABM 100 or EC 201 or EEM 255", "alias": "EEP 260"}, "EEM303": {"name": " Economics of Decision Making in the Agri-Food System", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Managerial economics with applications focusing on agriculture, food, and resources issues.", "prerequisite": "(MTH 124 and EC 201 and EC 202 and ABM 203) and (STT 200 or STT 201 or STT 315)"}, "EEM320": {"name": " Environmental Economics", "semester": "Spring of every year", "credits": " 3", "description": "Analytical methods for evaluating economic impacts of environmental policies and understanding the economic causes of environmental problems.", "prerequisite": "(EEM 255 and EC 201) and (ABM 203 or approval of department)", "alias": "EEP 320"}, "EEM335": {"name": " Taxes, Government Spending and Public Policy", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": " 3", "description": "Economics of the public sector. Public goods, externalities, design and incidence of the tax system. Equity and efficiency effects of government programs.", "prerequisite": "EC 201 or EC 251H", "exclude": "EC 435 or EC 436"}, "EEM404": {"name": " Public Sector Budgeting and Program Evaluation", "semester": "Spring of every year", "credits": " 3", "description": "Structure and finance of government. Approaches to public sector budgeting. Evaluation of output of programs and community services. Impact and multiple outcome analysis.", "prerequisite": "(EC 201 or EEM 255) and EC 202 and Completion of Tier I Writing Requirement", "restrictions": "Not open to freshmen or sophomores.", "alias": "PRM 404, EEP 404"}, "EEM405": {"name": " Corporate Environmental Management (W)", "semester": "Spring of every year", "credits": " 3", "description": "Integration of environmental protection and pollution prevention with business management. Economic and strategic analysis of environmental protection.", "prerequisite": "(EEM 255) and (ACC 201 or ACC 230 or ABM 130) and ABM 203 and (((ABM 303 or EC 301) or approval of department) and completion of Tier I writing requirement)", "restrictions": "Open to juniors or seniors.", "alias": "PRM 405"}, "EEM460": {"name": " Natural Resource Economics", "semester": "Spring of every year", "credits": " 3", "description": "Economic framework for analyzing natural resource management decisions. Spatial and inter-temporal allocation of renewable and nonrenewable resources. Special emphasis on institutions, externalities, and public interests in resource management.", "prerequisite": "(EC 201 and EEM 255) and ABM 203", "restrictions": "Open to juniors or seniors.", "alias": "EEP 460"}, "EEM464": {"name": " Environmental and Natural Resource Policy in Michigan", "semester": "Spring of every year", "credits": " 3", "description": "State legislative process and its role in environmental and natural resource policy formulation. Influence of lobbying, citizen engagement and political factors.", "prerequisite": "CSUS 200 or EEM 255 or approval of department", "alias": "ESA 440, RD 440"}, "EEM465": {"name": " Environmental and Natural Resource Law", "semester": "Fall of every year", "credits": " 3", "description": "Legal principles and process related to the environment and natural resources. Common law, constitutional law, statutory and administrative law.", "prerequisite": "CSUS 200 or EEM 255", "restrictions": "Open to juniors or seniors or graduate students.", "alias": "ESA 430, RD 430"}, "EEM490": {"name": " Independent and Supervised Study", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 6", "description": "In-depth independent study of topics affecting public resource management. Complementary with previous coursework, adapted to career aspirations.", "prerequisite": "ABM 100", "restrictions": "Open to undergraduate students in the Environmental Economics and Management major. Approval of department; application required.", "alias": "EEP 490, PRM 490"}, "EEM493": {"name": " Professional Internship in Environmental Economics and Management", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 3", "description": "Supervised professional experience in agencies, organizations, or businesses related to environmental economics and policy.", "prerequisite": "ABM 100", "restrictions": "Open to juniors or seniors in the Environmental Economics and Management major. Approval of department; application required. A student may earn a maximum of 6 credits in all enrollments for any or all of these courses", "alias": "EEP 493, PRM 493"}}}