{"code": "EGR", "name": "Engineering", "courses": {"EGR100": {"name": " Introduction to Engineering Design", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": " 2", "description": "Engineering design process as modeled by team-based, interdisciplinary design projects. Roles of engineers and the contributions of engineering in society. Project management, creativity and design of products and processes to specified outcomes under specified constraints. Introduction to computing tools and physical equipment in support of engineering design. Engineering ethics. Oral and written technical communications.", "prerequisite": "((MTH 116 or concurrently) or (MTH 132 or concurrently) or (MTH 152H or concurrently) or (LB 117 or concurrently) or (LB 118 or concurrently)) and (WRA 1004 or designated score on English Placement test )", "restrictions": "Open to students in the College of Engineering or in the Entrepreneurship and Innovation Minor and open to students in the Lyman Briggs College."}, "EGR102": {"name": " Introduction to Engineering Modeling", "semester": "Fall of every year, Spring of every year", "credits": " 2", "description": "Application of systematic approaches to engineering problems. Problem decomposition and identification of a solution approach. Solution using tools such as advanced spreadsheet features and MATLAB. Data representation, curve fitting and analysis. Mathematical modeling of engineering systems. Application of principles through team-based engineering projects.", "prerequisite": "(MTH 132 or concurrently) or (MTH 152H or concurrently) or (LB 118 or concurrently)", "restrictions": "Open to students in the College of Engineering or in the Lyman Briggs College.", "exclude": "CSE 131"}, "EGR106": {"name": " Preparation for Science and Engineering", "semester": "Fall of every year", "credits": " 1", "description": "Academic and environmental aspects to college success. Review of math and science fundamentals and development of writing skills. Introduction to Science, Technology, Engineering, and Mathematics (STEM) careers.", "restrictions": "Open to freshmen. Approval of college."}, "EGR160": {"name": " Success in Science, Technology, Engineering, and Mathematics", "semester": "Fall of every year, Spring of every year", "credits": " 2", "description": "Professional preparation for Science, Technology, Engineering, and Mathematics (STEM) careers. Transitional challenges. Diversity and STEM. Career options. Communication skills.", "restrictions": "Open to freshmen or sophomores."}, "EGR192": {"name": " Environmental Issues Seminar", "semester": "Fall of every year", "credits": " 1", "description": "Environmental issues and problems explored from a variety of perspectives, including legal, scientific, historical, political, socio-economic, and technical points of view.", "restrictions": "Open to students in the College of Communication Arts and Sciences or in the College of Engineering or in the College of Natural Science or in the College of Social Science. Approval of college."}, "EGR290": {"name": " Independent Study", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 4", "description": "Independent undergraduate research in engineering.", "restrictions": "Open to students in the College of Engineering. Approval of college."}, "EGR291": {"name": " Selected Topics", "semester": "Fall of every year, Spring of every year", "credits": "Variable from 1 to 4", "description": "Experimental course development or special topics offerings."}, "EGR292": {"name": " Applications in Environmental Studies", "semester": "Spring of every year", "credits": " 2", "description": "Community engagement project. Projects vary depending on student's major and area of environmental interest.", "restrictions": "Open to students in the Environmental Studies Specialization."}, "EGR393": {"name": " Engineering Cooperative Education", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": " 1", "description": "Pre-professional educational employment experiences in industry and government related to student's major. Educational employment assignment approved by College of Engineering.", "restrictions": "Open to students in the College of Engineering and not open to freshmen."}, "EGR400": {"name": " Special Problems in International Engineering", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 6", "description": "Supervised study of selected topics in engineering using laboratories, equipment, and engineering design techniques. Given at various international universities and institutes.", "restrictions": "Open to juniors or seniors or graduate students in the College of Engineering."}, "EGR440": {"name": " Engineering Entrepreneurship", "semester": "Fall of every year", "credits": " 3", "description": "Technical skills to enable and engage in engineering related entrepreneurship at all levels. Discovery, evaluation, and engagement of entrepreneurial opportunities starting with technology development to solve a problem, bring about desired change that is scalable, and the application of engineering principles in business related endeavors.", "restrictions": "Open to juniors or seniors in the College of Engineering."}, "EGR475": {"name": " Special Topics in International Engineering", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 6", "description": "Topics selected to supplement regular courses. Given at various international universities and institutes.", "restrictions": "Open to juniors or seniors or graduate students in the College of Engineering."}, "EGR480": {"name": " Information and Communication Technologies and Development", "semester": "Fall of every year", "credits": " 3", "description": "Role of information and communications technologies (ICT) in low income countries and in disadvantaged areas in middle and high income countries. Theories and case studies that link ICT and social, political, economic and environmental change.", "prerequisite": "Completion of Tier I Writing Requirement", "alias": "TC 480"}, "EGR488": {"name": " Information and Communication Technology Development Project (W)", "semester": "Spring of every year, Summer of every year", "credits": "Variable from 3 to 6", "description": "Challenges and opportunities of implementing an information and communication technology in a developing country or underprivileged region of the United States. Hands-on experience conducting field work on location.", "prerequisite": "Completion of Tier I Writing Requirement", "alias": "TC 488"}, "EGR490": {"name": " Independent Study (W)", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 4", "description": "Individualized reading, research, and/or project.", "prerequisite": "Completion of Tier I Writing Requirement", "restrictions": "Open to juniors or seniors in the College of Engineering. Approval of college."}, "EGR811": {"name": " Foundations of Engineering Education", "semester": "Fall of every year", "credits": " 3", "description": "Introduces the theoretical foundations of engineering education, student learning theories, educational research, and instructional design. How to effectively teach, manage, and assess student performance.", "restrictions": "Open to graduate students in the College of Engineering. Approval of department."}, "EGR840": {"name": " Engineering Entrepreneurship", "semester": "Fall of every year", "credits": " 3", "description": "Technical skills to enable and engage in engineering related entrepreneurship at all levels. Discovery, evaluation, and engagement of entrepreneurial opportunities starting with technology development to solve a problem, bring about desired change that is scalable, and the application of engineering principles in business related endeavors.", "restrictions": "Open to graduate students in the College of Engineering."}, "EGR891": {"name": " Selected Topics", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 4", "description": "Selected topics in engineering.", "restrictions": "Open to graduate students in the College of Engineering."}, "EGR893": {"name": " Graduate Experiential Education", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": " 1", "description": "Faculty-mentored graduate research or educational employment experience in industry or government.", "restrictions": "Open to graduate students in the College of Engineering. Approval of department."}, "EGR993": {"name": " Engineering Research Writing", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": " 1", "description": "Support for students engaged in substantial writing projects such as thesis or dissertation.", "restrictions": "Open to graduate students in the College of Engineering. Approval of department."}, "EGR994": {"name": " Effective Interdisciplinary Research Collaborations", "semester": "On Demand, On Demand", "credits": " 3", "description": "Interdisciplinary research methods, techniques, approaches, and funding. Applied research on issues that crosscut communication, nursing, and engineering.", "restrictions": "Open to graduate students in the College of Communication Arts and Sciences and open to graduate students in the College of Engineering and open to graduate students in the College of Nursing."}}}