{"code": "EMB", "name": "Executive MBA Program", "courses": {"EMB801": {"name": " Business Unit Strategy", "semester": "Fall of every year, Summer of every year", "credits": "Variable from 1 to 2", "description": "Positioning the firm for competitive advantage. Institutional and corporate control. Organizational design.", "restrictions": "Open to Executive MBA students."}, "EMB802": {"name": " Financial Accounting Concepts", "semester": "Fall of every year, Summer of every year", "credits": " 2", "description": "Financial statement relationships and analysis. Role of accounting in capital markets. Contemporary financial reporting issues.", "restrictions": "Open to Executive MBA students.", "alias": "ACC 802"}, "EMB812": {"name": " Accounting for Decision Making and Control", "semester": "Fall of every year", "credits": " 2", "description": "Use of financial and non-financial data for decision making, planning, performance evaluation, control, and strategy implementation.", "prerequisite": "EMB 802 or concurrently", "restrictions": "Open to Executive MBA students.", "alias": "ACC 812"}, "EMB820": {"name": " Marketing Operations and Innovation", "semester": "Spring of every year, Summer of every year", "credits": " 2", "description": "Concepts, methods, and applications of decision-making to address marketing issues such as market segmentation and positioning, new product development, promotional and distribution strategies. Techniques to model and analyze marketing decision problems to ensure optimal performance results.", "restrictions": "Open to Executive MBA students.", "alias": "MSC 822, MSC 823, MSC 820"}, "EMB821": {"name": " Corporate Finance", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Managerial finance covering short-, intermediate- and long-term problems. Financial planning and control using financial theory and management techniques. Applications in domestic and international settings.", "restrictions": "Open to Executive MBA students.", "alias": "FI 821"}, "EMB822": {"name": " Managing Supply Chains and Lean Operations", "semester": "Fall of every year, Spring of every year", "credits": "Variable from 2 to 3", "description": "Integrative approach to product design, development, and delivery. Flow of products from concept development through delivery to the final user. Product and process development, managing information and product flows. Total quality management. Resource and capacity management.", "restrictions": "Open to Executive MBA students."}, "EMB828": {"name": " Strategic and International Marketing", "semester": "Fall of every year, Summer of every year", "credits": "Variable from 1 to 2", "description": "Models and methods of business planning. Relationship of strategic intent, business missions and planning hierarchies. Linking marketing, financial, and human resource strategic plans.", "restrictions": "Open to Executive MBA students."}, "EMB831": {"name": " Law and Business", "semester": "Spring of every year, Summer of every year", "credits": " 1", "description": "Critical analysis of government regulation of business from legal, political, and social perspectives. Moral concepts and social policy underlying government regulation.", "restrictions": "Open to Executive MBA students.", "alias": "GBL 859"}, "EMB845": {"name": " Entrepreneurship", "semester": "Fall of every year, Summer of every year", "credits": " 1", "description": "Process of planning, starting, and positioning new businesses which link directly to customer requirements. Understanding unmet market opportunity due to competitive gaps or customer needs for both consumer and industrial products and services.", "restrictions": "Open to Executive MBA students.", "alias": "MSC 832"}, "EMB847": {"name": " Business Decision Making and Marginal Analysis", "semester": "Fall of every year, Summer of every year", "credits": "Variable from 2 to 3", "description": "Application and interpretation of analytical models to support decision making. Topics include understanding the selection of appropriate analytical tools for a given problem, the interpretation of statistical results, and decision analysis.", "restrictions": "Open to Executive MBA students.", "alias": "MGT 847, MSC 847"}, "EMB856": {"name": " Human Resources and Critical Organizational Transitions", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 3", "description": "Managing human resources to support significant changes in business configuration and strategy, including mergers and acquisitions, outsourcing and workforce reductions, and globalization. Evaluation of the effectiveness of the human resource management function.", "restrictions": "Open to Executive MBA students."}, "EMB861": {"name": " Strategic Management of Information Technology", "semester": "Spring of every year", "credits": " 2", "description": "Role of Information Technology (IT) in creating organizational efficiency, competitive differentiation and advantage. Examines various IT investment types and effective strategies for leveraging IT value.", "restrictions": "Open to Executive MBA students."}, "EMB863": {"name": " Strategy Process: Generation and Implementation", "semester": "Spring of every year, Summer of every year", "credits": " 2", "description": "Managing strategic processes in the firm. Integration of environmental factors, industry dynamics, organizational resources, and management functions in the analysis and solution of strategic issues.", "restrictions": "Open to Executive MBA students."}, "EMB865": {"name": " Business Ethics and Professional Responsibility", "semester": "Spring of every year", "credits": " 2", "description": "Alternative ethical prescriptions for business and for enterprise managers and their evolution with globalization of the markets. Societal expectations of what constitutes responsible and irresponsible business behavior. Government regulation and changes in corporate governance as alternatives to conformity to ethical prescriptions. Negotiation and reconciliation of conflicting ethical prescriptions, governance procedures, and the regulatory environment.", "restrictions": "Open only to students in the Executive M.B.A Program."}, "EMB866": {"name": " Managing Teams and Negotiations", "semester": "Fall of every year, Summer of every year", "credits": "Variable from 1 to 2", "description": "Development of team management and negotiation capabilities. Group decision making, conflict management, and resolution.", "restrictions": "Open to Executive MBA students."}, "EMB877": {"name": " Leadership Development", "semester": "Fall of every year, Summer of every year", "credits": " 1", "description": "Identification of underlying competencies important for leadership success. Assessment of student's current leadership competencies and development of an improvement plan. Disclosure of how the student's leadership behaviors are perceived by multiple sources in the organization and use of this knowledge to further enhance leadership effectiveness.", "restrictions": "Open to Executive MBA students."}, "EMB887": {"name": " Business Assessment and Operational Excellence", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": " 2", "description": "Strategically assess the capabilities of an organization or business unit. Identify gaps in organizational capabilties and constraints to realizing value. Develop a solution and implementation plan to remove an existing constraint (s).", "restrictions": "Open to graduate students in the Master of Business Administration in Business Administration. Approval of department."}, "EMB891": {"name": " Special Topics in Executive Management", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 3", "description": "Faculty-supervised study in special topics relevant to business executives.", "restrictions": "Open only to students in the Executive M.B.A. program."}}}