{"code": "ENE", "name": "Environmental Engineering", "courses": {"ENE280": {"name": " Principles of Environmental Engineering and Science", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Physical, chemical and biological processes related to environmental science and engineering. Environmental systems analysis with application to air, water and soil. Analysis of environmental problems and development of engineering solutions.", "prerequisite": "(CEM 141 or CEM 151 or LB 171) and ((MTH 132 or concurrently) or (MTH 152H or concurrently) or (LB 118 or concurrently))"}, "ENE421": {"name": " Engineering Hydrology", "semester": "Fall of every year", "credits": " 3", "description": "Hydrologic design of storm water systems. Equilibrium hydrograph analysis, unit hydrographs, infiltration, hydrograph synthesis, and reservoir routing. Groundwater", "prerequisite": "(CE 321) and (GLG 201 or GLG 301) and (CE 372 or STT 351)", "restrictions": "Open to juniors or seniors or graduate students in the College of Engineering or in the College of Natural Science or in the Department of Plant, Soil and Microbial Sciences."}, "ENE422": {"name": " Applied Hydraulics", "semester": "Spring of every year", "credits": " 3", "description": "Fundamentals of open-channel flow. Rapidly and gradually varied nonuniform flow analysis. Confined flows past submerged bodies, in pipe networks, and in turbo machinery. Design applications.", "prerequisite": "CE 321 or ME 332", "restrictions": "Open to juniors or seniors or graduate students in the College of Engineering."}, "ENE480": {"name": " Environmental Measurements Laboratory", "semester": "Fall of every year", "credits": " 1", "description": "Basic chemical and microbiological methods used in the analysis of environmental media. Laboratory safety, quality assurance, quality control, and statistics used in laboratory analysis. Related technical communication, laboratory report writing.", "prerequisite": "(CEM 161 or CEM 185H or LB 171L) and ENE 280 and (CEM 142 or CEM 152 or CEM 182H or LB 172) and ((ENE 481 or concurrently) or (ENE 483 or concurrently)) and Completion of Tier I Writing Requirement", "restrictions": "Open to juniors or seniors or graduate students in the College of Engineering."}, "ENE481": {"name": " Environmental Chemistry: Equilibrium Concepts", "semester": "Fall of every year", "credits": " 3", "description": "Chemistry of natural environmental systems and pollutants. Equilibrium concepts and calculations for acid-base, solubility, complexion, redox and phase partitioning reactions and processes. Applications to ecosystem analysis, pollutant fate and transport, and environmental protection.", "prerequisite": "{(CEM 141 and CEM 142) or (CEM 151 and CEM 152) or (CEM 181H and CEM 182H) or (LB 171 and LB 172)} and (ENE 280 or BE 230 or GLG 201 or GLG 301 or approval of department)"}, "ENE483": {"name": " Water and Wastewater Engineering", "semester": "Fall of every year", "credits": " 4", "description": "Engineering and scientific basis and design of physical, chemical and biological methods for the treatment of drinking water and wastewater. Operation process selection and design. Field trips required.", "prerequisite": "(ENE 280 or BE 230) and (CE 321 or CHE 311)", "restrictions": "Open to juniors or seniors or graduate students in the College of Engineering."}, "ENE484": {"name": " Water Resource Recovery Engineering", "semester": "Spring of every year", "credits": " 3", "description": "Municipal, industrial, and rural wastewater characteristics. Selection of best site- and management-specific treatment strategy, including the influence of governmental policy and societal needs.", "prerequisite": "BE 360 or (ENE 487 or concurrently) or approval of department", "restrictions": "Open to juniors or seniors or graduate students in the College of Agriculture and Natural Resources or in the College of Engineering."}, "ENE485": {"name": " Landfill Design", "semester": "Spring of every year", "credits": " 3", "description": "Geotechnical and environmental design of solid waste landfills.", "prerequisite": "ENE 280 and CE 312"}, "ENE487": {"name": " Microbiology for Environmental Science and Engineering", "semester": "Spring of every year", "credits": " 3", "description": "Fundamentals of microbiology. Application of these concepts to environmental processes such as wastewater treatment, human health and bioremediation.", "prerequisite": "ENE 280"}, "ENE489": {"name": " Air Pollution: Science and Engineering", "semester": "Spring of every year", "credits": " 3", "description": "Basic physical and chemical principles governing indoor and atmospheric air pollution. Elements of air pollution meteorology, climate change, atmospheric transformations and transport. Air pollution sources and methods for their control. The role of local, state and federal government in air pollution control.", "prerequisite": "(CEM 141 or CEM 151 or LB 171) and (MTH 133 or MTH 153H or LB 119) and (ENE 280 or BE 230) and (CE 321 or CHE 311)", "restrictions": "Open to juniors or seniors or graduate students in the College of Engineering."}, "ENE490": {"name": " Independent Study", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 3", "description": "Environmental engineering problem of specific interest to the student and a faculty member. May be analysis or design.", "restrictions": "Open to juniors or seniors in the Department of Civil and Environmental Engineering. Approval of department."}, "ENE492": {"name": " Selected Topics in Environmental Engineering", "semester": "Fall of every year, Spring of every year", "credits": "Variable from 1 to 4", "description": "Selected topics related to environmental engineering, fluid mechanics and hydrology.", "restrictions": "Approval of department."}, "ENE800": {"name": " Environmental Engineering Seminar", "semester": "Fall of every year, Spring of every year", "credits": " 1", "description": "Current research in environmental engineering.", "restrictions": "Open only to Environmental Engineering majors."}, "ENE801": {"name": " Dynamics of Environmental Systems", "semester": "Spring of every year", "credits": " 3", "description": "Principles of mass balance, reaction kinetics, mass transfer, reactor theory in environmental engineering."}, "ENE802": {"name": " Physicochemical Processes in Environmental Engineering", "semester": "Fall of every year", "credits": " 3", "description": "Physical and chemical principles of air and water pollution control and environmental contaminants in water, air and soils."}, "ENE803": {"name": " Water Quality and Public Health", "semester": "Spring of odd years", "credits": " 3", "description": "Principles, applications, and latest research in the area of water quality and public health. Various chemical and microbiological water contaminants and their health effects. Concepts of public health and epidemiology, principles of toxicology, exposure characterization and risk assessment approaches, water management alternatives, and global issues of concern."}, "ENE804": {"name": " Biological Processes in Environmental Engineering", "semester": "Fall of every year", "credits": " 3", "description": "Engineering of microbial processes used in wastewater treatment, in-situ bioreclamation, and solid waste stabilization."}, "ENE805": {"name": " Contaminated Site Remediation", "semester": "Spring of odd years", "credits": " 3", "description": "Key topics within contaminated site remediation. Regulations relevant to remediation. Site characterization and assessment. Removal technologies, mechanisms involved, variations in approaches, advantages and limitations. Case studies for each method. Overview of air treatment technologies. Remediation approaches for problematic groundwater contaminants."}, "ENE806": {"name": " Environmental Engineering Process Laboratory", "semester": "Spring of every year", "credits": " 3", "description": "Development of skills related to planning, design, and execution of processes related to environmental engineering, enhance decision making skills, teamwork, analysis of data, report writing, and oral presentation.", "prerequisite": "ENE 480 and ENE 802 and ENE 804", "restrictions": "Open to graduate students in the Environmental Engineering major."}, "ENE821": {"name": " Groundwater Hydraulics", "semester": "Fall of every year", "credits": " 3", "description": "Physical properties of porous media. Equations of flow in saturated media. Flow nets, well flow and parameter measurement. Transport processes and the advective-dispersion equation for conservative contaminants."}, "ENE822": {"name": " Groundwater Modeling", "semester": "Spring of even years", "credits": " 3", "description": "Analysis and modeling of groundwater flow, surface water and groundwater interaction, and reactive contaminant transport. Applied numerical methods for solving groundwater flow and contaminant transport equations. Case studies."}, "ENE829": {"name": " Mixing and Transport in Surface Waters", "semester": "Fall of odd years", "credits": " 3", "description": "Waves, tides and shallow-water processes. Numerical solutions and applications of shallow-water equations to lakes, rivers and estuaries. Principles and processes of sediment transport, and dispersion of materials in surface waters. Wind-driven circulation in Lake Michigan.", "prerequisite": "ENE 801"}, "ENE880": {"name": " Independent Study in Environmental Engineering", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 6", "description": "Solution of environmental engineering problems not related to student's thesis.", "restrictions": "Open only to Environmental Engineering majors."}, "ENE890": {"name": " Selected Topics in Environmental Engineering", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 3", "description": "Selected topics in new or developing areas of environmental engineering.", "restrictions": "Open to students in the Environmental Engineering major."}, "ENE892": {"name": " Master's Research Project", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 5", "description": "Master's degree Plan B individual student research project. Original research, research replication, or survey and reporting on a research topic.", "restrictions": "Open only to master's students in the Environmental Engineering major. Approval of department."}, "ENE899": {"name": " Master's Thesis Research", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 8", "description": "Master's thesis research."}, "ENE900": {"name": " Research Strategies and Methods in Environmental Engineering and Science", "semester": "Spring of every year", "credits": " 1", "description": "Criteria for quality research, scientific method, scientific arguments, statistical testing, critical thinking skills, reviewing journal articles, literature synthesis, writing proposals and papers, giving presentations, responsible conduct of research.", "restrictions": "Open to graduate students in the Department of Civil and Environmental Engineering and open to graduate students in the Department of Geological Sciences.", "exclude": "CE 900"}, "ENE999": {"name": " Doctoral Dissertation Research", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 24", "description": "Doctoral dissertation research."}}}