{"code": "ESP", "name": "Environmental Science and Policy", "courses": {"ESP800": {"name": " Principles of Environmental Science and Policy", "semester": "Spring of every year", "credits": " 3", "description": "Scholarship and research in environmental science and policy."}, "ESP801": {"name": " Physical, Chemical, and Biological Processes of the Environment", "semester": "Fall of every year", "credits": " 3", "description": "Interdisciplinary concepts in the natural sciences related to environmental problems. Ecology and human health.", "alias": "SSC 801"}, "ESP802": {"name": " Human Systems and Environment", "semester": "Spring of every year", "credits": " 3", "description": "Anthropological, economic, geographical, legal, political, and sociological concepts of human systems and environmental change.", "alias": "SSC 804"}, "ESP803": {"name": " Human and Ecological Health Assessment and Management", "semester": "Fall of every year", "credits": " 3", "description": "Concepts and techniques used to evaluate human and ecological health impacts from anthropogenic activities. Policy formulation and management strategies to mitigate health effects.", "alias": "SSC 805"}, "ESP804": {"name": " Environmental Applications and Analysis", "semester": "Fall of every year", "credits": " 3", "description": "Global, regional, and local environmental issues. Systems approach to identify and solve environmental problems.", "prerequisite": "ESP 801 and (ESP 802 or concurrently) and ESP 803 or approval of department", "alias": "SSC 806"}, "ESP836": {"name": " Modeling Natural Resource Systems", "semester": "Spring of every year", "credits": " 3", "description": "System dynamics modeling in human-environment systems. Sustainability applications, including renewable and non-renewable resource use, greenhouse gas emissions and climate change, pollutants and limits to growth.", "alias": "ACR 851, CSUS 851"}, "ESP845": {"name": " Environmental Risk Perception and Decision-Making", "semester": "Spring of odd years", "credits": " 3", "description": "Theoretical underpinnings of individual decision-making and risk perception processes. Case studies of the interplay of risk perception and decision-making in an environmental and or criminological context.", "restrictions": "Open to master's students or doctoral students in the School of Criminal Justice or in the Department of Fisheries and Wildlife or approval of school."}, "ESP846": {"name": " Corporate Environmental Crime and Risk", "semester": "Spring of even years", "credits": " 3", "description": "Theoretical accounts and multiple interventions relevant to corporate environmental crime and risk. Use of “Smart Regulation” principles to design interventions to match specific problems.", "restrictions": "Open to master's students or doctoral students in the Department of Fisheries and Wildlife or in the School of Criminal Justice or approval of school."}, "ESP847": {"name": " Global Risks, Conservation, and Criminology", "semester": "Fall of every year", "credits": " 3", "description": "Theories, actors, characteristics and legal instruments associated with risk, conservation, and criminology related to globalization. Current case studies in criminological conservation.", "restrictions": "Open to graduate students or approval of school."}, "ESP850": {"name": " Introduction to Environmental and Social Systems Modeling", "semester": "Fall of every year", "credits": " 1", "description": "Theoretical background of diverse modeling problems in complex environmental systems. Diverse modeling approaches to most appropriate modeling tools in a variety of contexts."}, "ESP869": {"name": " Agent-Based Modeling", "semester": "Spring of every year", "credits": " 3", "description": "Theoretical concepts related to simulating dynamic geographic phenomena in the intersection between human and natural systems. Innovative agent-based methodology applied to complex social-environmental systems. Hands-on experience of agent-based modeling, with special emphasis on modeling human decision-making and its impact on the natural environment.", "restrictions": "Approval of department."}, "ESP883": {"name": " Multi-Equation Quantitative Models", "semester": "Spring of every year", "credits": " 3", "description": "Quantitative methodology", "prerequisite": "SOC 881 and SOC 882 or approval of department", "restrictions": "Open to graduate students in the Department of Sociology and open to graduate students in the Environmental Science and Policy Specialization or approval of department."}, "ESP890": {"name": " Modeling Environmental and Social Systems", "semester": "Fall of every year", "credits": " 2", "description": "Modeling project of real-world environmental problems. Theories and methodologies from previous modeling courses to practical policy problems. Applied project with a variety of modeling tools and a trans-disciplinary synthesis. Model development, implementation, and evaluation in student groups."}, "ESP891": {"name": " Selected Topics in Environmental Science and Policy", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 3", "description": "In-depth study of selected environmental science and policy issues."}}}