{"code": "FI", "name": "Finance", "courses": {"FI250": {"name": " Careers in Finance", "semester": "Fall of every year, Spring of every year", "credits": " 1", "description": "Exploration of the various specialty areas within the field of finance, including career options for new college graduates and employment trends. Understanding the minors offered to supplement the major, the student organizations that augment classroom learning, and the professional certifications desired by employers.", "restrictions": "Open to undergraduate students in the Business - Admitted major or in the Finance Major or approval of department."}, "FI293": {"name": " Cooperative Education for Business Students", "semester": "Fall of every year, Spring of every year", "credits": " 1", "description": "Integration of pre-professional educational employment experiences in industry and government with knowledge and processes taught in the student's academic program. Educational employment assignment approved by the Department of Supply Chain Management.", "restrictions": "Approval of department.", "alias": "MSC 293"}, "FI311": {"name": " Financial Management", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": " 3", "description": "Overview of financial management for business majors. Analysis of financial statements, markets, and assets. Risk and valuation, corporate budgeting and investment decisions. International and ethical implications. Current events applications.", "prerequisite": "(ACC 201 or ACC 230) and (STT 200 or STT 201 or STT 315)", "restrictions": "Open to undergraduate students in the Accounting major or in the Business - Admitted major or in the Human Resource Management Major or in the Management Major or in the Marketing Major or in the Supply Chain Management Major or in the Finance Major or in the Actuarial Science Major or in the Actuarial Science Minor.", "exclude": "FI 311H"}, "FI311H": {"name": " Financial Management", "semester": "Fall of every year", "credits": " 3", "description": "Analysis of financial statements, markets, assets, and liabilities. Risk and valuation, capital budgeting and investment decisions. International and ethical implications. Current events and applications.", "prerequisite": "ACC 201 or ACC 230", "restrictions": "Open to sophomores or juniors or seniors in the Eli Broad College of Business and The Eli Broad Graduate School of Management and not open to students in the School of Hospitality Business.", "exclude": "FI 311"}, "FI312": {"name": " Introduction to Investments", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": " 3", "description": "Theoretical and empirical analyses of securities. Risk and return formation. Security analysis and concepts of market efficiency. Common stocks, bonds, options, futures, and mutual funds.", "prerequisite": "(FI 311 or FI 311H) and (ACC 202 or ACC 230) and (STT 315 or STT 200 or STT 201 or STT 351 or STT 421 or STT 231 or STT 441)", "restrictions": "Open to juniors or seniors in the Eli Broad College of Business and The Eli Broad Graduate School of Management."}, "FI320": {"name": " Introduction to Finance", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Overview of finance for the non-business major. Stocks, bonds, mutual funds, financial statement analysis, capital budgeting, financial planning.", "restrictions": "Not open to students in the Accounting major or in the Business - Admitted major or in the Business-Preference major or in the Finance Major or in the Hospitality Business Major or in the Human Resource Management Major or in the Management Major or in the Marketing Major or in the Supply Chain Management Major.", "exclude": "FI 311"}, "FI321": {"name": " Theory of Investments", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Theoretical analysis of common stocks, bonds, options and futures. Tradeoff between risk and return, market efficiency, efficient portfolios and CAPM. Cash flow evaluation and option evaluation.", "prerequisite": "FI 311", "restrictions": "Open to juniors or seniors in the Actuarial Science Major or in the Actuarial Science Minor or in the Economics Major.", "exclude": "FI 312"}, "FI370": {"name": " Introduction to Wealth Management", "semester": "Fall of every year", "credits": " 3", "description": "Techniques used to develop and implement comprehensive plans to achieve a person’s overall financial objectives. Budgeting, liability management, investing, tax planning, risk management, employee benefits, retirement planning, and estate planning.", "prerequisite": "FI 311", "restrictions": "Open to juniors or seniors in the Eli Broad College of Business and The Eli Broad Graduate School of Management."}, "FI380": {"name": " Principles of Insurance and Risk Management", "semester": "Fall of every year", "credits": " 3", "description": "Overview of techniques for measuring and managing risk. Pure risks related to mortality, health-related expenses, property damage, and product liability. Management techniques studied include risk assumption, prevention, diversification, and transfer via insurance and non-insurance market mechanisms.", "prerequisite": "(FI 311 or FI 320) and (STT 200 or STT 201 or STT 231 or STT 315 or STT 351 or STT 421 or STT 441)", "restrictions": "Open to students in the Insurance and Risk Management Minor or approval of department."}, "FI393": {"name": " Introduction to International Business", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 3", "description": "Introduction to the context of international business delivered on-site in foreign settings. Fundamental concepts and principles of globalization such as multinational corporations, foreign markets and economies, internal and external market transactions, international law, cultural influences, and multinational business strategies.", "restrictions": "Open to students in the Eli Broad College of Business and The Eli Broad Graduate School of Management or in the School of Hospitality Business."}, "FI413": {"name": " Management of Financial Institutions", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": " 3", "description": "Management, decision-making and policy formulation for depository and non-depository financial institutions emphasizing commercial banking. Savings banks, credit unions and non-bank financial institutions including investment banks.", "prerequisite": "FI 311", "restrictions": "Open to students in the Eli Broad College of Business and The Eli Broad Graduate School of Management."}, "FI414": {"name": " Advanced Business Finance (W)", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": " 3", "description": "Advanced financial management of business firms. Theoretical analysis and case applications. Capital budgeting, capital structure, valuation, risk management, mergers, and corporate restructuring.", "prerequisite": "Completion of Tier I Writing Requirement and FI 311 and (FI 312 or FI 321)", "restrictions": "Open to seniors in the Eli Broad College of Business and The Eli Broad Graduate School of Management."}, "FI425": {"name": " Law and Economics (W)", "semester": "Fall of every year", "credits": " 3", "description": "Application of economic analysis to the law. Property rights, takings, the Coase Theorem. The economics of regulation, crime and punishments, liability law, and public choice.", "prerequisite": "(EC 251H or EC 301) and Completion of Tier I Writing Requirement"}, "FI444": {"name": " Entrepreneurial Finance", "semester": "Spring of every year", "credits": " 3", "description": "Financing, valuation and sale of entrepreneurial ventures. Business plans, financing sources, financial contracting, real options, staged investments, and exit strategies.", "prerequisite": "FI 311 or FI 320", "restrictions": "Open to juniors or seniors in the Eli Broad College of Business and The Eli Broad Graduate School of Management and open to juniors or seniors in the Entrepreneurship and Innovation Minor. Approval of department; application required."}, "FI451": {"name": " International Financial Management", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": " 3", "description": "Financial management of multinational firms. Theoretical and applied aspects of international capital budgeting, capital structure, cash management, asset pricing, and risk management. Cross-cultural and ethical considerations.", "prerequisite": "FI 311", "restrictions": "Open to juniors or seniors in the Eli Broad College of Business and The Eli Broad Graduate School of Management."}, "FI455": {"name": " Computer Applications in Financial Modeling", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": " 3", "description": "Development of computer spreadsheet-based models to analyze corporate financial strategies and valuation issues.", "prerequisite": "FI 311 and (FI 312 or concurrently)", "restrictions": "Open to students in the Finance major."}, "FI457": {"name": " Security Analysis", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Fundamental analysis of individual stocks. Discounted cash flow valuation, relative valuation, special situations. Management of a real-money stock portfolio, the Michigan State University Student Investment Fund.", "prerequisite": "FI 312", "restrictions": "Approval of department."}, "FI470": {"name": " Advanced Wealth Management", "semester": "Spring of every year", "credits": " 3", "description": "Advanced estate, tax and retirement planning. Client management, planning tools and software applications. Creation of a comprehensive financial plan.", "prerequisite": "FI 370", "restrictions": "Open to juniors or seniors in the Eli Broad College of Business and The Eli Broad Graduate School of Management."}, "FI473": {"name": " Debt and Money Markets", "semester": "Spring of every year", "credits": " 3", "description": "Role and nature of international debt and money markets. Corporate and government bond valuation, fixed income derivative instruments and bond portfolio management. Special role of \"time\" in debt and money markets.", "prerequisite": "FI 312", "restrictions": "Open to students in the Eli Broad College of Business and The Eli Broad Graduate School of Management."}, "FI478": {"name": " Investment Strategies and Speculative Markets", "semester": "Spring of every year", "credits": " 3", "description": "Pricing, trading strategies, hedging applications, and markets for forwards, futures, swaps, and options.", "prerequisite": "FI 311 and FI 312", "restrictions": "Open to juniors or seniors in the Eli Broad College of Business and The Eli Broad Graduate School of Management."}, "FI480": {"name": " Financial Risk Management", "semester": "Spring of every year", "credits": " 3", "description": "Ways in which risks are quantified and managed by financial institutions. Nature of financial institutions and their regulation, the Basel Accords, coherent risk measures, value at risk, copulas, credit risk, operational risk, liquidity risk, and the financial crisis of 2007.", "prerequisite": "(FI 311 or FI 320) and (STT 200 or STT 201 or STT 231 or STT 315 or STT 351 or STT 421 or STT 441) and FI 380", "restrictions": "Open to students in the Insurance and Risk Management Minor or approval of department."}, "FI481": {"name": " Crises, Insurance, and Risk Management", "semester": "Fall of every year", "credits": " 3", "description": "Various crises, including financial crises, and natural and man-made disasters. Repercussion of such crises on financial-industry and insurance regulations on the structures of the financial and insurance industries and on the products offered and on the pricing of these products.", "prerequisite": "(FI 311 or FI 320) and (STT 200 or STT 201 or STT 231 or STT 315 or STT 351 or STT 421 or STT 441)", "restrictions": "Open to students in the Insurance and Risk Management Minor or approval of department."}, "FI490": {"name": " Independent Study", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 3", "description": "Supervised independent study of special topics in finance.", "restrictions": "Open to seniors. Approval of department."}, "FI491": {"name": " Topics in Finance", "semester": "Fall of even years", "credits": "Variable from 1 to 4", "description": "Current and emerging issues in finance to supplement and enrich existing courses.", "prerequisite": "FI 311", "restrictions": "Open to juniors or seniors."}, "FI801": {"name": " Managerial Finance", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 3", "description": "Short-, intermediate- and long-term problems in Finance. Financial planning and control. Applications in domestic and international settings.", "restrictions": "Open to graduate students in the Eli Broad College of Business and The Eli Broad Graduate School of Management and not open to MBA students."}, "FI821A": {"name": " Cross Section and Panel Data Econometrics I", "semester": "Fall of every year", "credits": " 3", "description": "Analyses of systems of equations, panel data models, instrumental variables and generalized method of moments, M-estimation, quantile regression, maximum likelihood estimation, binary and multinomial response models, Tobit and two-part models, and other selected topics.", "prerequisite": "EC 820B", "alias": "EC 821"}, "FI821B": {"name": " Cross Section and Panel Data Econometrics II", "semester": "Spring of every year", "credits": " 3", "description": "Analyses of quasi-maximum likelihood estimation, count data models, fractional response models, duration models, sample selection and attrition, stratified sampling, estimating treatment effects, stochastic frontier models, and other advanced topics.", "prerequisite": "EC 821A"}, "FI822A": {"name": " Time Series Econometrics I", "semester": "Fall of every year", "credits": " 3", "description": "Analyses of time series regression, stationary time series analysis, ARMA models, Wold decomposition, spectral analysis, vector autoregressions, generalized method of moments, functional central limit theorem, nonstationary time series, unit root processes, cointegration, and other advanced topics.", "prerequisite": "EC 820B", "alias": "EC 822"}, "FI822B": {"name": " Time Series Econometrics II", "semester": "Spring of every year", "credits": " 3", "description": "Analyses of multivariate time series, time series volatility models, long memory, nonlinear time series models, and other advanced topics.", "prerequisite": "EC 822A"}, "FI844": {"name": " Corporate Financial Strategies", "semester": "Fall of every year", "credits": "Variable from 1 to 3", "description": "Applying financial strategies to managerial decision making.", "prerequisite": "MBA 832 or approval of department", "restrictions": "Open to MBA students or approval of department."}, "FI845": {"name": " Financial Modeling and Simulation I", "semester": "Fall of every year, Spring of every year", "credits": "Variable from 1 to 3", "description": "Applications of financial theory through computer modeling. Financial forecasting, cash flow modeling, and valuation.", "prerequisite": "MBA 832 or approval of department", "restrictions": "Open to master's students in the Finance major and open to MBA students or approval of department."}, "FI846": {"name": " Financial Modeling and Simulation II", "semester": "Fall of every year, Spring of every year", "credits": "Variable from 1 to 3", "description": "Application of financial theory using computer modeling. Portfolio optimization, risk measurement, and option pricing.", "prerequisite": "FI 845 or approval of department", "restrictions": "Open to master's students in the Finance major and open to MBA students or approval of department."}, "FI847": {"name": " Corporate Strategies and Risk Management", "semester": "Fall of every year", "credits": "Variable from 1 to 3", "description": "Identifying corporate strategies to help manage business, financing, and competitive risks. Case studies.", "prerequisite": "FI 844", "restrictions": "Open to master's students in the Finance major and open to MBA students or approval of department."}, "FI850": {"name": " Introduction to Investments I", "semester": "Spring of every year", "credits": "Variable from 1 to 3", "description": "Essential financial theories and quantitative tools related to the field of investments. Topics include behavior and distribution of stock returns, mean-variance optimization model of portfolio selection, basic asset pricing theories and market efficiency.", "prerequisite": "MBA 832 or approval of department", "restrictions": "Open to master's students in the Finance major and open to MBA students or approval of department."}, "FI851": {"name": " Introduction to Investments II", "semester": "Spring of every year", "credits": "Variable from 1 to 3", "description": "Investment management, portfolio performance evaluation, active portfolio management, essentials of bonds and derivatives, and essentials of international diversification.", "prerequisite": "FI 850 or approval of department", "restrictions": "Open to master's students in the Finance major and open to MBA students or approval of department."}, "FI852": {"name": " Financial Derivatives I", "semester": "Spring of every year", "credits": "Variable from 1 to 3", "description": "Introduction to pricing, trading strategies, and hedging applications of forward and futures contracts, swaps, and options.", "prerequisite": "FI 851 or approval of department", "restrictions": "Open to master's students in the Finance major and open to MBA students or approval of department."}, "FI853": {"name": " Debt and Money Instruments and Markets", "semester": "Fall of every year", "credits": "Variable from 1 to 3", "description": "Fixed-income security markets. Valuation of traded instruments.", "prerequisite": "MBA 832 and FI 851 or approval of department", "restrictions": "Open to master's students in the Finance major and open to MBA students or approval of department."}, "FI854": {"name": " Fixed Income Instruments", "semester": "Fall of every year", "credits": "Variable from 1 to 3", "description": "Advanced fixed income security models. Valuation of instruments traded using derivative securities pricing.", "prerequisite": "FI 853 or approval of department", "restrictions": "Open to master's students in the Finance major and open to MBA students."}, "FI855": {"name": " Financial Derivatives II", "semester": "Spring of every year", "credits": "Variable from 1 to 3", "description": "Derivatives pricing and applications to corporate securities, structured products, and credit default swaps.", "prerequisite": "FI 851 and FI 852 or approval of department", "restrictions": "Open to master's students in the Finance major and open to MBA students."}, "FI857": {"name": " Security Analysis and Portfolio Management", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Fundamental analysis of individual stocks. Discounted cash flow valuation, relative valuation, and special situations. Management of student-run investment fund.", "prerequisite": "FI 851", "restrictions": "Open to master's students in the Finance major and open to MBA students. Approval of department."}, "FI859": {"name": " Mergers and Acquisitions", "semester": "Fall of every year", "credits": "Variable from 1 to 3", "description": "Provides a broad overview of corporate mergers and acquisitions from the finance perspective.", "prerequisite": "MBA 832 or FI 801", "restrictions": "Open to master's students in the Finance major and open to MBA students or approval of department."}, "FI860": {"name": " Multinational Corporate Finance", "semester": "Fall of every year", "credits": "Variable from 1 to 3", "description": "Corporate financial management in a multinational setting.", "prerequisite": "MBA 832 or approval of department", "restrictions": "Open to master's students in the Finance major and open to MBA students or approval of department."}, "FI861": {"name": " International Financial Markets and Risk Management", "semester": "Fall of every year", "credits": "Variable from 1 to 3", "description": "Financial investments and risk management in a multinational setting.", "prerequisite": "MBA 832 or approval of department", "restrictions": "Open to master's students in the Finance major and open to MBA students."}, "FI862": {"name": " Corporate Strategy Valuation", "semester": "Spring of every year", "credits": "Variable from 1 to 3", "description": "Measuring and managing the valuation of corporate strategies.", "prerequisite": "MBA 832 or approval of department", "restrictions": "Open to master's students in the Finance major and open to MBA students or approval of department."}, "FI863": {"name": " Corporate Restructuring and Governance", "semester": "Fall of every year", "credits": "Variable from 1 to 3", "description": "Provides a broad overview of mergers, corporate restructuring, divestitures and bankruptcy from the finance perspective.", "prerequisite": "(MBA 832 or FI 801) and FI 859", "restrictions": "Open to master's students in the Finance major and open to MBA students."}, "FI865": {"name": " Corporate Real Options Valuation", "semester": "Spring of every year", "credits": "Variable from 1 to 3", "description": "Application of the real options methodology to analyze practical problems in corporate finance.", "prerequisite": "MBA 832 or approval of department", "restrictions": "Open to master's students in the Finance major and open to MBA students."}, "FI869": {"name": " Entrepreneurial Finance and Venture Capital", "semester": "Spring of every year", "credits": "Variable from 1 to 3", "description": "Introduction to the financing and valuation of entrepreneurial startups, venture capital and private equity. How to prepare a successful business plan to raise financing from venture capitalists. Structuring venture capital and private equity deals.", "prerequisite": "MBA 832 or FI 801", "restrictions": "Open to master's students in the Finance major and open to MBA students."}, "FI870": {"name": " Venture Capital and Private Equity", "semester": "Spring of every year", "credits": "Variable from 1 to 3", "description": "Advanced topics in the financing of entrepreneurial startups, venture capital and private equity. Valuation for entrepreneurial startups, venture capital and private equity, and institutions. Corporate venture capital. Venture capital investing and fundraising. Private equity investments. Sale of venture capital-backed entrepreneurial firms, and initial public equity offerings.", "prerequisite": "(MBA 832 or FI 801) and FI 869", "restrictions": "Open to master's students in the Finance major and open to MBA students or approval of department."}, "FI872": {"name": " Financial Data Analytics I", "semester": "Fall of every year", "credits": "Variable from 1 to 3", "description": "Introduction to the analysis of real-world financial data in a variety of settings. Applying textual analysis to large documents, identifying “sentiment” in Google search data, and back-testing trading strategies. Developing the programming skills necessary to both collect and prepare data for analysis. Identifying, downloading, cleaning, and shaping data.", "restrictions": "Open to MBA students or approval of department."}, "FI873": {"name": " Financial Data Analytics II", "semester": "Fall of every year", "credits": "Variable from 1 to 3", "description": "Advanced application of data analysis to finance. Automating data acquisition, to apply textual analysis to large documents and transcripts. Analyzing weather data, geographic data, corporate patent data, and posts on social media. Examining how the information in these databases is related to financial outcomes.", "prerequisite": "FI 872", "restrictions": "Open to MBA students or approval of department."}, "FI877": {"name": " Functions and Management of Financial Institutions", "semester": "Spring of every year", "credits": "Variable from 1 to 3", "description": "Origin, nature, structure, and management of financial institutions. Products and services offered, risks, and strategies. Applications in domestic and international settings.", "prerequisite": "MBA 832 or FI 801 or approval of department", "restrictions": "Open to master's students in the Finance major and open to MBA students or approval of department."}, "FI878": {"name": " Commercial Bank Management", "semester": "Spring of every year", "credits": "Variable from 1 to 3", "description": "Origin, nature, structure, and management of commercial banking. Products and services offered, risks, and strategies. Applications in domestic and international settings.", "prerequisite": "MBA 832 or FI 801 or approval of department", "restrictions": "Open to master's students in the Finance major and open to MBA students."}, "FI890": {"name": " Independent Study", "semester": "Fall of every year, Spring of every year", "credits": "Variable from 1 to 3", "description": "Faculty-guided research projects.", "restrictions": "Open to graduate students in the Eli Broad College of Business and The Eli Broad Graduate School of Management. Approval of department."}, "FI891": {"name": " Topics In Finance", "semester": "Fall of every year, Spring of every year", "credits": "Variable from 1 to 3", "description": "Current and emerging issues in corporate finance, investments, and financial modeling to supplement and enrich existing courses.", "prerequisite": "(FI 801 or MBA 832) or (PIM 841 and PIM 842)"}, "FI980": {"name": " Theory of Finance", "semester": "Fall of every year", "credits": " 3", "description": "Introduction to the financial theory of the firm. Theoretical models dealing with capital structure, cost of capital, dividend policy and leasing.", "restrictions": "Open only to doctoral students in the College of Business or approval of department."}, "FI981": {"name": " Corporate Finance Theory", "semester": "Spring of odd years", "credits": " 3", "description": "Theoretical foundations. Recent empirical research in capital structure, dividend policy, and agency theory.", "restrictions": "Open only to doctoral students in the College of Business."}, "FI982": {"name": " Investment Theory", "semester": "Spring of odd years", "credits": " 3", "description": "Market efficiency, stochastic processes, option pricing, efficient set mathematics, intertemporal asset pricing and arbitrage pricing theory.", "restrictions": "Open to doctoral students in the Eli Broad College of Business and The Eli Broad Graduate School of Management."}, "FI999": {"name": " Doctoral Dissertation Research", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 24", "description": "Doctoral dissertation research.", "restrictions": "Open to doctoral students in the Department of Finance."}}}