{"code": "FIM", "name": "Food Industry Management", "courses": {"FIM100": {"name": " Decision-making in the Agri-Food System", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Organization and operation of the agri-food system. Economic analysis of agri-food firms and consumers. Management functions and decision-making of agri-food firms.", "alias": "FSM 200"}, "FIM203": {"name": " Data Analysis for the Agri-Food System", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Introduction to data analysis tools used in the management of food systems.", "prerequisite": "(ABM 100) and (EC 201 or concurrently)", "restrictions": "Open to undergraduate students in the Agribusiness Management Major or in the Agribusiness Management Minor or in the Environmental Economics Minor or in the Environmental Economics and Management major or in the Food Industry Management Major or in the Food Industry Management Minor."}, "FIM210": {"name": " Professional Seminar in Food Industry Management", "semester": "Spring of every year", "credits": " 1", "description": "Industry trends in food industry management. Verbal, written, and visual communication techniques applied to professional situations, including professional development and career planning.", "restrictions": "Open to students in the Food Industry Management Major or in the Food Industry Management Minor."}, "FIM220": {"name": " Food Product Marketing", "semester": "Spring of every year", "credits": " 3", "description": "Structure of the food marketing system including food processors, manufacturers, retailers and food service. Impact of consumer behavior and buying patterns. International food product marketing. Strategic planning in food marketing.", "prerequisite": "ABM 100 or concurrently"}, "FIM222": {"name": " Agribusiness and Food Industry Sales", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Selling processes and activities within agribusiness and food firms. Principles and techniques of sales. Operation of sales organizations.", "prerequisite": "ABM 100 or EC 201 or EC 202", "restrictions": "Open to sophomores or juniors or seniors.", "alias": "FSM 320"}, "FIM224": {"name": " Information and Market Intelligence in the Agri-Food Industry", "semester": "Summer of every year", "credits": " 3", "description": "Researching agri-food issues, food industry business environments, and agri-food industry trends. Information gathering. Electronic library reference sources. Synthesis of data and information into market intelligence.", "prerequisite": "(ABM 100 or concurrently) or (EC 201 or concurrently)", "alias": "FIM 424"}, "FIM260": {"name": " World Food, Population and Poverty", "semester": "Fall of every year", "credits": " 3", "description": "Description and analysis of world food, population and poverty problems. Interrelationships between developed and developing countries.", "prerequisite": "ABM 100 or EC 201 or EEM 255", "alias": "EEP 260"}, "FIM303": {"name": " Economics of Decision Making in the Agri-Food System", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Managerial economics with applications focusing on agriculture, food, and resources issues.", "prerequisite": "(MTH 124 and EC 201 and EC 202 and ABM 203) and (STT 200 or STT 201 or STT 315)"}, "FIM335": {"name": " Food Marketing Management", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Management decision-making in food industry organizations (processors, wholesalers, retailers). Marketing and sales in response to customer and consumer needs. Distribution and merchandising systems in domestic and international contexts.", "prerequisite": "(FIM 220) and (MKT 327 or MKT 300) and ABM 203"}, "FIM351": {"name": " Retail Management", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": " 3", "description": "Domestic and international retailing structure, environment, and development. Managerial strategy. Locational, purchasing, organizational, personnel and promotional techniques. Retail budgeting and control. Social and ethical considerations.", "prerequisite": "MKT 300 or MKT 327", "restrictions": "Open to juniors or seniors in the Eli Broad College of Business and The Eli Broad Graduate School of Management or in the Food Industry Management major and open to students in the Food Industry Management Specialization.", "alias": "MSC 351"}, "FIM400": {"name": " Public Policy Issues in the Agri-Food System", "semester": "Spring of every year", "credits": " 3", "description": "Objectives, alternatives and consequences of public policy in the agri-food system. Analysis of economic implications for food and agribusiness firms, farmers, consumers and society.", "prerequisite": "EC 201 and EC 202", "restrictions": "Open to juniors or seniors.", "alias": "FSM 421"}, "FIM405": {"name": " Corporate Environmental Management (W)", "semester": "Spring of every year", "credits": " 3", "description": "Integration of environmental protection and pollution prevention with business management. Economic and strategic analysis of environmental protection.", "prerequisite": "(EEM 255) and (ACC 201 or ACC 230 or ABM 130) and ABM 203 and (((ABM 303 or EC 301) or approval of department) and completion of Tier I writing requirement)", "restrictions": "Open to juniors or seniors.", "alias": "PRM 405"}, "FIM410": {"name": " Advanced Professional Seminar in Food Industry Management", "semester": "Fall of every year", "credits": " 1", "description": "Advanced professional problems and reestablishment of career planning in the agri-food system. Industry trends, career alternatives, and job search strategies. Enhanced verbal, written, and visual communication techniques.", "prerequisite": "FIM 210", "restrictions": "Open to juniors or seniors in the Food Industry Management Minor or in the Food Industry Management Major."}, "FIM415": {"name": " Human Resource Management: Changes and Challenges", "semester": "Spring of every year", "credits": " 3", "description": "Human resource management strategies used in food industries. Changing demographics and labor force issues. Diversity, labor markets, regulations, employer policies, job analysis and staffing, compensation and benefits, motivation, performance appraisal, food labor unions, and cases.", "prerequisite": "ABM 100 or EC 201 or EC 202", "restrictions": "Open to juniors or seniors.", "exclude": "ABM 337"}, "FIM422": {"name": " Vertical Coordination in the Agri-Food System", "semester": "Fall of every year", "credits": " 3", "description": "Analysis of vertical coordination in the industrialized agri-food system. Agricultural cooperatives, contracts, marketing orders, and trade associations. Analysis of imperfect competition and methods of conducting business. Interaction with legal systems and government.", "prerequisite": "ABM 100 and ABM 203 and EC 201", "restrictions": "Open to juniors or seniors.", "alias": "FSM 443"}, "FIM427": {"name": " Global Agri-Food Industries and Markets", "semester": "Fall of every year", "credits": " 3", "description": "Strategic understanding of the international agri-food system. Analysis of global production, marketing, and consumption. Knowledge of changing conditions in international industries and markets. Global trends and opportunities.", "prerequisite": "(FIM 220 or ABM 225) and (EC 201 and EC 202) and ABM 203", "restrictions": "Open to juniors or seniors."}, "FIM439": {"name": " Strategic Management for Food and Agribusiness Firms (W)", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Principles and techniques for analyzing and implementing business and strategy. Approaches to identify and manage strategic problems. Application to firms in the food and agribusiness industries. Capstone project.", "prerequisite": "(FIM 220) and (ABM 130 or ABM 435 or FI 320 or ABM 303 or EC 301 or approval of department)", "restrictions": "Open to seniors."}, "FIM460": {"name": " Retail Information Systems", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Information needed to make effective retail decisions. Use of technology in collecting, analyzing, and interpreting retail systems data and in writing and presenting reports.", "prerequisite": "(FIM 220) and (MKT 327 or MKT 300) and ABM 203", "restrictions": "Open to juniors or seniors.", "alias": "HED 460, RET 460"}, "FIM490": {"name": " Independent Study in Food Industry Management", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 6", "description": "Independent supervised study in topics in food industry management.", "prerequisite": "ABM 100", "restrictions": "Not open to freshmen. Approval of department; application required. Students are limited to a combined total of 6 credits in ABM 490 and FIM 490.", "alias": "FSM 490"}, "FIM493": {"name": " Professional Internship in Food Industry Management", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 3", "description": "Supervised professional experience in the food industry.", "prerequisite": "(ABM 100)", "restrictions": "Open to undergraduate students in the Food Industry Management major. Approval of department; application required. A student may earn a maximum of 6 credits in all enrollments for any or all of these courses"}}}