{"code": "FLT", "name": "Foreign Language Teaching", "courses": {"FLT807": {"name": " Foreign Language Teaching Methods", "semester": "Fall of every year, Summer of every year", "credits": " 3", "description": "History of methods in foreign language instruction. Current practices in language teaching, materials design, and classroom management. Techniques in teaching culture, listening, speaking, reading, and writing at various levels of student proficiency in the foreign language. How to motivate and maintain motivation. Strategies instruction and targeting advanced proficiency.", "restrictions": "Open to graduate students in the Foreign Language Teaching Major or approval of department."}, "FLT808": {"name": " Assessment for Foreign Language Teaching", "semester": "Spring of every year", "credits": " 3", "description": "Classroom diagnostic and achievement assessment. Reliability and validity of language tests. Standardized and performance-based testing. Program-level assessment. Measuring language proficiency in listening, speaking, reading, writing, and grammar, and as integrated skills. Formative and summative assessment. Alternative assessment methods.", "restrictions": "Open to graduate students in the Foreign Language Teaching Major or approval of department.", "exclude": "LLT 808"}, "FLT815": {"name": " Teaching Culture in Foreign Language Courses", "semester": "Spring of every year", "credits": " 3", "description": "Methodologies for teaching culture in foreign language courses. Definitions of culture. Interrelatedness of language and culture. Application of theory to development of culture teaching strategies for any foreign language course.", "restrictions": "Open to graduate students in the Foreign Language Teaching Major or approval of department.", "alias": "AL 815"}, "FLT817": {"name": " Foreign Language Program Development and Administration", "semester": "Spring of every year", "credits": " 3", "description": "Current issues in language program administration and development. Practical application of theory in foreign language program development, marketing, articulation, technology integration, supervision, curriculum design, program evaluation, and teacher training.", "restrictions": "Open to graduate students in the Foreign Language Teaching Major or approval of department.", "alias": "AL 817"}, "FLT841": {"name": " Topics in Foreign Language Teaching", "semester": "Fall of odd years", "credits": " 3", "description": "Selected topics and issues in foreign language learning and teaching.", "restrictions": "Open to graduate students in the Foreign Language Teaching Major or approval of department.", "exclude": "LLT 841"}, "FLT842": {"name": " Teaching Reading in a Foreign Language", "semester": "Fall of even years", "credits": " 3", "description": "Topics and issues in teaching reading in a foreign language. Vocabulary development, syntax, fluency in reading, integrating reading skills with listening, speaking, and writing. Measurement of reading comprehension. Age appropriate reading instruction and literacy development. L1 transfer issues. Teaching reading to learners not literate in their L1.", "restrictions": "Open to graduate students in the Foreign Language Teaching Major or approval of department.", "exclude": "LLT 809"}, "FLT845": {"name": " Language Concepts for Foreign Language Teaching", "semester": "Fall of every year", "credits": " 3", "description": "Methodologies for teaching phonological, morphological, syntactic, lexical, discourse and pragmatic systems in foreign language courses.", "restrictions": "Open to graduate students in the Foreign Language Teaching Major or approval of department.", "alias": "AL 845"}, "FLT860": {"name": " Foreign Language Acquisition", "semester": "Spring of every year, Summer of every year", "credits": " 3", "description": "Factors in foreign language learning such as age, motivation, language input and interaction, social influences, the role of the native language, and language universals.", "restrictions": "Open to graduate students in the Foreign Language Teaching Major or approval of department.", "exclude": "LLT 860"}, "FLT881": {"name": " Teaching Foreign Language with Technology", "semester": "Fall of every year", "credits": " 3", "description": "Teaching a foreign language with technology. Web applications for online foreign language instruction, hybrid learning, and distance learning. Feedback in online environments, including within computer-mediated communication. Online materials development. Creating interaction online. Online task development, evaluation of online tasks. Creating foreign language class web pages.", "restrictions": "Open to graduate students in the Foreign Language Teaching Major or approval of department.", "exclude": "AL 881"}, "FLT885": {"name": " Experiential Module in Foreign Language Teaching", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 2 to 5", "description": "Experience in foreign language teaching and learning. Action research, community outreach, immersion, program administration, professional seminar, teaching practicum, technology enhancement, or service learning.", "restrictions": "Open to graduate students in the Foreign Language Teaching Major. Approval of department.", "exclude": "LLT 890"}, "FLT890": {"name": " Independent Study", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 6", "description": "Special projects arranged by an individual student and a faculty member in areas supplementing regular course offerings.", "restrictions": "Not open to graduate-professional students in the College of Arts and Letters or approval of department."}, "FLT898": {"name": " Master’s Comprehensive Foreign Language Teaching Portfolio Examination", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": " 1", "description": "Final comprehensive portfolio exam.", "restrictions": "Open to graduate students in the Foreign Language Teaching Major. Approval of department.", "exclude": "LLT 899"}}}