{"code": "FOR", "name": "Forestry", "courses": {"FOR101": {"name": " Michigan's Forests", "semester": "Spring of every year", "credits": " 3", "description": "Ecological, social and economic roles of Michigan's forests in historic and contemporary context. Geographic similarities and differences in forest resources."}, "FOR110": {"name": " Seminar on Contemporary Issues in Forests and the Environment", "semester": "Fall of every year", "credits": " 1", "description": "Role of forests in environmental quality and human well-being."}, "FOR202": {"name": " Introduction to Forestry", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Historical development of forestry. Forest growth, protection, management, and products. Relationship of national and world economy and policy to forestry. Emphasis on multiple uses of forests."}, "FOR204": {"name": " Forest Vegetation", "semester": "Fall of every year", "credits": " 3", "description": "Identification of common forest trees, shrubs, and herbaceous plants. Field trip required."}, "FOR212": {"name": " Introduction to Sustainable Bioproducts", "semester": "Spring of every year", "credits": " 3", "description": "Sustainable bioproducts derived from biomass, and their importance for sustainable societies."}, "FOR222": {"name": " Forestry Field Methods", "semester": "Fall of every year", "credits": " 2", "description": "Basic field techniques including forest survey methods, tree and forest measurements, GPS land navigation and orienteering."}, "FOR330": {"name": " Human Dimensions of Forests", "semester": "Spring of every year", "credits": " 3", "description": "Social factors underlying human decisions about and conflicts over forest resources. Societal and citizen values, knowledge and behavior with respect to forest resources. Forest governance, public participation, collaboration, conflict management and communication.", "prerequisite": "(ISS 210 or ISS 215 or ISS 220 or ISS 225) and completion of Tier I writing requirement", "restrictions": "Not open to freshmen."}, "FOR335": {"name": " Socioeconomics of Sustainable Bioproducts", "semester": "Spring of every year", "credits": " 3", "description": "Role of forest bioproducts in developing sustainable communities. Resource planning and availability for value added bioproducts. Bioproducts supply-chains analysis and principles of life cycle implementation.", "restrictions": "Not open to freshmen."}, "FOR340": {"name": " Forest Ecology", "semester": "Fall of every year", "credits": " 3", "description": "Ecological interactions crucial to the sustainable management of forest ecosystems. Plant resources, species interactions, succession, biodiversity, productivity, nutrient and carbon cycling, ecosystem structure and function, exotic species, global environmental change.", "prerequisite": "((CSS 210) and completion of Tier I writing requirement) and (PLB 105 or BS 162 or LB 144)", "alias": "FOR 404"}, "FOR340L": {"name": " Forest Ecology Laboratory", "semester": "Fall of every year", "credits": " 1", "description": "Field studies and data analysis of ecological processes central to the sustainable management of forest ecosystems. Field exercises cover primary production, community structure, soil resources, biodiversity, succession, nutrient cycling, critiques of primary literature. Weekend field trips required.", "prerequisite": "((CSS 210) and completion of Tier I writing requirement) and (FOR 340 or concurrently) and (PLB 105 or BS 162 or LB 144)", "alias": "FOR 404L"}, "FOR372": {"name": " Ecological Monitoring and Data Analysis", "semester": "Spring of every year", "credits": " 3", "description": "Design of ecological monitoring systems and analysis of resulting ecological data sets. Monitoring system design, model specification and implementation, and computational considerations from both a design- and model-based perspective. Hands-on introduction to statistical software.", "prerequisite": "((MTH 124 or MTH 132) and completion of Tier I writing requirement) and (STT 201 or STT 224 or STT 231 or STT 421)", "alias": "FOR 472"}, "FOR405": {"name": " Forest Ecosystem Services", "semester": "Spring of every year", "credits": " 3", "description": "Ecosystem services and their quantification and valuation. Sustainable management of forest ecosystem services. Global overview of non-timber forest products. Field trips required.", "prerequisite": "((MTH 124 or MTH 132) and completion of Tier I writing requirement) and EC 201", "restrictions": "Not open to freshmen or sophomores."}, "FOR406": {"name": " Applied Forest Ecology: Silviculture", "semester": "Fall of every year", "credits": " 3", "description": "Ecophysiology of tree growth and reproduction. Stand structure, composition and growth. Intermediate stand treatments. Natural and artificial reproduction. Silvicultural techniques.", "prerequisite": "((FOR 404 or concurrently) or (IBIO 355 or concurrently)) and completion of Tier I writing requirement", "restrictions": "Not open to freshmen or sophomores."}, "FOR406L": {"name": " Applied Forest Ecology: Silviculture Laboratory", "semester": "Fall of every year", "credits": " 1", "description": "Experiential learning about forest dynamics and their management. Field trips required.", "prerequisite": "(FOR 204 and FOR 222 and (FOR 406 or concurrently)) and completion of Tier I writing requirement", "restrictions": "Not open to freshmen or sophomores."}, "FOR407": {"name": " Diseases and Insects of Forest and Shade Trees", "semester": "Spring of every year", "credits": " 4", "description": "Diseases, insects, and environmental problems affecting trees in forests, parks, suburbs, and nurseries. Methods of control.", "prerequisite": "(PLB 105 or BS 162 or LB 144) and Completion of Tier I Writing Requirement", "alias": "BOT 407"}, "FOR412": {"name": " Wildland Fire", "semester": "Spring of every year", "credits": " 2", "description": "Fire in wildland forest and grassland communities as a physical and ecological process. Fire history, culture, and management. Global perspectives, strategies for prevention and suppression of wildfires. Techniques for using prescribed fire. Field trips required.", "prerequisite": "(FOR 404 or concurrently) or (IBIO 355 or concurrently)", "restrictions": "Not open to freshmen or sophomores."}, "FOR414": {"name": " Renewable Wood Products", "semester": "Fall of every year", "credits": " 3", "description": "Renewable wood products with focus on wood and wood based products. Tree growth and production of woody tissues, wood structure and identification, wood processing and utilization as timber, fiber and pulp product, composites and biofuel for energy. Physical and mechanical properties of wood and relations with practical applications.", "prerequisite": "(CEM 141) and completion of Tier I writing requirement", "restrictions": "Not open to freshmen or sophomores."}, "FOR419": {"name": " Applications of Geographic Information Systems to Natural Resources Management", "semester": "Spring of every year", "credits": " 4", "description": "Application of geographic information systems, remote sensing, and global positioning systems to integrated planning and management for fish, wildlife, and related resources."}, "FOR420": {"name": " Forestry Field Studies", "semester": "Summer of every year", "credits": " 3", "description": "Integration of tree biology, forest ecology, soil science, silviculture, forest mapping and inventory methods in a variety of forest ecosystems in Michigan. Quantitative and qualitative assessments of forests, defining silvicultural alternatives and executing a stand management plan. Field trips required.", "prerequisite": "FOR 204 and FOR 222 and FOR 404 and FOR 406 and CSS 210", "restrictions": "Open to juniors or seniors in the College of Agriculture and Natural Resources."}, "FOR427": {"name": " Biomass and Bioproducts Chemistry", "semester": "Spring of every year", "credits": " 3", "description": "Chemistry of wood, engineered composites and bioproducts. Chemical characterization of biopolymers from woody biomass and bioproducts. Analytical methods related to bioproducts chemistry.", "prerequisite": "CEM 141 or CEM 151 or LB 171", "restrictions": "Not open to freshmen."}, "FOR441": {"name": " Plant Breeding and Biotechnology", "semester": "Spring of even years", "credits": " 3", "description": "Plant improvement by genetic manipulation. History of plant breeding. Traditional and biotechnological means of improving plant cultivars by genetic manipulation. Importance of plant breeding to our food system, economy, and environment.", "prerequisite": "(CSS 350 or concurrently) or (IBIO 341 or concurrently)"}, "FOR451": {"name": " Biotechnology Applications for Plant Breeding and Genetics", "semester": "Spring of every year", "credits": " 3", "description": "Principles, concepts, and techniques of agricultural plant biotechnology. Recombinant DNA technology, plant molecular biology and transformation in relation to plant improvement.", "prerequisite": "CSS 350 or IBIO 341", "restrictions": "Open to juniors or seniors or graduate students."}, "FOR452": {"name": " Watershed Concepts", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": " 3", "description": "Watershed hydrology and management. The hydrologic cycle, water quality, aquatic ecosystems, and social systems. Laws and institutions for managing water resources.", "alias": "ESA 452, RD 452, CSUS 452"}, "FOR461": {"name": " Urban and Community Forestry", "semester": "Spring of every year", "credits": " 3", "description": "Biological, physical, administrative, managerial, legal and social concepts unique to managing urban and community forests.", "prerequisite": "HRT 213 and HRT 213L", "restrictions": "Not open to freshmen or sophomores."}, "FOR462": {"name": " Forest Resource Economics and Management", "semester": "Spring of every year", "credits": " 4", "description": "Economic concepts, analytical techniques, computer simulation/forecasting models, and geographic information systems to assess economic and ecological impacts of resource management decisions at a range of spatial and temporal scales. Geospatial tools, multiple ownerships. Individual forest stands to complex multi-use landscape scales.", "prerequisite": "((EC 201) and completion of Tier I writing requirement) and (MTH 124 or MTH 132) and (STT 201 or STT 224 or STT 231 or STT 421)", "restrictions": "Not open to freshmen or sophomores."}, "FOR465": {"name": " Environmental and Natural Resource Law", "semester": "Fall of every year", "credits": " 3", "description": "Legal principles and process related to the environment and natural resources. Common law, constitutional law, statutory and administrative law.", "prerequisite": "CSUS 200 or EEM 255", "restrictions": "Open to juniors or seniors or graduate students.", "alias": "ESA 430, RD 430"}, "FOR466": {"name": " Natural Resource Policy", "semester": "Spring of every year", "credits": " 3", "description": "Natural resources policy-making in the context of scientific, environmental, social, and legal-institutional factors. Historical evolution of policies and case studies of contemporary policy issues.", "restrictions": "Not open to freshmen or sophomores."}, "FOR467": {"name": " BioEnergy Feedstock Production", "semester": "Fall of every year", "credits": " 3", "description": "Agronomic, economic, technological, and environmental principles involved in bioenergy feedstock production. Cultivation, harvest, transportation, and storage of agricultural and forest biomass.", "prerequisite": "MTH 103 or MTH 116 or MTH 124 or MTH 132 or LB 118 or MTH 152H or MTH 133 or MTH 153H or LB 119"}, "FOR479": {"name": " Wood and Engineered Composites Science and Technologies", "semester": "Spring of every year", "credits": " 3", "description": "Sciences and technologies governing industrial and manufacturing processes for lumber, engineered wood, and composite wood products.", "prerequisite": "FOR 414 or concurrently"}, "FOR486": {"name": " Biotechnology in Agriculture: Applications and Ethical Issues", "semester": "Fall of even years", "credits": " 3", "description": "Current and future roles of biotechnology in agriculture", "prerequisite": "BS 161 or PLB 105", "restrictions": "Not open to freshmen or sophomores."}, "FOR490": {"name": " Independent Study in Forestry", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 3", "description": "Special problems course for students qualified for advanced study in some phase of forestry.", "restrictions": "Open to seniors. Approval of department."}, "FOR491": {"name": " Special Topics in Forestry", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 4", "description": "Selected topics of current interest and importance in forestry.", "restrictions": "Not open to freshmen."}, "FOR493": {"name": " Professional Internship in Forestry", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 3", "description": "Supervised professional experiences in agencies, organizations and businesses related to forestry.", "prerequisite": "Completion of Tier I Writing Requirement", "restrictions": "Open to juniors or seniors in the Department of Forestry. Approval of department; application required."}, "FOR802": {"name": " Forest Science Research", "semester": "Fall of every year", "credits": " 2", "description": "The philosophy, nature, and procedures of research in the forestry sciences."}, "FOR804": {"name": " Forest Ecology", "semester": "Fall of odd years", "credits": " 3", "description": "Processes controlling population, community, ecosystem, landscape, and global ecology of forested systems. Extrapolation across scales, succession, spatial models of forest dynamics, causes and consequences of biodiversity, nutrient cycling, sustainability of managed ecosystems and human-accelerated environmental change."}, "FOR819": {"name": " Advanced Plant Breeding", "semester": "Fall of even years", "credits": " 3", "description": "Genetic expectations resulting from breeding strategies with cross- and self-pollinated crop plants. Germplasm collections, mapping populations, and modifications of reproductive biology useful for crop improvement."}, "FOR820": {"name": " Plant Reproductive Biology and Polyploidy", "semester": "Spring of odd years", "credits": " 1", "description": "Genetic processes underlying variations in plant reproductive biology and polyploidy. Utilization of these characteristics in plant breeding."}, "FOR826": {"name": " International Development: Theory and Practice", "semester": "Spring of every year", "credits": " 3", "description": "Evolution of international development theory across disciplines. Changing conceptualizations, measurements, processes and effects of development and poverty. Ethnicity, social class, gender, and community influences on socioeconomic processes. Current issues, concerns, and strategic alternatives.", "alias": "ACR 826, RD 826"}, "FOR829": {"name": " Economics of Environmental Resources", "semester": "Spring of every year", "credits": " 3", "description": "Economic principles, theoretical models, and empirical methods related to environmental problems and policy interventions. Applications to air, land, water, forests, energy, fish and wildlife, and climate change, including in developing countries.", "alias": "AEC 829"}, "FOR831": {"name": " Forest Biogeochemistry and Global Climate Change", "semester": "Fall of every year", "credits": " 3", "description": "Biogeochemical cycling of carbon and nutrients within forest ecosystems. Disturbance, harvesting and forest management effects on the exchange of greenhouse gases between forest ecosystems and the atmosphere."}, "FOR833": {"name": " Human Dimensions of Forest Carbon Management", "semester": "Spring of every year", "credits": " 3", "description": "Social dimensions associated with the development and implementation of forest-based climate change mitigation projects, including"}, "FOR835": {"name": " Forest Carbon Policy, Economics and Finance", "semester": "Fall of every year", "credits": " 3", "description": "Policy, economic and financial dimensions of the development and implementation of forest-based climate change mitigation projects, including"}, "FOR837": {"name": " Measurement and Monitoring of Forest Carbon", "semester": "Spring of every year", "credits": " 3", "description": "Skill-based training in forest carbon inventory and carbon accounting methods. National and international monitoring of forest carbon stocks. Applications of remote sensing and geospatial technologies to forest carbon inventory."}, "FOR840": {"name": " Agroforestry Systems", "semester": "Fall of every year", "credits": " 3", "description": "Agroforestry systems with a local and global perspectives, abbreviate biological and chemical processes in agroforestry ecosystems, effects and potential of agroforestry on forest dependent communities, climate change and ecosystem sustainability. Field trips required."}, "FOR858": {"name": " Gender, Justice and Environmental Change : Issues and Concepts", "semester": "Fall of every year", "credits": " 3", "description": "Issues and concepts related to gender, ecology, and environmental studies. Key debates and theoretical approaches to addressing environmental issues from a gender and social justice perspective. Gender and environment issues and processes from a global perspective."}, "FOR859": {"name": " Gender, Justice, and Environmental Change: Methods and Application", "semester": "Spring of every year", "credits": " 3", "description": "Methods and case studies related to gender, ecology, and environmental studies. Methodological and fieldwork issues from a feminist perspective in international and intercultural contexts. Qualitative and quantitative methods for integrating social and environmental data."}, "FOR870": {"name": " Spatial Ecology", "semester": "Fall of every year", "credits": " 3", "description": "Science of understanding and predicting ecological patterns in space."}, "FOR875": {"name": " R Programming for Data Sciences", "semester": "Summer of every year", "credits": " 3", "description": "Programming in R and use of associated open source tools. Addressing practical issues in documenting workflow, data management, and scientific computing."}, "FOR885": {"name": " Leadership in Natural Resources and Environmental Management", "semester": "Fall of odd years", "credits": " 3", "description": "Theory and practice of leadership in natural resource and environmental management. Integration across disciplinary and jurisdictional divisions."}, "FOR890": {"name": " Special Problems", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 5", "description": "Advanced individual study in an area of forestry.", "restrictions": "Approval of department; application required."}, "FOR891B": {"name": " Selected Topics in Plant Breeding and Genetics", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 2", "description": "Selected topics in plant breeding.", "restrictions": "Open only to graduate students in the Plant Breeding and Genetics major or Genetics major. Approval of department."}, "FOR892": {"name": " Plant Breeding and Genetics Seminar", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": " 1", "description": "Experience in review, organization, oral presentation, and analysis of research."}, "FOR898": {"name": " Master's Professional Project", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 6", "description": "Master's project, non-thesis research, practicum or other professional development capstone experiences.", "restrictions": "Approval of department."}, "FOR899": {"name": " Master's Thesis Research", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 10", "description": "Master's thesis research."}, "FOR923": {"name": " Advanced Environmental Economics", "semester": "Fall of every year", "credits": " 3", "description": "Advanced economic theory of environmental management and policy. Treatment of externalities and market and non-market approaches to environmental improvement. Applications to research and policy.", "alias": "AEC 923"}, "FOR941": {"name": " Quantitative Genetics in Plant Breeding", "semester": "Spring of even years", "credits": " 3", "description": "Theoretical and genetic basis of statistical analysis of quantitative traits using genetic markers. Computational tools for the study of quantitative traits."}, "FOR999": {"name": " Doctoral Dissertation Research", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 24", "description": "Doctoral dissertation research.", "restrictions": "Open to doctoral students in the College of Agriculture and Natural Resources or in the Department of Forestry or in the Forestry Major. Approval of department; application required."}}}