{"code": "FSC", "name": "Food Science", "courses": {"FSC111": {"name": " Foundational Concepts in Food Processing and Technology", "semester": "Fall of every year", "credits": " 3", "description": "Principles of food chemistry, microbiology, and physical science.", "restrictions": "Open to students in the Institute of Agricultural Technology."}, "FSC112": {"name": " Seminar in Food Processing, Technology and Safety", "semester": "Fall of every year", "credits": " 1", "description": "Communication, organization, and time management skills for the food processing industry.", "restrictions": "Open to students in the Institute of Agricultural Technology."}, "FSC113": {"name": " Basic Commodity Overview of Food Processing and Technology", "semester": "Fall of every year", "credits": " 3", "description": "Principles of food processing continuum. Production, through processing, to distribution.", "restrictions": "Open to students in the Institute of Agricultural Technology."}, "FSC114": {"name": " Food Processing and Technology Facilities Management", "semester": "Spring of every year", "credits": " 3", "description": "Food facility design and layout. Cleaning and sanitation systems, standards, and regulations. Total quality management principles.", "prerequisite": "FSC 125 or concurrently", "restrictions": "Open to students in the Institute of Agricultural Technology."}, "FSC125": {"name": " Food Processing and Technology Unit Operations", "semester": "Spring of every year", "credits": " 2", "description": "Operations to prepare, process, and preserve a variety of food products and their effects of food processing on quality and shelf life.", "prerequisite": "FSC 111", "restrictions": "Open to students in the Institute of Agricultural Technology."}, "FSC211": {"name": " Principles of Food Science", "semester": "Fall of every year, Summer of every year", "credits": " 3", "description": "Scientific principles, historical perspective, and current status of technology related to food composition, safety, toxicology, processing, preservation, and distribution."}, "FSC222": {"name": " Professional Development and Career Planning in Food Science", "semester": "Fall of every year", "credits": " 1", "description": "Career opportunities in food science; training in oral, written, and visual communication skills for professional development.", "prerequisite": "FSC 211 or concurrently", "restrictions": "Open to students in the Food Science Major."}, "FSC230": {"name": " Fruit and Vegetable Processing", "semester": "Fall of every year", "credits": " 2", "description": "Concepts and operations of the handling, preservation, and processing of fruit and vegetable crops", "prerequisite": "FSC 125 and (FSC 242 or concurrently)", "restrictions": "Open to students in the Institute of Agricultural Technology."}, "FSC231": {"name": " Cereals Processing", "semester": "Spring of every year", "credits": " 2", "description": "Classification and composition of major cereal crops. Milling processes and cereal product manufacturing.", "prerequisite": "FSC 125 and (FSC 242 or concurrently)", "restrictions": "Open to students in the Institute of Agricultural Technology."}, "FSC232": {"name": " Dairy Foods Processing", "semester": "Fall of every year", "credits": " 2", "description": "Handling and processing of milk and milk products.", "prerequisite": "FSC 125 and (FSC 242 or concurrently)", "restrictions": "Open to students in the Institute of Agricultural Technology."}, "FSC233": {"name": " Muscle Foods Processing", "semester": "Spring of every year", "credits": " 2", "description": "Manufacturing practices and principles of fresh, frozen, and cured meats.", "prerequisite": "FSC 125 and (FSC 242 or concurrently)", "restrictions": "Open to students in the Institute of Agricultural Technology."}, "FSC240": {"name": " Applied Microbiology in Food Processing and Technology", "semester": "Spring of every year", "credits": " 2", "description": "Microorganisms in food processing with emphasis on ecological, physiological, and public health aspects. Principles and practices to prevent food spoilage and food-borne outbreaks.", "prerequisite": "FSC 111", "restrictions": "Open to students in the Institute of Agricultural Technology."}, "FSC241": {"name": " Safety Principles and Regulations in Food Processing and Technology", "semester": "Fall of every year", "credits": " 3", "description": "Hazard Analysis Critical Control Points (HACCP), risk-based preventive controls, process validation, and statistical applications in food safety.", "prerequisite": "FSC 240", "restrictions": "Open to students in the Institute of Agricultural Technology."}, "FSC242": {"name": " Applied Chemistry in Food Processing and Technology", "semester": "Fall of every year", "credits": " 2", "description": "Chemical changes in foods as a result of formulation, processing, and storage.", "prerequisite": "FSC 111", "restrictions": "Open to students in the Institute of Agricultural Technology."}, "FSC310": {"name": " Sensory Analysis and Consumer Research", "semester": "Fall of every year", "credits": " 3", "description": "Discriminative, affective and descriptive methods used to evoke, measure, analyze, and interpret sensory reactions to food characteristics and consumer needs.", "prerequisite": "(FSC 211 or HNF 150) and (STT 200 or STT 201 or STT 315 or STT 421 or STT 464)", "restrictions": "Open to undergraduate students in the Department of Food Science and Human Nutrition.", "alias": "FSC 410"}, "FSC325": {"name": " Food Processing: Unit Operations", "semester": "Spring of every year", "credits": " 3", "description": "Principles, technologies, and applications in conversion of raw products into high quality foods. Unit operations", "prerequisite": "FSC 211 or ANS 201", "alias": "FSC 229, FSC 339"}, "FSC342": {"name": " Food Safety and Hazard Analysis Critical Control Point Program", "semester": "Fall of every year", "credits": " 3", "description": "Sources of microbiological, chemical and physical hazards; minimizing microbial growth and survival; good manufacturing, cleaning and sanitation practices; Hazard Analysis Critical Control Point Programs in food processing and food service."}, "FSC401": {"name": " Food Chemistry", "semester": "Spring of every year", "credits": " 3", "description": "Organic and biological reactions of food constituents. Chemical changes in foods during processing and storage affecting texture, color, flavor, stability, and nutritive qualities.", "prerequisite": "BMB 200 or CEM 352 or (BMB 401 or concurrently)", "restrictions": "Not open to freshmen or sophomores."}, "FSC402": {"name": " Food Chemistry Laboratory", "semester": "Spring of every year", "credits": " 1", "description": "Chemical changes in food constituents which affect stability of food products and properties such as color, flavor and texture.", "prerequisite": "(FSC 401 or concurrently) and completion of Tier I writing requirement"}, "FSC420": {"name": " Quality Assurance", "semester": "Fall of every year", "credits": " 2", "description": "Theory and application of quality assurance programs for food processing industries.", "prerequisite": "(STT 200 or STT 201 or STT 231 or STT 315 or STT 351) and ((FSC 211 or concurrently) or (ANS 201 or concurrently) or (HRT 204 or concurrently))", "restrictions": "Open to juniors or seniors or graduate students in the Department of Food Science and Human Nutrition."}, "FSC421": {"name": " Food Laws and Regulations", "semester": "Spring of odd years, Summer of even years", "credits": " 3", "description": "Adoption, interpretation, and enforcement of laws and regulations governing food processing and foodservice systems. Impact of regulation on food production, availability, marketing, and safety.", "prerequisite": "HNF 150 or FSC 211 or ABM 100"}, "FSC422": {"name": " Advanced Professional Seminar in Food Science", "semester": "Spring of every year", "credits": " 1", "description": "Preparation for success in food science careers, marketing tools, business communication skills, and contemporary topics in food science.", "prerequisite": "FSC 222", "restrictions": "Open to students in the Food Science Major."}, "FSC429": {"name": " Fundamentals of Food Engineering", "semester": "Spring of every year", "credits": " 3", "description": "Definition and measurement of food properties, thermodynamics, fluid mechanics, heat transfer, and mass transfer.", "prerequisite": "(FSC 325) and (MTH 124 or MTH 132 or LB 118 or MTH 152H) and (PHY 231 or PHY 183 or PHY 193H or LB 273)", "restrictions": "Not open to students in the College of Engineering.", "alias": "BE 329"}, "FSC430": {"name": " Food Processing: Fruits and Vegetables", "semester": "Fall of every year", "credits": " 3", "description": "Fruit and vegetable composition and quality indices. Harvest technology, post-harvest physiology, and preparatory systems. Principles and applications of thermal processing, freezing, and specialized techniques.", "prerequisite": "(FSC 211) and (FSC 325 or BE 350)", "restrictions": "Not open to freshmen or sophomores.", "alias": "FSC 330"}, "FSC431": {"name": " Food Processing: Cereals", "semester": "Spring of every year", "credits": " 3", "description": "Classification and composition of cereals. Milling processes. Cereal product manufacture.", "prerequisite": "(FSC 211) and (FSC 325 or BE 350)", "restrictions": "Not open to freshmen or sophomores.", "alias": "FSC 331"}, "FSC432": {"name": " Food Processing: Dairy Foods", "semester": "Fall of every year", "credits": " 3", "description": "Principles for production and processing of safe and wholesome dairy foods. Practical experience in safety and quality assurance systems and in the processing of fluid milk, cultured products, cheese, and frozen desserts.", "prerequisite": "(FSC 211) and (FSC 325 or BE 350)", "restrictions": "Not open to freshmen or sophomores.", "alias": "FSC 332"}, "FSC433": {"name": " Food Processing: Muscle Foods", "semester": "Spring of every year", "credits": " 3", "description": "Manufacturing practices and principles of fresh, frozen, and cured meats and fish. Processed products from muscle foods. Product formulation and quality control.", "prerequisite": "(FSC 211) and (FSC 325 or BE 350)", "restrictions": "Not open to freshmen or sophomores.", "alias": "FSC 333"}, "FSC440": {"name": " Food Microbiology", "semester": "Fall of every year", "credits": " 3", "description": "Major groups of microorganisms of importance to the food industry. Ecological, physiological, and public health aspects.", "prerequisite": "(MMG 201 or MMG 301) and completion of Tier I writing requirement.", "restrictions": "Not open to freshmen."}, "FSC441": {"name": " Food Microbiology Laboratory", "semester": "Fall of every year", "credits": " 2", "description": "Methods for studying major groups of microorganisms important to the food industry. Isolation, enumeration, characterization, identification, and use of microorganisms.", "prerequisite": "(FSC 440 or concurrently) and completion of Tier I writing requirement", "alias": "MPH 441"}, "FSC442": {"name": " Hazard Analysis Critical Control Point Training and Certification", "semester": "Fall of every year", "credits": " 1", "description": "Design and implementation of Hazard Analysis Critical Control Point (HACCP) programs for the food industry. Offered second half of semester.", "prerequisite": "(FSC 325) and (MMG 301 or concurrently)", "restrictions": "Open to juniors or seniors."}, "FSC455": {"name": " Food and Nutrition Laboratory", "semester": "Fall of every year", "credits": " 3", "description": "Principles and application of analytical techniques. Analysis for fats, proteins, carbohydrates, minerals, vitamins, and additives. Techniques include spectroscopy, fluorimetry, chromatography, electrophoresis, and proximate composition.", "prerequisite": "((BMB 200 or concurrently) or (BMB 401 or concurrently) or (BMB 461 or concurrently)) and completion of Tier I writing requirement"}, "FSC470": {"name": " Integrated Approaches to Food Product Development", "semester": "Spring of every year", "credits": " 3", "description": "Food product development including obtaining, screening, and selecting ideas. Integration of food processing, chemistry, analysis, and microbiology for the design, production, and evaluation of a food product.", "prerequisite": "FSC 310 and FSC 401 and FSC 440", "restrictions": "Open to seniors or graduate students."}, "FSC475": {"name": " International Studies in Food Science", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 2 to 6", "description": "Education abroad experience. Contemporary problems affecting food science and human nutrition in world, national and local communities.", "prerequisite": "HNF 150 or FSC 211", "restrictions": "Approval of department; application required."}, "FSC477": {"name": " Food Engineering: Fluids", "semester": "Fall of every year", "credits": " 3", "description": "Unit operations, process engineering, equipment, and industrial practices of the food industry. Manufactured dairy products", "prerequisite": "BE 350 and BE 351 and BE 360", "alias": "FE 465"}, "FSC481": {"name": " Fermented Beverages", "semester": "Fall of every year", "credits": " 3", "description": "Origin and history of alcoholic beverages produced by fermentation; types of products and methods of production; relationships among agricultural practices, processing and sensory attributes; responsible consumption of alcoholic beverages.", "restrictions": "Open to juniors. Approval of department."}, "FSC482": {"name": " Science and Technology of Wine Production", "semester": "Fall of every year", "credits": " 3", "description": "Origin and history of wine and wine production. Determination and timing of harvest, methods of postharvest handling, storage, and processing of grapes into juice and wine. Physical and chemical changes in wine and processes. Analysis of must and its adjustment, fermentation, fining, and aging. Physiology of yeasts and bacteria involved in winemaking and spoilage. Cellar practices, problems, and operations.", "prerequisite": "CEM 143 or CEM 251 or CEM 351", "restrictions": "Open to seniors or graduate students in the Department of Biosystems and Agricultural Engineering or in the Department of Chemical Engineering and Materials Science or in the Department of Chemistry or in the Department of Food Science and Human Nutrition or in the Department of Horticulture or in the Department of Microbiology and Molecular Genetics or in the Lyman Briggs Chemistry Coordinate Major. Approval of department."}, "FSC483": {"name": " Brewing and Distilled Beverage Technology", "semester": "Spring of every year", "credits": " 3", "description": "Raw materials for fermentation and basics of alcohol fermentation, beer and cider production; basics of distillation; brandy and eau de vie production; whiskey production; vodka, gin and flavored spirits production; flavor chemistry", "prerequisite": "CHE 311 or (ME 410 or concurrently) or BE 350 or (BE 429 or concurrently) or (FSC 325 or concurrently)", "restrictions": "Approval of department."}, "FSC490": {"name": " Special Problems in Food Science", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 3", "description": "Individual study of selected topics in food science. Supervised independent study.", "restrictions": "Not open to sophomores. Approval of department; application required."}, "FSC493": {"name": " Professional Internship in Food Science", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 6", "description": "Supervised professional experiences in agencies and businesses related to food science.", "restrictions": "Open to juniors or seniors in the Food Science major. Approval of department; application required. A student may earn a maximum of 6 credits in all enrollments for any or all of these courses"}, "FSC803": {"name": " Advanced Food Chemistry", "semester": "Spring of even years", "credits": " 3", "description": "Carbohydrates, proteins, and lipids. Purification, structural characterization, chemical reactions, and functional properties of these components in food systems.", "alias": "FSC 801, FSC 802"}, "FSC807": {"name": " Advanced Food Toxicology", "semester": "Fall of even years", "credits": " 3", "description": "Toxicology related to food safety. Metabolism of toxicants as influenced by food constituents, mutagenesis, and chemical carcinogenesis. Risk assessment.", "restrictions": "Approval of department."}, "FSC810": {"name": " International Food Laws and Regulations", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Survey of food laws of various countries and regions.", "alias": "ANR 810"}, "FSC811": {"name": " U.S. Food Laws and Regulations", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Surveys the laws and regulations governing the manufacture, distribution and sale of food products in the United States, the regulation of foods and food additives, genetic modification of food, food safety and HACCP, civil and criminal liability for defective products, inspections, labeling, importation, exportation, and current issues of concern.", "alias": "ANR 811", "exclude": "FSC 421"}, "FSC812": {"name": " Food Laws and Regulations in the European Union", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Introduction to the European Union (EU), the role of case law, official controls, the European Food Safety Authority, food labeling, food additives, food fortification, genetically modified foods, organic foods, imports, food safety, inspections, enforcement and compliance, and the role of science in EU food law."}, "FSC813": {"name": " Food Laws and Regulations in Latin America", "semester": "Fall of every year, Summer of every year", "credits": " 3", "description": "Current issues that have shaped Latin American food regulation. Overview of regional characteristics. Basic food laws, agency responsibilities, product registration requirements, basic standards, food labeling, food safety, food additives, and food importation. Trade issues, international organizations, and commercial agreements.", "exclude": "LAW 810G"}, "FSC814": {"name": " Food Laws and Regulations in Canada", "semester": "Spring of every year", "credits": " 3", "description": "Canadian regulatory framework. Labeling and advertising rules under the Canadian Food and Drug Act and other statutes. Food additives, food supplements and food fortification. Regulation of novel foods and genetically modified foods, organic foods and food irradiation. Inspection and related food safety programs. Food recalls. Compliance and enforcement. Food importation."}, "FSC815": {"name": " Food Laws and Regulations in China", "semester": "Summer of every year", "credits": " 3", "description": "Current issues that have shaped the regulation of food in China, regional characteristics and culture, food laws, agency responsibilities, product registration requirements, basic standards, food labeling, food safety, food additives, and food import systems.", "exclude": "LAW 810J"}, "FSC816": {"name": " Codex Alimentarius - The Food Code", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "How Codex Alimentarius formulates and harmonizes food standards for hygiene, contaminants, food additives, veterinary drugs, and pesticide residues, including its role in the World Trade Organization (WTO) Sanitary and Phytosanitary (SPS) and Technical Barriers to Trade (TBT) Agreements."}, "FSC817": {"name": " Animal Health, World Trade and Food Safety (OIE): Challenges and Opportunities", "semester": "Fall of every year", "credits": " 3", "description": "Examines the history, objectives, rules and operations of the World Organization for Animal Health (OIE), regarding global animal health, animal welfare, world trade, and food safety."}, "FSC820": {"name": " Regulatory Leadership in Food Law", "semester": "Spring of every year", "credits": " 3", "description": "Introduction to regulatory affairs through the regulation of food.", "exclude": "LAW 810U"}, "FSC821": {"name": " Wine, Beer, and Spirits Laws and Regulations", "semester": "Spring of even years", "credits": " 3", "description": "Laws, regulations, and policies that govern alcoholic beverages in the United States.", "exclude": "LAW 810Y"}, "FSC823": {"name": " Diet and Immune Function", "semester": "Spring of odd years", "credits": " 3", "description": "Influence of diet on the immune system and relationship to infectious and non-infectious diseases, adverse reactions such as food allergy, and alcohol and substance abuse. Methods to evaluate immune function."}, "FSC842": {"name": " Foodborne Diseases", "semester": "Spring of odd years", "credits": " 3", "description": "Epidemiology, isolation, characterization, clinical manifestations, pathogenicity, incidence and control of bacterial, parasitic and viral foodborne pathogens and associated toxins."}, "FSC843": {"name": " Exposure Science and Environmental Epidemiology", "semester": "Spring of odd years", "credits": " 3", "description": "Human exposure to chemicals in food and the environment and its relationship to health and illness. Applied concepts in toxicology, exposure assessment, environmental epidemiology, and risk assessment."}, "FSC844": {"name": " Risk Assessment of Foodborne Chemicals and Toxins", "semester": "Spring of even years", "credits": " 3", "description": "Human health risk assessment, including hazard identification, dose-response and exposure assessment, and risk characterization. Application to food safety and environmental risks."}, "FSC851": {"name": " The Law of the Foreign Supplier Verification Program Rule", "semester": "Summer of odd years", "credits": " 3", "description": "Legal perspective of FDA's Foreign Supplier Verification Program of the Food Safety Modernization Act.", "exclude": "LAW 810V"}, "FSC852": {"name": " The Law of the Preventive Controls for Human Food Rule", "semester": "Fall of odd years", "credits": " 3", "description": "Legal perspective of FDA’s Preventive Controls for Human Food Rule of the Food Safety Modernization Act.", "exclude": "LAW 810W"}, "FSC853": {"name": " The Law of the Produce Safety Rule", "semester": "Fall of even years", "credits": " 3", "description": "Legal perspective of FDA’s Produce Safety Rule of the Food Safety Modernization Act.", "exclude": "LAW 810X"}, "FSC890": {"name": " Special Problems in Food Science", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 3", "description": "Individual investigation of an area of food science.", "restrictions": "Open only to graduate students in Food Science. Approval of department; application required."}, "FSC891": {"name": " Selected Topics in Food Science", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 4", "description": "Topics of current interest and importance in basic and applied areas of food science.", "restrictions": "Open only to graduate students in the Food Science major or Human Nutrition major."}, "FSC892": {"name": " Food Science Seminar", "semester": "Spring of every year", "credits": " 1", "description": "Critical review of literature. Organization and communication of scientific data in food science.", "restrictions": "Open to graduate students in the Department of Food Science and Human Nutrition."}, "FSC898": {"name": " Master's Research", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 5", "description": "Directed research in support of Plan B master's degree requirements.", "restrictions": "Open only to master's students in Food Science. Approval of department."}, "FSC899": {"name": " Master's Thesis Research", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 10", "description": "Master's thesis research.", "restrictions": "Open only to master's students in the Food Science major."}, "FSC999": {"name": " Doctoral Dissertation Research", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 24", "description": "Doctoral dissertation research.", "restrictions": "Open to doctoral students in the Food Science major."}}}