{"code": "FW", "name": "Fisheries and Wildlife", "courses": {"FW101": {"name": " Fundamentals of Fisheries and Wildlife Ecology and Management", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Ecological and sociological concepts of fisheries and wildlife ecology and management. Career opportunities.", "alias": "FW 100, FW 205"}, "FW101L": {"name": " Fundamentals of Fisheries and Wildlife Ecology and Management Lab", "semester": "Fall of every year", "credits": " 2", "description": "Natural history and ecology of primary terrestrial, wetland, and aquatic ecosystems. Species and communities in Michigan and the United States. Species identification in various ecosystem types. Impacts of disturbances on ecosystems. Field trips required.", "prerequisite": "FW 101 or concurrently", "restrictions": "Open to undergraduate students in the Fisheries and Wildlife major or in the Lyman Briggs Fisheries and Wildlife Coordinate major."}, "FW110": {"name": " Conservation and Management of Marine Resources", "semester": "Spring of every year", "credits": " 3", "description": "Marine environment, resource distribution, and human impacts on selected marine commercial fisheries. Conflicts in management goals between government and industry. Management goals and techniques in preserving and conserving marine resource biodiversity."}, "FW181": {"name": " Introduction to Science, Technology, the Environment and Public Policy", "semester": "Fall of every year", "credits": " 3", "description": "Relation of science and technology to ethics and public policy. Environmental law and public policy. Managing fish, water and wildlife resources at state, national, and international levels. Science and technology in developing countries. Impacts of military technology on environmental policy."}, "FW207": {"name": " Great Lakes: Biology and Management", "semester": "Spring of every year", "credits": " 3", "description": "Living aquatic resources of the Great Lakes, environmental history, and biological resources and their management. Policy issues."}, "FW224": {"name": " Introduction to Probability and Statistics for Ecologists", "semester": "Spring of every year", "credits": " 3", "description": "Probability and statistics with computer applications for the analysis, interpretation and presentation of ecological data. Data analysis, probability models, random variables, estimation, confidence intervals, test of hypotheses, and simple linear regression with applications to ecology.", "prerequisite": "MTH 103 or MTH 116 or (MTH 124 or concurrently) or (MTH 132 or concurrently) or (MTH 152H or concurrently) or (LB 118 or concurrently)", "alias": "FW 324", "exclude": "STT 231"}, "FW238": {"name": " Introductory Fisheries and Wildlife Field Experience", "semester": "Summer of odd years", "credits": " 3", "description": "Terrestrial and aquatic field research techniques and their application to current issues. Interaction with professionals. Field trips required.", "restrictions": "Approval of department; application required."}, "FW278": {"name": " Introduction to Conservation, Recreation and Environmental Enforcement", "semester": "Fall of every year", "credits": " 1", "description": "Scope, history and application of conservation, recreation and environmental law enforcement at the international, federal, state and local level. Integration with traditional policing, resource management and public lands. Career opportunities.", "restrictions": "Not open to freshmen."}, "FW293": {"name": " Undergraduate Seminar in Fisheries and Wildlife", "semester": "Fall of every year, Spring of every year", "credits": " 1", "description": "Professional development and discussion of current case studies to prepare students for a career in Fisheries and Wildlife.", "prerequisite": "FW 101 or concurrently", "restrictions": "Open to undergraduate students in the Fisheries and Wildlife major or in the Lyman Briggs Fisheries and Wildlife Coordinate major."}, "FW341": {"name": " Nature and Environmental Writing", "semester": "Fall of even years", "credits": " 3", "description": "Place-based writing that engages the environmental imagination, shaped by the variety of human relationships with place.", "prerequisite": "Completion of Tier I Writing Requirement", "restrictions": "Open to undergraduate students in the Department of Forestry or in the Professional Writing major or in the Fisheries and Wildlife major or approval of department.", "alias": "AL 341"}, "FW358": {"name": " Streams to Gulf: Environmental Change in America's Deep South", "semester": "Summer of every year", "credits": " 3", "description": "A study away course of anthropogenic impacts, habitat alteration, and environmental policy in surrounding water.", "prerequisite": "IBIO 355", "restrictions": "Approval of department; application required."}, "FW364": {"name": " Ecological Problem Solving", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Application of ecological concepts and models to problems in natural resource and ecosystem management.", "prerequisite": "((MTH 124 or concurrently) or (MTH 132 or concurrently) or (LB 118 or concurrently)) and (STT 224 or STT 231 or STT 421) and (IBIO 355 or BE 230)"}, "FW368": {"name": " Zoo Animal Biology and Conservation", "semester": "Summer of every year", "credits": " 3", "description": "Captive animal biology including illustrated examples of care, behavioral welfare and conservation work.", "prerequisite": "BS 162 or LB 144 or BS 182H or approval of department"}, "FW369": {"name": " Introduction to Zoo and Aquarium Science", "semester": "Spring of every year", "credits": " 3", "description": "Fundamentals of zoo and aquarium operations including research, interpretation, design, nutrition, captive breeding, conservation, ethics and management.", "prerequisite": "BS 162 or LB 144 or BS 182H", "alias": "ZOL 369"}, "FW370": {"name": " Introduction to Zoogeography", "semester": "Fall of every year", "credits": " 3", "description": "Patterns of geographical distribution of animals and the ecological and historical processes leading to these patterns.", "prerequisite": "IBIO 355", "alias": "ZOL 370"}, "FW410": {"name": " Upland Ecosystem Management", "semester": "Spring of every year", "credits": " 3", "description": "Analysis and management of upland ecosystems to meet wildlife management and biodiversity objectives. Mitigation of human impact. Field trips required.", "prerequisite": "(IBIO 355 or FOR 404) or completion of Tier I writing requirement"}, "FW413": {"name": " Wildlife Research and Management Techniques", "semester": "Fall of every year", "credits": " 3", "description": "Field techniques used in collecting, analyzing, and communicating data on wild animal populations and their habitats. Field trips required.", "prerequisite": "(FW 101L or FW 238) and completion of Tier I writing requirement"}, "FW414": {"name": " Aquatic Ecosystem Management", "semester": "Fall of every year", "credits": " 3", "description": "Management of aquatic habitats and populations for ecological and socioeconomic objectives; human impacts on aquatic ecosystems.", "prerequisite": "(IBIO 355) and completion of Tier I writing requirement"}, "FW416": {"name": " Marine Ecosystem Management", "semester": "Fall of every year", "credits": " 3", "description": "Management of marine ecosystems and populations for ecological and socio-economic objectives. Anthropogenic impacts, mitigation, and marine resource conservation strategies. Field trips required.", "prerequisite": "(IBIO 355) and completion of Tier I writing requirement"}, "FW417": {"name": " Wetland Ecology and Management", "semester": "Fall of every year", "credits": " 3", "description": "Biological, physical, and chemical processes controlling wetland structure and function. Utilization, mitigation, and conservation of wetlands on a sustainable basis.", "prerequisite": "(IBIO 355) and completion of Tier I writing requirement", "alias": "FW 412"}, "FW419": {"name": " Applications of Geographic Information Systems to Natural Resources Management", "semester": "Spring of every year", "credits": " 4", "description": "Application of geographic information systems, remote sensing, and global positioning systems to integrated planning and management for fish, wildlife, and related resources."}, "FW420": {"name": " Stream Ecology", "semester": "Fall of every year", "credits": " 3", "description": "Biological and environmental factors determining structure and function of stream ecosystems.", "prerequisite": "IBIO 355 or approval of department"}, "FW422": {"name": " Aquatic Entomology", "semester": "Fall of odd years", "credits": " 3", "description": "Biology, ecology and systematics of aquatic insects in streams, rivers and lakes. Field trips and aquatic insect collection required.", "prerequisite": "BS 162", "alias": "ENT 420"}, "FW423": {"name": " Principles of Fish and Wildlife Disease", "semester": "Fall of odd years", "credits": " 3", "description": "Diseases of fish and wildlife species. Disease detection and diagnosis. Ecological and epidemiological analysis and management of major classes of wildlife diseases. Threatened and endangered species, game species, and fish and wildlife species that serve as vectors or reservoirs of human and domestic animal diseases.", "prerequisite": "(BS 162 and BS 172) or (BS 182H and BS 192H) or LB 144", "restrictions": "Open to juniors or seniors or graduate students in the College of Agriculture and Natural Resources or in the College of Natural Science or in the College of Veterinary Medicine or approval of department."}, "FW423L": {"name": " Principles of Fish and Wildlife Disease Laboratory", "semester": "Fall of odd years", "credits": " 1", "description": "Tools for diagnosis and assessment of disease in fish and wildlife populations."}, "FW424": {"name": " Population Analysis and Management", "semester": "Fall of every year", "credits": " 4", "description": "Statistical, ecological and management concepts and methods needed to analyze and interpret demographic data and manage fish and wildlife populations.", "prerequisite": "(IBIO 355) and (STT 224 or STT 231 or STT 421) and (MTH 124 or MTH 132 or LB 118)"}, "FW431": {"name": " Ecophysiology and Toxicology of Fishes", "semester": "Spring of odd years", "credits": " 3", "description": "Physiological processes and the effect of anthropogenic stresses on fishes. Fate of contaminants in the environment and biota. Individual, population and community effects. Temporal, spatial and scaling issues. Modeling tools and environmental risk assessment.", "prerequisite": "(BS 161 or LB 145 or BS 181H) and ((BS 162 or LB 144 or BS 182H) and completion of Tier I writing requirement)", "restrictions": "Not open to freshmen or sophomores."}, "FW434": {"name": " Human Dimensions of Fisheries and Wildlife Management (W)", "semester": "Fall of every year", "credits": " 3", "description": "Sociological implications of public policy and planning processes in fisheries and wildlife management.", "prerequisite": "(IBIO 355) and completion of Tier I writing requirement", "restrictions": "Open to juniors or seniors or approval of department."}, "FW435": {"name": " Integrated Communications for the Fisheries and Wildlife Professional", "semester": "Fall of every year", "credits": " 3", "description": "Role and practical application of communications for fisheries and wildlife professionals, which integrates public and media relations, community relations, social marketing, and courtroom testimony using a variety of communication tools including news releases, direct mail, storyboards, and business writing.", "prerequisite": "Completion of Tier I writing requirement.", "restrictions": "Open to juniors or seniors or graduate students."}, "FW439": {"name": " Conservation Ethics", "semester": "Spring of every year", "credits": " 3", "description": "Ethical concepts and arguments underlying natural resources.", "prerequisite": "Completion of Tier I Writing Requirement", "restrictions": "Open to juniors or seniors or graduate students."}, "FW443": {"name": " Restoration Ecology", "semester": "Fall of odd years", "credits": " 3", "description": "Principles of ecological restoration of disturbed or damaged ecosystems. Design, implementation, and presentation of restoration plans. Field trips required.", "prerequisite": "FOR 404 or PLB 441 or IBIO 355"}, "FW444": {"name": " Conservation Biology", "semester": "Spring of every year", "credits": " 3", "description": "Ecological theories and methodologies to manage species, communities and genetic diversity on a local and global scale.", "prerequisite": "(IBIO 355 or FOR 404 or PLB 441) and completion of Tier I writing requirement"}, "FW445": {"name": " Biodiversity Conservation Policy and Practice", "semester": "Spring of even years", "credits": " 3", "description": "Social, economic, and policy considerations. Approaches to conserve biodiversity.", "prerequisite": "Completion of Tier I Writing Requirement"}, "FW446": {"name": " Innovations for Conservation", "semester": "Spring of every year", "credits": " 4", "description": "Principles of applied conservation practice. Innovations, implementation, and evaluation of solutions for global problems in conservations.", "prerequisite": "WRA 101", "restrictions": "Open to sophomores or juniors or seniors."}, "FW449": {"name": " Wildlife Policy", "semester": "Spring of odd years", "credits": " 3", "description": "Controversial issues in wildlife policy. Science and political analysis drawing on ecology, economics, sociology. Argument analysis.", "restrictions": "Not open to freshmen or sophomores or approval of department."}, "FW449L": {"name": " Wildlife Policy – Study Away", "semester": "Spring of odd years", "credits": " 1", "description": "Onsite examination of controversial issues of in wildlife policy. Field trip required.", "prerequisite": "FW 449 or concurrently or approval of department; application required", "restrictions": "Not open to freshmen or sophomores."}, "FW450": {"name": " International Environmental Law and Policy", "semester": "Spring of every year", "credits": " 3", "description": "Overview of concepts, actors, norms, laws, and institutions related to international environmental policy. Case studies on current global environmental issues."}, "FW452": {"name": " Watershed Concepts", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": " 3", "description": "Watershed hydrology and management. The hydrologic cycle, water quality, aquatic ecosystems, and social systems. Laws and institutions for managing water resources.", "alias": "ESA 452, RD 452, CSUS 452"}, "FW454": {"name": " Environmental Hydrology for Watershed Management", "semester": "Spring of odd years", "credits": " 3", "description": "Effect of climate, topography, geology, soil, vegetation, and anthropogenic land uses on the amount, timing, and quality of water yield. Implications for fish and wildlife resource management. Field trips required.", "prerequisite": "(MTH 124 or MTH 132 or LB 118) and ((PHY 183 or concurrently) or (PHY 231 or concurrently))"}, "FW460": {"name": " Green Roofs and Walls", "semester": "Fall of every year", "credits": " 2", "description": "Green roof and wall design and installation practices including plant species and substrates. Environmental impact, ecosystem services, integration with other environmental practices. Influence of economics, public policy, and industry organizations on the implementation of green roofs on a wide scale. Multidisciplinary nature of planning and implementation of successful green roof and wall projects.", "prerequisite": "HRT 203 or FW 101 or GEO 206 or PDC 120 or EGR 100", "restrictions": "Open to juniors or seniors or graduate students."}, "FW461": {"name": " Field Ecology of Disease Vectors", "semester": "Summer of every year", "credits": " 3", "description": "Collection and identification of arthropod vectors of human and animal diseases in Michigan. Assays for associated pathogens. Integration of disease ecology and public health responses to vector-borne disease", "restrictions": "Not open to freshmen."}, "FW463": {"name": " Wildlife Disease Ecology", "semester": "Spring of even years", "credits": " 3", "description": "Role of wildlife disease in ecological interactions. Factors underlying pathogen emergence. Disease modeling. Conservation medicine.", "prerequisite": "IBIO 355 or approval of department", "restrictions": "Open to juniors or seniors or approval of department.", "exclude": "FW 863"}, "FW466": {"name": " Natural Resource Policy", "semester": "Spring of every year", "credits": " 3", "description": "Natural resources policy-making in the context of scientific, environmental, social, and legal-institutional factors. Historical evolution of policies and case studies of contemporary policy issues.", "restrictions": "Not open to freshmen or sophomores."}, "FW471": {"name": " Ichthyology", "semester": "Spring of every year", "credits": " 4", "description": "Fish morphology and physiology. Development, behavior, evolution, and ecology. World fishes with emphasis on freshwater fishes. Field trips required.", "prerequisite": "{(BS 162 and BS 172) or (BS 182H and BS 192H) or LB 144} and Completion of Tier I Writing Requirement"}, "FW472": {"name": " Limnology", "semester": "Spring of every year", "credits": " 3", "description": "Ecology of lakes with emphasis on interacting physical, chemical, and biological factors affecting their structure and function.", "prerequisite": "(CEM 141 or LB 171) and IBIO 355"}, "FW474": {"name": " Field and Laboratory Techniques for Aquatic Studies", "semester": "Fall of every year", "credits": " 3", "description": "Field and laboratory techniques for the investigation and analysis of lake and stream ecosystems and their biota. Field trips required.", "prerequisite": "(FW 101L or FW 238) and completion of Tier I writing requirement", "alias": "FW 470"}, "FW479": {"name": " Fisheries Management", "semester": "Spring of every year", "credits": " 3", "description": "Quantitative analysis of fish populations. Case study of ecological interactions linking fish to aquatic ecosystems and the challenge of balancing multiple human values in managing fisheries resources.", "prerequisite": "IBIO 355 and (FW 364 or concurrently) or approval of department"}, "FW480": {"name": " International Studies in Fisheries and Wildlife", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 6", "description": "Fisheries and wildlife ecology and management study in regions beyond the United States. Ecological, economic, social, and cultural influences on fisheries and wildlife resources.", "restrictions": "Approval of department; application required."}, "FW481": {"name": " Global Issues in Fisheries and Wildlife", "semester": "Spring of even years", "credits": " 3", "description": "Global issues and their impacts on implications for the management of fisheries and wildlife resources.", "prerequisite": "Completion of Tier I Writing Requirement", "restrictions": "Open to juniors or seniors or graduate students."}, "FW489": {"name": " Seminar in Zoo and Aquarium Science", "semester": "Fall of every year, Spring of every year", "credits": " 1", "description": "Scientific writing and oral presentations related to zoo and aquarium studies.", "restrictions": "Approval of department.", "alias": "ZOL 489"}, "FW490": {"name": " Independent Study in Fisheries and Wildlife", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 3", "description": "Supervised individual research and study in fisheries and wildlife.", "restrictions": "Not open to freshmen or sophomores. Approval of department; application required."}, "FW491": {"name": " Special Topics in Fisheries and Wildlife", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 4", "description": "Selected topics of current interest and importance in fisheries and wildlife.", "restrictions": "Not open to freshmen or sophomores."}, "FW492": {"name": " Interdisciplinary Studies in Conservation Medicine", "semester": "Spring of every year", "credits": " 4", "description": "Interdisciplinary studies focused on \"health\" as defined by the interactions of animal health, ecosystem health, and human health, viewed through the lens of human culture in an off-campus, multicultural setting.", "prerequisite": "(BS 161 and BS 162) or (BS 181H and BS 182H) or (LB 144 and LB 145)", "restrictions": "Approval of department."}, "FW492L": {"name": " Advanced Research Applications in Conservation Medicine", "semester": "Spring of every year", "credits": " 4", "description": "Field and laboratory techniques for assessing and monitoring biodiversity and health of humans, animals, and ecosystems in an off-campus, multicultural setting. Tools and techniques will be drawn from ecology, microbiology, molecular biology, genetics, histopathology, bioinformatics and statistics.", "prerequisite": "(BS 161 and BS 162) or (BS 181H and BS 182H) or (LB 144 and LB 145)", "restrictions": "Approval of department."}, "FW493": {"name": " Professional Internship in Fisheries and Wildlife", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 3", "description": "Supervised professional experiences in agencies and businesses related to fisheries and wildlife professions.", "prerequisite": "FW 101 and FW 101L", "restrictions": "Approval of department; application required. A student may earn a maximum of 6 credits in all enrollments for any or all of these courses"}, "FW498": {"name": " Internship in Zoo and Aquarium Science", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": " 4", "description": "Application of zoological experience in a zoo or aquarium setting outside the university.", "restrictions": "Open to juniors or seniors. Approval of department.", "alias": "ZOL 498"}, "FW499": {"name": " Senior Thesis in Fisheries and Wildlife", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": " 2", "description": "Faculty-guided undergraduate research in Fisheries and Wildlife. Thesis required.", "restrictions": "Open to seniors in the Fisheries and Wildlife major. Approval of department."}, "FW813": {"name": " Natural Resources and Environmental Governance", "semester": "Fall of odd years", "credits": " 3", "description": "Relationship between governance frameworks and environmental protection and management. Assessment of political actors' impacts on natural resource management."}, "FW821": {"name": " Conservation Medicine", "semester": "Fall of even years", "credits": " 3", "description": "Ecological and epidemiological principles of wildlife disease impacts and management. Critical review of selected case studies.", "restrictions": "Open to graduate students or approval of department.", "alias": "FW 823"}, "FW824": {"name": " Analysis of Wildlife Populations", "semester": "Spring of even years", "credits": " 3", "description": "Statistical and ecological concepts, methods and computer techniques needed to analyze and interpret demographic data from fish and wildlife studies."}, "FW828": {"name": " Molecular Ecology and Conservation Genetics", "semester": "Fall of even years", "credits": " 3", "description": "Population and evolutionary genetic principles applied to ecology, conservation, and management of fish and wildlife at the individual, population, and species level."}, "FW829": {"name": " Economics of Environmental Resources", "semester": "Spring of every year", "credits": " 3", "description": "Economic principles, theoretical models, and empirical methods related to environmental problems and policy interventions. Applications to air, land, water, forests, energy, fish and wildlife, and climate change, including in developing countries.", "alias": "AEC 829"}, "FW836": {"name": " Modeling Natural Resource Systems", "semester": "Spring of every year", "credits": " 3", "description": "System dynamics modeling in human-environment systems. Sustainability applications, including renewable and non-renewable resource use, greenhouse gas emissions and climate change, pollutants and limits to growth.", "alias": "ACR 851, CSUS 851"}, "FW840": {"name": " Landscape Ecology", "semester": "Spring of odd years", "credits": " 3", "description": "Ecological patterns and processes. Spatial variation in landscapes at multiple scales as affected by natural causes and human activity. Landscape ecology in natural resource decision-making and management."}, "FW845": {"name": " Environmental Risk Perception and Decision-Making", "semester": "Spring of odd years", "credits": " 3", "description": "Theoretical underpinnings of individual decision-making and risk perception processes. Case studies of the interplay of risk perception and decision-making in an environmental and or criminological context.", "restrictions": "Open to master's students or doctoral students in the School of Criminal Justice or in the Department of Fisheries and Wildlife or approval of school."}, "FW846": {"name": " Corporate Environmental Crime and Risk", "semester": "Spring of even years", "credits": " 3", "description": "Theoretical accounts and multiple interventions relevant to corporate environmental crime and risk. Use of “Smart Regulation” principles to design interventions to match specific problems.", "restrictions": "Open to master's students or doctoral students in the Department of Fisheries and Wildlife or in the School of Criminal Justice or approval of school."}, "FW847": {"name": " Global Risks, Conservation, and Criminology", "semester": "Fall of every year", "credits": " 3", "description": "Theories, actors, characteristics and legal instruments associated with risk, conservation, and criminology related to globalization. Current case studies in criminological conservation.", "restrictions": "Open to graduate students or approval of school."}, "FW849": {"name": " Applied Bayesian Inference using Monte Carlo Methods for Quantitative Biologists", "semester": "Fall of even years", "credits": " 3", "description": "Applications of Bayesian inference using software in quantitative biology and genetics. Hierarchical and non-hierarchical models. Model checking, model selection and model comparison. Markov chain Monte Carlo methods.", "restrictions": "Not open to undergraduate students."}, "FW850": {"name": " Applied Multivariate Statistical Methods", "semester": "Spring of even years", "credits": " 4", "description": "Application of multivariate methods to research problems. Hotelling's T-test, profile analysis, discriminant analysis, canonical correlation, principal components, principal coordinates, correspondence analysis, and cluster analysis.", "alias": "FOR 976"}, "FW854": {"name": " Uncertainty in Natural Resource Management", "semester": "Spring of odd years", "credits": " 3", "description": "Methods and challenges associated with accounting for uncertainty in natural resource decision making. Decision analysis, structured decision making, and adaptive management."}, "FW858": {"name": " Gender, Justice and Environmental Change : Issues and Concepts", "semester": "Fall of every year", "credits": " 3", "description": "Issues and concepts related to gender, ecology, and environmental studies. Key debates and theoretical approaches to addressing environmental issues from a gender and social justice perspective. Gender and environment issues and processes from a global perspective."}, "FW859": {"name": " Gender, Justice, and Environmental Change: Methods and Application", "semester": "Spring of every year", "credits": " 3", "description": "Methods and case studies related to gender, ecology, and environmental studies. Methodological and fieldwork issues from a feminist perspective in international and intercultural contexts. Qualitative and quantitative methods for integrating social and environmental data."}, "FW863": {"name": " Wildlife Disease Ecology", "semester": "Spring of even years", "credits": " 3", "description": "Role of wildlife disease in ecological interactions, factors underlying pathogen emergence, mathematical modeling of infectious diseases, conservation medicine.", "restrictions": "Open to graduate students.", "exclude": "FW 463"}, "FW868": {"name": " Water Policy and Management", "semester": "Fall of odd years", "credits": " 3", "description": "Environmental policy issues associated with the use, management, and protection of water resources and aquatic ecosystems. Case studies in water science and management.", "alias": "FW 468"}, "FW869": {"name": " Community and Conservation", "semester": "Fall of even years, Summer of even years", "credits": " 3", "description": "Use of experiential, participatory, field-based mode of inquiry to develop understanding of social and cultural issues associated with conservation. Understanding of different social positions and perspectives."}, "FW870": {"name": " Spatial Ecology", "semester": "Fall of every year", "credits": " 3", "description": "Science of understanding and predicting ecological patterns in space."}, "FW876": {"name": " Advanced Fish Ecology", "semester": "Fall of odd years", "credits": " 3", "description": "Advanced ecology of fishes in freshwater and marine ecosystems.", "restrictions": "Open to graduate students or approval of department."}, "FW877": {"name": " Fish Population Dynamics", "semester": "Spring of even years", "credits": " 4", "description": "Quantitative analysis of fish populations. Evaluation, causes, and impacts of the rates of change in survival, growth, reproduction, and recruitment for fish populations and their yield."}, "FW885": {"name": " Leadership in Natural Resources and Environmental Management", "semester": "Fall of odd years", "credits": " 3", "description": "Theory and practice of leadership in natural resource and environmental management. Integration across disciplinary and jurisdictional divisions."}, "FW891": {"name": " Advanced Topics", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 4", "description": "In-depth study of advanced topics in fisheries and wildlife."}, "FW893": {"name": " Seminar in Fisheries and Wildlife", "semester": "Fall of every year, Spring of every year", "credits": " 1", "description": "Study and research in advanced problems and current developments in fisheries and wildlife."}, "FW894": {"name": " Principles and Perspectives in Fisheries and Wildlife", "semester": "Fall of every year", "credits": " 2", "description": "Multidisciplinary investigation, management, exploitation and conservation of fisheries and wildlife species, their habitats, and effects on human society.", "restrictions": "Open to graduate students in the Department of Fisheries and Wildlife or approval of department."}, "FW895": {"name": " Practice of Fisheries and Wildlife Outreach and Engagement", "semester": "Spring of every year", "credits": " 2", "description": "Participatory approaches used in managing natural resources. Science communication, outreach, and engagement skills.", "restrictions": "Open to graduate students in the Department of Fisheries and Wildlife or approval of department."}, "FW897": {"name": " Ecosystem Ecology and Global Change", "semester": "Fall of odd years", "credits": " 4", "description": "Structure and function of natural ecosystems and their responses to global environmental change. Biogeochemical cycles, food webs, energy flow, nutrient cycling, and ecosystem management and restoration.", "alias": "ZOL 897"}, "FW898": {"name": " Master's Research", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 6", "description": "Master's degree Plan B research paper.", "restrictions": "Open only to graduate students in the Fisheries and Wildlife major."}, "FW899": {"name": " Master's Thesis Research", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 6", "description": "Master's thesis research.", "restrictions": "Open only to graduate students in the Fisheries and Wildlife major."}, "FW999": {"name": " Doctoral Dissertation Research", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 24", "description": "Doctoral dissertation research.", "restrictions": "Open to doctoral students in the Department of Fisheries and Wildlife."}}}