{"code": "GBL", "name": "General Business and Business Law", "courses": {"GBL295H": {"name": " Business Law, Public Policy, and Ethics -- Honors (W)", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Court systems and jurisdictions, constitutional law, and product liability. Administrative law and government regulation of business. Ethics and corporate social responsibility.", "prerequisite": "Completion of Tier I Writing Requirement", "restrictions": "Open to sophomores in the Honors College.", "alias": "GBL 395H", "exclude": "GBL 323 or GBL 295"}, "GBL323": {"name": " Introduction to Business Law", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Introduction to the legal system. Basic concepts of constitutional law, torts, contracts, and product liability. Administrative law and government regulations.", "restrictions": "Not open to students in the Accounting major or in the Business - Admitted major or in the Business-Preference major or in the Hospitality Business Major or in the Human Resource Management Major or in the Management Major or in the Marketing Major or in the Supply Chain Management Major or in the Finance Major.", "exclude": "GBL 385"}, "GBL385": {"name": " Business Law and Ethical Leadership", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": " 3", "description": "Court systems, jurisdiction, constitutional law, and product liability. Administrative law and government regulation. Ethical leadership, corporate social responsibility, and sustainability", "restrictions": "Open to juniors or seniors in the Accounting major or in the Human Resource Management Major or in the Management Major or in the Marketing Major or in the Supply Chain Management Major or in the Finance Major or in the Applied Engineering Sciences Major.", "alias": "GBL 295, GBL 395", "exclude": "GBL 323"}, "GBL393": {"name": " Introduction to International Business", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 3", "description": "Introduction to the context of international business delivered on-site in foreign settings. Fundamental concepts and principles of globalization such as multinational corporations, foreign markets and economies, internal and external market transactions, international law, cultural influences, and multinational business strategies.", "restrictions": "Open to students in the Eli Broad College of Business and The Eli Broad Graduate School of Management or in the School of Hospitality Business."}, "GBL451": {"name": " Law of Commercial Transactions", "semester": "Fall of every year, Spring of every year", "credits": " 1", "description": "Law of contracts and sales, commercial paper, secured transactions, consumer credit, and debtor-creditor relationships.", "prerequisite": "GBL 385 or concurrently", "restrictions": "Open to juniors or seniors in the Eli Broad College of Business and The Eli Broad Graduate School of Management."}, "GBL460": {"name": " International Business Law and Sustainability", "semester": "Spring of every year", "credits": " 3", "description": "The impact of international law on business practices including sustainability and ethics. Government regulation of international business.", "restrictions": "Open to juniors or seniors in the Eli Broad College of Business and The Eli Broad Graduate School of Management or in the Environmental and Sustainability Studies Minor and not open to undergraduate students in the School of Hospitality Business."}, "GBL467": {"name": " Emerging Enterprise Law", "semester": "Fall of every year", "credits": " 3", "description": "In-depth analysis of the law for new ventures. Laws one must follow before, during, and after creation of a company.", "prerequisite": "GBL 385 or GBL 323", "restrictions": "Open to juniors or seniors in the Eli Broad College of Business and The Eli Broad Graduate School of Management and open to students in the Entrepreneurship and Innovation Minor."}, "GBL480": {"name": " Environmental Law and Sustainability for Business: From Local to Global", "semester": "Fall of every year", "credits": " 3", "description": "Environmental law and sustainability for business from comparative as well as local, national, and international perspectives.", "restrictions": "Open to juniors or seniors in the Eli Broad College of Business and The Eli Broad Graduate School of Management or in the Environmental and Sustainability Studies Minor or in the Applied Engineering Sciences Major."}, "GBL490": {"name": " Independent Study", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 3", "description": "Program of observation and work in selected business firms and government. Supervised independent research on selected legal topics.", "prerequisite": "GBL 385", "restrictions": "Approval of department."}, "GBL491": {"name": " Topics in Business Law", "semester": "Fall of even years", "credits": "Variable from 1 to 4", "description": "Current and emerging issues in business law to supplement and enrich existing courses.", "prerequisite": "GBL 385"}, "GBL890": {"name": " Independent Study", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 3", "description": "Faculty-supervised independent study.", "restrictions": "Open to graduate students in the Eli Broad College of Business and The Eli Broad Graduate School of Management. Approval of department."}}}