{"code": "GD", "name": "Graphic Design", "courses": {"GD160": {"name": " Digital Graphic Design: Tools and Methods", "semester": "Fall of every year, Summer of every year", "credits": " 3", "description": "Introduction of digital tools and methods specific to contemporary graphic design.", "alias": "STA 160"}, "GD200": {"name": " History of Graphic Design", "semester": "Fall of every year, Summer of every year", "credits": " 3", "description": "Survey of visual communication. Social, global and technological developments in graphic design as it relates to art historical movements and other design disciplines. Typography of printed and digital work from 1880 to present.", "alias": "HA 200"}, "GD260": {"name": " Concepts of Graphic Design", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": " 3", "description": "Overview of form and communication analysis and manipulation. Investigation of theory, concept and visual tools central to developing visual communication systems.", "restrictions": "Not open to students in the Graphic Design Major.", "alias": "STA 260"}, "GD295": {"name": " Design Thinking for Entrepreneurs", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": " 3", "description": "Skills in ideation and innovation, discovering human needs and matching them with feasible solutions developed in accordance with the principles and practices of entrepreneurship; creating value and working towards social good by developing solutions to complex issues affecting multiple systems or populations.", "restrictions": "Open to students in the Entrepreneurship and Innovation Minor."}, "GD303": {"name": " Experimental Design Practices", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Studio-based survey of experimental and futures-oriented design practices that are interdisciplinary in nature, intersect with emergent practices in the visual arts, and address broader issues of power, normativity, and social justice.", "restrictions": "Open to students in the Experience Architecture Major or in the Graphic Design Major or in the Bachelor of Fine Arts in Studio Art or in the Studio Art Major.", "alias": "STA 303"}, "GD360": {"name": " Graphic Design I: Graphic Form", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Introduction to form analysis and manipulation, through theory, concept and visual tools, to develop clear formal languages. Traditional and digital craft. Development of verbal articulation.", "prerequisite": "STA 110 and STA 113 and STA 114 and STA 112", "alias": "STA 360"}, "GD365": {"name": " Typography I: Form and Meaning", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Formal and communicative properties of typography. Letterform, font specification, style, meaning, texture, and space. Sequence of analysis from formal aspects, to communicative, to a synthesis of the two.", "prerequisite": "STA 110 and STA 113 and STA 114 and STA 112", "alias": "STA 365"}, "GD460": {"name": " Graphic Design II: Visual Communication", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Advance from the analysis of form to the meaning of form. Synthesis of form and content will progress towards cohesive communication systems.", "prerequisite": "(GD 360 or STA 360) and (GD 365 or STA 365)", "alias": "STA 460"}, "GD462": {"name": " Spatial Design", "semester": "Fall of every year", "credits": " 3", "description": "Development and application of visual communication elements for volumetric structures and spaces.", "prerequisite": "GD 360 and GD 365", "alias": "STA 462"}, "GD465": {"name": " Typography II: Typographic Systems", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Typographic exploration through grid, hierarchy, and systems development. Variety of purpose, content and viewer consideration in resulting appropriate forms.", "prerequisite": "GD 360 and GD 365", "alias": "STA 465"}, "GD466": {"name": " Identity Design", "semester": "Fall of every year", "credits": " 3", "description": "Design development, hierarchical unification, and application strategies for the graphic identification of organizations and sub-units of organizations.", "prerequisite": "GD 460", "alias": "STA 466"}, "GD467": {"name": " Motion Design", "semester": "Spring of every year", "credits": " 3", "description": "Time-based design utilizing sound and motion for visual communication and personal expression relating to the field of graphic design. Conceptual and formal explorations relating to the moving image such as motion graphics, stop-motion animation, and kinetic typography.", "prerequisite": "GD 360 and GD 365", "alias": "STA 467"}, "GD468": {"name": " Interaction Design", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Digital interactivity as a tool for visual communication, design and distribution of ideas. Conceptual, formal and typographical explorations relating to screen-based activities such as interface design, user-interaction and basic animation.", "prerequisite": "GD 460", "alias": "STA 468"}, "GD490": {"name": " Independent Study", "semester": "Fall of every year, Spring of every year", "credits": "Variable from 1 to 6", "description": "Special projects arranged by an individual student and faculty member in areas supplementing regular course offerings."}, "GD491": {"name": " Selected Topics - Graphic Design", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Experimental and relevant topics of interest in graphic design.", "prerequisite": "GD 360 or GD 365"}, "GD492": {"name": " Senior Seminar and Professional Practice (W)", "semester": "Spring of every year", "credits": " 2", "description": "Capstone course for graphic designers. Writing as a mode of issue delineation and definition, portfolio preparation.", "prerequisite": "(STA 492A or concurrently) and completion of Tier I writing requirement", "restrictions": "Open to seniors in the Graphic Design Major."}, "GD492A": {"name": " Exhibition Practicum", "semester": "Spring of every year", "credits": " 1", "description": "Exhibition experience in graphic design. Audience delineation, conceptual framing, use of space, and evaluation.", "prerequisite": "Completion of Tier I Writing Requirement", "restrictions": "Open to seniors in the Graphic Design Major."}, "GD493": {"name": " Graphic Design Internship", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 6", "description": "Field experience in a working design environment under supervision of a graphic design professional.", "prerequisite": "GD 360 or GD 365", "restrictions": "Approval of department."}, "GD494": {"name": " Design Center", "semester": "Spring of every year", "credits": " 3", "description": "Practicum in design problem-solving, including extensive contact with selected clients at a professional level.", "prerequisite": "GD 460", "restrictions": "Approval of department.", "alias": "STA 494"}}}