{"code": "GEO", "name": "Geography", "courses": {"GEO113": {"name": " Introduction to Economic Geography", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Spatial distribution of resources, population, enterprise, trade, consumption, and production. Interaction of those distributions at local to global scales."}, "GEO151": {"name": " Introduction to Human Geography", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Systematic study of spatial patterns and processes that have shaped human use and alteration of the world."}, "GEO201": {"name": " Introduction to Plant Geography", "semester": "Fall of even years", "credits": " 3", "description": "Geographic distribution and characteristics of plants throughout the world; relationships between biomes and aspects of the physical environment (climate, soils, landforms, disturbance); plant ecology; human impacts on vegetation; optional field trip on campus.", "restrictions": "Not open to graduate students."}, "GEO203": {"name": " Introduction to Meteorology", "semester": "Fall of every year", "credits": " 3", "description": "Fundamentals of meteorology. Energy balance, adiabatic processes, horizontal motion, cyclogenesis, and severe weather."}, "GEO204": {"name": " World Regional Geography", "semester": "Fall of every year", "credits": " 3", "description": "Economic, political, cultural, environmental, and technological processes and conditions that explain the diversity of world regions."}, "GEO206": {"name": " Physical Geography", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Geographic and functional interrelationships within the physical environment"}, "GEO206L": {"name": " Physical Geography Laboratory", "semester": "Fall of every year, Spring of every year", "credits": " 1", "description": "Geographic aspects of weather, climate, soil, vegetation, and terrain. Interpretation and application of maps and remotely sensed imagery.", "prerequisite": "GEO 113 or GEO 151 or GEO 203 or GEO 204 or (GEO 206 or concurrently) or GEO 208 or GEO 211 or GEO 215 or GEO 221"}, "GEO208": {"name": " Physical Geography of the National Parks", "semester": "Fall of odd years", "credits": " 2", "description": "Physical features such as geology, landforms, biota, and waters of United States and Canadian national parks, forests, seashores and lakeshores. Emphasis on formation and distribution."}, "GEO211": {"name": " Environmental Policy and Practice", "semester": "Fall of every year", "credits": " 3", "description": "Systematic study of environmental policy and resource management practices in the United States and the broader global context, emphasizing geographical and other social sciences perspectives."}, "GEO214": {"name": " Geography of Drugs", "semester": "Fall of even years", "credits": " 3", "description": "Physical, ecological, and human geographies of drugs, drug crops, pharmaceuticals, alcohol, and their diffusions. Cultural geographies and geopolitical implications of drugs' consumption, trade, and regulation and prohibition."}, "GEO215": {"name": " Sports Geography", "semester": "Fall of odd years", "credits": " 3", "description": "Geographical variables that influence the location, character, and spread of sports at the national and global scale. Human cultures and diffusion. Themes associated with the geography of sports. Origin and spread of collegiate, professional, international, and Olympic sports"}, "GEO221": {"name": " Introduction to Geographic Information", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Principles and methods of spatial data collection, handling, analysis, and display. Introduction to remote sensing, geographic information systems, and cartography."}, "GEO221L": {"name": " Introduction to Geographic Information Laboratory", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": " 1", "description": "Basic skills for working with Geographic Information Systems, remotely sensed imagery, design of maps, geospatial tools and technologies for data analysis and problem-solving.", "prerequisite": "GEO 221 or concurrently"}, "GEO235": {"name": " Geography of Environment and Health", "semester": "Spring of every year", "credits": " 3", "description": "Geographic patterns of global health and environmental inequalities; the built, physical and social environment; urban design; infectious and chronic diseases."}, "GEO259": {"name": " Geography of Recreation and Tourism", "semester": "Fall of even years", "credits": " 3", "description": "Cultural, physical, and biotic factors affecting the distribution of recreation and tourism resources and participation. U.S. and international examples and case studies."}, "GEO286": {"name": " Undergraduate Research in Geography", "semester": "Fall of even years", "credits": " 3", "description": "Supervised research on a topic or topics determined by the instructor. Applications of geographic tools and theory."}, "GEO302": {"name": " Climates of the World", "semester": "Fall of odd years", "credits": " 3", "description": "Regional climates and underlying atmospheric circulation patterns. Climate classification, physical climatic processes, spatial and temporal aspects of climate, climate changes. Sources and use of climate data.", "restrictions": "Not open to freshmen."}, "GEO303": {"name": " Severe and Hazardous Weather", "semester": "Spring of even years", "credits": " 3", "description": "Extratropical cyclones, freezing precipitation and ice storms, lake effect snowstorms, cold waves, blizzards, thunderstorms, tornadoes, downbursts, tropical cyclones, floods, drought, and heat waves.", "prerequisite": "GEO 203 or approval of department"}, "GEO306": {"name": " Environmental Geomorphology", "semester": "Fall of even years", "credits": " 3", "description": "Relationships of running water, weathering, gravity, ice, waves, wind, and biota (including humans) to terrain and soils. Evolution of landscapes. Classical and modern interpretations.", "prerequisite": "CSS 210 or GEO 206 or GEO 333 or GLG 201 or GLG 304 or ISP 203A"}, "GEO314": {"name": " Methods for Investigation of Urban Systems", "semester": "Spring of every year", "credits": " 4", "description": "Models, approaches, and techniques for urban and regional problem analysis, research, program evaluation, and project management. Application of related computer software."}, "GEO324": {"name": " Remote Sensing of the Environment", "semester": "Fall of every year", "credits": " 4", "description": "Features and interpretation methods of remotely-sensed imagery, especially black-and-white and color infrared airphotos. Basic features of radar, thermal, and multispectral imagery. Interpretation for agriculture, archaeology, fisheries, forestry, geography, landscape architecture, planning, and wildlife management.", "prerequisite": "GEO 221", "alias": "GEO 224"}, "GEO325": {"name": " Geographic Information Systems", "semester": "Fall of every year", "credits": " 3", "description": "Technical and theoretical issues in the design, implementation, and use of geographic information systems for research and applications.", "prerequisite": "GEO 221 and GEO 221L"}, "GEO326": {"name": " Cartographic Design and Production", "semester": "Fall of every year", "credits": " 4", "description": "Map design, layout, and usability. Typography and color theory. Techniques of map production, print and digital display.", "prerequisite": "GEO 221 and GEO 221L", "alias": "GEO 423"}, "GEO330": {"name": " Geography of the United States and Canada", "semester": "Spring of every year, Summer of every year", "credits": " 3", "description": "Regional analysis. Evolution and status of environmental, demographic, economic, and sociocultural patterns and processes.", "alias": "GEO 230"}, "GEO333": {"name": " Geography of Michigan and the Great Lakes Region", "semester": "Spring of every year", "credits": " 3", "description": "Michigan's physical, historical, and economic geography. Interrelationships between the physical environment (rocks, landforms, soils, climate, vegetation, hydrology) and historical and contemporary land uses. Demographic and agricultural patterns. Human history and settlement patterns. Contemporary recreational opportunities.", "alias": "GEO 233"}, "GEO335": {"name": " Geography of Latin America", "semester": "Fall of odd years", "credits": " 3", "description": "Physical and human geography of Latin America. Current development issues, especially people-environment interaction in urban and rural areas. Topics include migration, urbanization, and industrialization."}, "GEO336": {"name": " Geography of Europe", "semester": "Fall of even years", "credits": " 3", "description": "Major regions and nations, including their physical resources, peoples, political structures, and economies."}, "GEO337": {"name": " Geography of Asia-Pacific", "semester": "Spring of odd years", "credits": " 3", "description": "Spatial patterns and processes of economic, urban, human and physical geography in eastern Asia, including China, Korea, Japan, Australia, New Zealand, the Indian subcontinent and other Asian countries. Contemporary regional development."}, "GEO338": {"name": " Geography of Africa", "semester": "Fall of every year", "credits": " 3", "description": "Physical and human geography of Africa. Current development issues, especially people-environment interaction in urban and rural areas. Topics include drought, agricultural patterns, hunger, rural development, migration, and urbanization."}, "GEO339": {"name": " Geography of the Middle East and North Africa", "semester": "Spring of odd years", "credits": " 3", "description": "Physical and human geographies of the Middle East and North Africa. Historical and contemporary topics of ethno-nationalism, religion, state-building, and peace and conflict. Current issues of environment, development, urbanization, and global interactions."}, "GEO340": {"name": " Geography of Eurasia", "semester": "Spring of even years", "credits": " 3", "description": "Physical, ecological, and human geographies of the lands and peoples of the former Russian and Soviet empires and of neighboring regions."}, "GEO363": {"name": " Introduction to Quantitative Methods for Geographers", "semester": "Fall of every year", "credits": " 3", "description": "Quantitative techniques in the analysis and classification of spatial data.", "alias": "GEO 463"}, "GEO370": {"name": " Introduction to Zoogeography", "semester": "Fall of every year", "credits": " 3", "description": "Patterns of geographical distribution of animals and the ecological and historical processes leading to these patterns.", "prerequisite": "IBIO 355", "alias": "ZOL 370"}, "GEO372": {"name": " Ecological Monitoring and Data Analysis", "semester": "Spring of every year", "credits": " 3", "description": "Design of ecological monitoring systems and analysis of resulting ecological data sets. Monitoring system design, model specification and implementation, and computational considerations from both a design- and model-based perspective. Hands-on introduction to statistical software.", "prerequisite": "((MTH 124 or MTH 132) and completion of Tier I writing requirement) and (STT 201 or STT 224 or STT 231 or STT 421)", "alias": "FOR 472"}, "GEO401": {"name": " Global Plant Geography", "semester": "Fall of odd years", "credits": " 3", "description": "Patterns of global plant distributions. Plant-atmosphere interactions, ecological processes, biogeographic patterns and predictive models of plant distributions.", "prerequisite": "GEO 201 or FOR 101 or FOR 204 or PLB 218 or IBIO 355 or approval of department", "restrictions": "Not open to freshmen."}, "GEO402": {"name": " Agricultural Climatology", "semester": "Fall of even years", "credits": " 3", "description": "Relationships between climate and agriculture in resource assessment, water budget analysis, meteorological hazards, pests, crop-yield modeling, and impacts of global climate change.", "prerequisite": "MTH 110 or MTH 116", "restrictions": "Not open to freshmen or sophomores."}, "GEO403": {"name": " Dynamic Meteorology (W)", "semester": "Spring of odd years", "credits": " 3", "description": "Principles of fluid dynamics and their application to the atmosphere.", "prerequisite": "(MTH 234 and GEO 203) and completion of Tier I writing requirement", "restrictions": "Open to juniors or seniors or master's students or doctoral students."}, "GEO405": {"name": " Weather Analysis and Forecasting", "semester": "Spring of even years", "credits": " 4", "description": "Dynamic and thermodynamic principles of atmospheric science applied to the development and evolution of extratropical cyclones. Laboratory sessions include analysis of current observations and satellite imagery.", "prerequisite": "GEO 203 and (MTH 110 or MTH 116)"}, "GEO407": {"name": " Regional Geomorphology of the United States", "semester": "Spring of odd years", "credits": " 3", "description": "Geomorphic characteristics of physiographic regions of the United States."}, "GEO408": {"name": " Soil Geomorphology Field Study", "semester": "Fall of odd years", "credits": " 4", "description": "Common geographic relationships among soils, landforms, and vegetation in lower Michigan. Description, analysis, and genesis of soils and landscapes. Surficial processes.", "prerequisite": "CSS 210 or GEO 306 or GLG 201 or GLG 412 or GEO 206", "restrictions": "Not open to freshmen or sophomores."}, "GEO409": {"name": " Global Climate Change and Variability", "semester": "Fall of odd years", "credits": " 3", "description": "Analysis of climate change and variability at various time and space scales. Climate systems, paleoclimatology, global warming, climate models, and climate impact assessment.", "prerequisite": "GEO 203 or GEO 206"}, "GEO410": {"name": " Geography of Food and Agriculture", "semester": "Fall of even years", "credits": " 3", "description": "Spatial patterns of contemporary global agriculture and food systems. Human-environment geography of select agricultural practices and food systems. Effects of agricultural practices on natural and human resources.", "restrictions": "Not open to freshmen or sophomores."}, "GEO411": {"name": " Stream Systems and Landforms", "semester": "Spring of even years", "credits": " 3", "description": "Themes associated with stream systems. Evolution of drainage basins and channel hydrology. The nature of flowing water, stream discharge, and flooding. Controls of stream behavior. Channel patterns and landform development. Character of Michigan stream systems. Field project.", "restrictions": "Not open to freshmen or sophomores."}, "GEO412": {"name": " Glacial Geology and the Record of Climate Change", "semester": "Spring of every year", "credits": " 4", "description": "In-depth analysis of glacial geology and the record of climate change, with emphasis on North America and Europe. Field trip required.", "restrictions": "Not open to freshmen or sophomores."}, "GEO413": {"name": " Urban Geography", "semester": "Spring of every year", "credits": " 3", "description": "Theories and models of urban spatial form. Underlying structures and processes. Socio-spatial dimensions of modern urbanism. Differentiation and locational conflict in residential, commercial, and industrial space.", "restrictions": "Not open to freshmen or sophomores."}, "GEO414": {"name": " Geography of Transportation", "semester": "Fall of odd years", "credits": " 3", "description": "Spatial principles of transportation. Theories of interaction, network structures, and location-allocation models. Role of transport and transport planning.", "prerequisite": "GEO 113", "restrictions": "Not open to freshmen."}, "GEO415": {"name": " Location Theory and Land Use Analysis", "semester": "Fall of even years", "credits": " 3", "description": "Classical and neoclassical, static and dynamic models of industrial location and spatial organization. Land rent theory. Central place theory. Multi-locational organization. Growth transmission.", "prerequisite": "GEO 113 or UP 201", "restrictions": "Not open to freshmen or sophomores."}, "GEO418": {"name": " The Ghetto", "semester": "Fall of odd years", "credits": " 3", "description": "Analysis of the ghetto including its spatial organization and structure. Distribution of racial and ethnic populations. Emphasis on U.S. cities.", "restrictions": "Not open to freshmen or sophomores."}, "GEO419": {"name": " Applications of Geographic Information Systems to Natural Resources Management", "semester": "Spring of every year", "credits": " 4", "description": "Application of geographic information systems, remote sensing, and global positioning systems to integrated planning and management for fish, wildlife, and related resources."}, "GEO424": {"name": " Advanced Remote Sensing", "semester": "Spring of every year", "credits": " 4", "description": "Interaction of solar radiation with the atmosphere, lithosphere, hydrosphere, and biosphere. Introductory digital image processing. Earth-resources satellite sensors, data products, and applications. Radar and thermal remote sensing.", "prerequisite": "GEO 324"}, "GEO425": {"name": " Problems in Geographic Information Science (W)", "semester": "Spring of every year", "credits": " 3", "description": "Advanced theoretical and technical issues in geographic information science utilizing a problems oriented approach. Development and implementation of geographic information science solutions and formal documentation of work.", "prerequisite": "(GEO 325 or GEO 802) and completion of Tier I writing requirement"}, "GEO426": {"name": " Thematic Cartography", "semester": "Spring of every year", "credits": " 4", "description": "Principles, theories, decision making, and techniques in thematic map production. Graphic and Geographic Information Systems applications. Print and digital display.", "prerequisite": "GEO 221 and GEO 221L and GEO 326 or approval of department"}, "GEO428": {"name": " Digital Terrain Analysis", "semester": "Fall of odd years", "credits": " 3", "description": "Theoretical and technical issues of collection, management, analysis, and display of terrain data. Application of photogrammetry, geographic information systems, and cartography.", "prerequisite": "GEO 325"}, "GEO429": {"name": " Geoprocessing", "semester": "Spring of every year", "credits": " 3", "description": "Applications of computer programming to address geographic information problems. Integration of digital spatial data, geographic information systems, spatial analysis, and expert systems.", "prerequisite": "GEO 325 or GEO 802 or approval of department"}, "GEO432": {"name": " Environmental Ethics (W)", "semester": "Fall of even years", "credits": " 3", "description": "Ethical dimensions of environmental and spatial issues and associated public policies", "prerequisite": "Completion of Tier I writing requirement.", "restrictions": "Not open to freshmen or sophomores."}, "GEO435": {"name": " Geography of Health and Disease", "semester": "Fall of every year", "credits": " 3", "description": "Spatio-environmental concepts and techniques applied to health problems. Disease transmission cycles, community nutrition, and health-care planning.", "restrictions": "Not open to freshmen or sophomores."}, "GEO436": {"name": " Spatial Analysis of Populations", "semester": "Spring of odd years", "credits": " 3", "description": "Concepts and methods to measure and evaluate geo-spatial and temporal trends in populations and their components, such as natality, mortality, migration, and characteristics at different geographic scales. Sources of spatial population data. Visualization and analysis of data in a geographical information system.", "restrictions": "Not open to freshmen or sophomores."}, "GEO440": {"name": " Critical Geopolitics", "semester": "Spring of even years", "credits": " 3", "description": "Political geographies of origins and conduct of nation-states. Identity-place dynamics. Colonialism and imperialism. Geopolitics and geopolitical ideas. Resource and environmental politics. Resistance and terrorism.", "restrictions": "Not open to freshmen."}, "GEO441": {"name": " Cultural Geography", "semester": "Spring of odd years", "credits": " 3", "description": "Survey of the geographic study of world cultures, cultural ecologies, cultural landscapes, and cultural influences on societies’ patterns of spatial organization.", "restrictions": "Not open to freshmen."}, "GEO442": {"name": " Social Science Data Analytics Applications", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Application of computational tools for data collection and visualization to various topics in social science research.", "prerequisite": "PLS 202"}, "GEO453": {"name": " Metropolitan Environments: Urban Forms and Land Uses", "semester": "Spring of every year", "credits": " 3", "description": "Land use change, the physical fabric of the city, and the growth of regional centers in the American urban landscape. Issues associated with urban developments, practices and patterns in the 20th century and the resulting metropolitan form and function. Extensive use of geographic information software in spatial analysis.", "prerequisite": "GEO 221"}, "GEO459": {"name": " Tourism in Regional Development", "semester": "Fall of odd years", "credits": " 3", "description": "The role of tourism in regional development. Examples from Michigan, the United States and other nations. Environmental considerations."}, "GEO460": {"name": " Green Roofs and Walls", "semester": "Fall of every year", "credits": " 2", "description": "Green roof and wall design and installation practices including plant species and substrates. Environmental impact, ecosystem services, integration with other environmental practices. Influence of economics, public policy, and industry organizations on the implementation of green roofs on a wide scale. Multidisciplinary nature of planning and implementation of successful green roof and wall projects.", "prerequisite": "HRT 203 or FW 101 or GEO 206 or PDC 120 or EGR 100", "restrictions": "Open to juniors or seniors or graduate students."}, "GEO478": {"name": " Urban Transportation Planning", "semester": "Fall of every year", "credits": " 3", "description": "Principles of decision-making in urban transportation planning. Demand and supply analysis, social and environmental impacts, implementation programs. Use of computer models.", "restrictions": "Open to juniors or seniors in the Geography Major or in the Urban and Regional Planning Major or approval of school."}, "GEO480": {"name": " Senior Seminar (W)", "semester": "Fall of every year", "credits": " 3", "description": "History, philosophy, and methodology of the geographic discipline as it has evolved within academic and social contexts.", "prerequisite": "Completion of Tier I Writing Requirement", "restrictions": "Open to seniors in the Geography Major or in the Geography Minor."}, "GEO490": {"name": " Independent Study", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 4", "description": "Supervised individual study in an area supplementary to regular courses.", "restrictions": "Approval of department."}, "GEO492": {"name": " Geographic Research Problems", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 4", "description": "Supervised original research on selected aspects of geography.", "restrictions": "Not open to freshmen or sophomores. Approval of department."}, "GEO495": {"name": " Field Study", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 4", "description": "Supervised field study in geography."}, "GEO498": {"name": " Internship in Geography", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 4", "description": "Individual experience in geography in an approved organization."}, "GEO802": {"name": " Geospatial Technology", "semester": "Fall of every year", "credits": " 3", "description": "Comprehensive introduction to geotechnologies. Concepts and theories of remote sensing to include image interpretation and processing, Global Positioning Systems, spatial data structures, and geographic information systems."}, "GEO813": {"name": " Seminar in Urban and Economic Geography", "semester": "Spring of every year", "credits": " 3", "description": "Review of research on selected topics in urban and economic geography."}, "GEO816": {"name": " The World System of Cities", "semester": "Fall of every year", "credits": " 3", "description": "Modern global economic restructuring. Social, economic, and political impacts on world system of cities.", "restrictions": "Open to graduate students."}, "GEO817": {"name": " China and Globalization", "semester": "Fall of even years", "credits": " 3", "description": "Theoretical debates and empirical discussions on current social, economic, environmental, and spatial challenges facing contemporary urban China in an era of globalization. Comparative and thematic approach.", "restrictions": "Open to graduate students."}, "GEO819": {"name": " Spatial Epidemiology and Medical Geography", "semester": "Spring of every year", "credits": " 3", "description": "Concepts, techniques, and utilization of spatio-epidemiologic analyses for human health.", "prerequisite": "EPI 810 or GEO 865", "restrictions": "Open to graduate students in the Department of Epidemiology and Biostatistics or in the Department of Geography or approval of department.", "alias": "HM 819"}, "GEO826": {"name": " Geocomputation", "semester": "Fall of every year", "credits": " 3", "description": "Research on topics in cartography, geographic information systems, and remote sensing."}, "GEO827": {"name": " Digital Image Processing and Analysis", "semester": "Fall of every year", "credits": " 4", "description": "Use of computer to classify and enhance satellite images and to extract information from them. Combining images from different sources. Accuracy assessment of resulting information.", "prerequisite": "GEO 424"}, "GEO837": {"name": " Remote Sensing of the Biosphere", "semester": "Fall of even years", "credits": " 3", "description": "Remote sensing for environmental and global change research. Advanced image interpretation and applications with emphasis on independent research projects.", "prerequisite": "GEO 424 or approval of department"}, "GEO858": {"name": " Gender, Justice and Environmental Change : Issues and Concepts", "semester": "Fall of every year", "credits": " 3", "description": "Issues and concepts related to gender, ecology, and environmental studies. Key debates and theoretical approaches to addressing environmental issues from a gender and social justice perspective. Gender and environment issues and processes from a global perspective."}, "GEO859": {"name": " Gender, Justice, and Environmental Change: Methods and Application", "semester": "Spring of every year", "credits": " 3", "description": "Methods and case studies related to gender, ecology, and environmental studies. Methodological and fieldwork issues from a feminist perspective in international and intercultural contexts. Qualitative and quantitative methods for integrating social and environmental data."}, "GEO865": {"name": " Advanced Quantitative Methods in Geography", "semester": "Spring of every year", "credits": " 4", "description": "Statistical and mathematical approaches. Multiple regression, principal components and factor analysis, discriminant analysis. Related taxonomic methods."}, "GEO866": {"name": " Spatial Data Analysis", "semester": "Fall of every year", "credits": " 4", "description": "Theory and techniques for statistical analysis of point patterns, spatially continuous data, and data in spatial zones.", "alias": "GEO 466"}, "GEO869": {"name": " Agent-Based Modeling", "semester": "Spring of every year", "credits": " 3", "description": "Theoretical concepts related to simulating dynamic geographic phenomena in the intersection between human and natural systems. Innovative agent-based methodology applied to complex social-environmental systems. Hands-on experience of agent-based modeling, with special emphasis on modeling human decision-making and its impact on the natural environment.", "restrictions": "Approval of department."}, "GEO871": {"name": " Seminar in Physical Geography", "semester": "Fall of every year", "credits": " 3", "description": "Research on topics in physical geography.", "restrictions": "Approval of department."}, "GEO872": {"name": " Seminar in Human Geography", "semester": "Fall of every year", "credits": " 3", "description": "Research on topics in human geography.", "restrictions": "Approval of department."}, "GEO873": {"name": " Seminar in Human-Environment Geography", "semester": "Spring of every year", "credits": " 3", "description": "Research on topics in human-environment geography.", "restrictions": "Approval of department."}, "GEO874": {"name": " Seminar in Geographic Information Science", "semester": "Spring of every year", "credits": " 3", "description": "Geographic information science (GIS) applications to social and environmental problems. Theory and related issues.", "restrictions": "Approval of department."}, "GEO886": {"name": " Research Design in Geography", "semester": "Spring of every year", "credits": " 3", "description": "Research and writing in geography. Identification of geographic problems and their relative importance. Structuring and stating hypotheses. Data acquisition and tests for validity.", "restrictions": "Approval of department."}, "GEO890": {"name": " Advanced Readings in Geography", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 8", "description": "Advanced independent readings.", "restrictions": "Approval of department."}, "GEO892": {"name": " Advanced Research in Geography", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 4", "description": "Advanced independent research."}, "GEO899": {"name": " Master's Thesis Research", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 12", "description": "Master's thesis research.", "restrictions": "Open to graduate students."}, "GEO986": {"name": " Theories and Philosophies in Geography", "semester": "Spring of odd years", "credits": " 3", "description": "Historical development of the discipline within social and intellectual contexts. Philosophical approaches behind geographic research and theory.", "restrictions": "Open to doctoral students in the Geography major."}, "GEO999": {"name": " Doctoral Dissertation Research", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 36", "description": "Doctoral dissertation research.", "restrictions": "Open to doctoral students in the Department of Geography."}}}