{"code": "GLG", "name": "Geological Sciences", "courses": {"GLG201": {"name": " The Dynamic Earth", "semester": "Fall of every year, Spring of every year", "credits": " 4", "description": "Physical and chemical processes related to the past, present and future behavior of the earth system, and the energy systems that drive these processes. A study of the earth's materials, the earth's surface and the earth's interior.", "exclude": "GLG 301"}, "GLG202": {"name": " Geology of Michigan", "semester": "Fall of every year", "credits": " 3", "description": "Integration of the geological evolution of Michigan with its social and economic development. Field trips are required.", "prerequisite": "Completion of Tier I Writing Requirement", "restrictions": "Not open to students in the Department of Earth and Environmental Sciences or in the Lyman Briggs Earth Science Major or in the Lyman Briggs Earth Science-Interdepartmental Coordinate Major or in the Lyman Briggs Environmental Geosciences Coordinate Major or in the Lyman Briggs Geological Sciences Coordinate Major.", "alias": "GLG 302", "exclude": "GLG 304 or GLG 201"}, "GLG301": {"name": " Geology of the Great Lakes Region", "semester": "Spring of every year", "credits": " 3", "description": "Geological, physical and chemical processes related to the origin and evolution of the Earth, North American continent, and the Great Lakes environment. Soils, hydrology, Earth structure and materials, geologic hazards.", "prerequisite": "(PHY 231 or PHY 183 or LB 273 or PHY 193H) and (CEM 141 or CEM 151 or LB 171 or CEM 181H)", "restrictions": "Open to undergraduate students in the Department of Civil and Environmental Engineering.", "exclude": "GLG 201"}, "GLG303": {"name": " Oceanography", "semester": "Fall of every year", "credits": " 3", "description": "Physical, chemical, biological, and geological aspects of oceanography", "prerequisite": "(CEM 141 or CEM 181H or LB 171 or CEM 151) and (PHY 231 or PHY 183 or PHY 193H or LB 273 or PHY 183B or PHY 231C or PHY 241)"}, "GLG304": {"name": " Physical and Biological History of the Earth", "semester": "Spring of every year", "credits": " 4", "description": "Origin of the Earth. Differentiation of the Earth's core, mantle, and crust. Lithospheric tectonics over geologic time. Origin and evolution of the Earth's hydrosphere, atmosphere and climate. Origin and evolutionary history of biological life. Interactions of life with the Earth's endogenic and exogenic systems.", "prerequisite": "GLG 201 or ISP 203A", "alias": "GLG 202"}, "GLG306": {"name": " Environmental Geomorphology", "semester": "Fall of even years", "credits": " 3", "description": "Relationships of running water, weathering, gravity, ice, waves, wind, and biota (including humans) to terrain and soils. Evolution of landscapes. Classical and modern interpretations.", "prerequisite": "CSS 210 or GEO 206 or GEO 333 or GLG 201 or GLG 304 or ISP 203A"}, "GLG319": {"name": " Introduction to Earth System Science", "semester": "Fall of every year", "credits": " 3", "description": "Systems approach to Earth as an integration of geochemical, geophysical, biological and social components. Global dynamics at a variety of spatio-temporal scales. Sustainability of the Earth system."}, "GLG321": {"name": " Mineralogy and Geochemistry", "semester": "Fall of every year", "credits": " 4", "description": "Earth materials and their origin, modification, structure, dynamics and history. Crystallography and crystal chemistry, and geochemical properties and processes in mineral crystallization and recrystallization. Analytical identification and characterization of minerals in their lithologic context.", "prerequisite": "GLG 201 and (CEM 142 or CEM 152 or CEM 182H or LB 172) and (MTH 132 or MTH 152H or LB 118)"}, "GLG361": {"name": " Igneous and Metamorphic Geochemistry and Petrology", "semester": "Spring of every year", "credits": " 4", "description": "Evolution, origin, occurrence and tectonic setting of igneous and metamorphic rocks. Phase relations of igneous and metamorphic systems. Studies of rocks in thin sections. Field trip required.", "prerequisite": "GLG 321", "alias": "GLG 461"}, "GLG401": {"name": " Global Tectonics and Earth Structure (W)", "semester": "Fall of every year", "credits": " 4", "description": "Structural geology, geological and geophysical methods of studying the structure and dynamics of the earth and planets. Plate kinematics and global geodynamic processes, plate margin processes and evolution, marine geology. Field trip required.", "prerequisite": "((GLG 304) and completion of Tier I writing requirement) and (MTH 114 or MTH 116 or MTH 124 or MTH 132 or MTH 152H or LB 118) and (PHY 183 or PHY 183B or PHY 231 or PHY 231C or LB 273 or PHY 193H)", "restrictions": "Open to seniors or graduate students.", "alias": "GLG 371"}, "GLG411": {"name": " Hydrogeology", "semester": "Fall of every year", "credits": " 3", "description": "Source, occurrence, and movement of groundwater emphasizing geologic factors and controls.", "restrictions": "Not open to freshmen or sophomores."}, "GLG412": {"name": " Glacial Geology and the Record of Climate Change", "semester": "Spring of every year", "credits": " 4", "description": "In-depth analysis of glacial geology and the record of climate change, with emphasis on North America and Europe. Field trip required.", "restrictions": "Not open to freshmen or sophomores."}, "GLG421": {"name": " Environmental Geochemistry", "semester": "Spring of every year", "credits": " 4", "description": "Natural and anthropogenic processes affecting the chemistry of the environment with an emphasis on the water cycle. Equilibria and kinetic balances, biogeochemical cycling, contaminant chemicals, chemical origins, environmental health."}, "GLG431": {"name": " Sedimentology and Stratigraphy", "semester": "Spring of every year", "credits": " 4", "description": "Sediments, sedimentary rocks, sedimentary processes, and depositional environments through geologic time. Facies event correlation. Fossils as tools in stratigraphy and environmental analysis. Biostratigraphy, paleoecology and taphomony. Field trip required.", "prerequisite": "GLG 321 and GLG 304"}, "GLG433": {"name": " Vertebrate Paleontology", "semester": "Fall of even years", "credits": " 4", "description": "Fossil vertebrates with emphasis on evolution and interrelationships of major groups. Modern techniques of identification and interpretation of fossils.", "prerequisite": "IBIO 328 or GLG 304 or IBIO 360 or IBIO 365 or IBIO 384 or IBIO 445 or GLG 434 or FW 471"}, "GLG434": {"name": " Evolutionary Paleobiology", "semester": "Fall of odd years", "credits": " 4", "description": "Patterns and processes of evolution known from the fossil record"}, "GLG435": {"name": " Geomicrobiology", "semester": "Spring of every year", "credits": " 4", "description": "Geological and microbiological perspectives on microbial activities in diverse environmental settings, including geological change mediated by microorganisms, microbial evolution driven by geologically diverse habitats.", "restrictions": "Open to juniors or seniors or graduate students in the College of Natural Science or in the Lyman Briggs College."}, "GLG440": {"name": " Planetary Geology", "semester": "Spring of every year", "credits": " 3", "description": "Surficial and internal properties and processes of planets and their natural satellites, asteroids, comets, and meteorites. Origin, composition, structure, tectonics, volcanism, impact phenomena, atmospheric evolution, atmosphere-surface interactions, and history of solar system bodies. Results of recent space exploration programs, projects and missions.", "prerequisite": "GLG 201 and GLG 304 and GLG 321 or approval of department"}, "GLG446": {"name": " Ecosystems Modeling, Water and Food Security", "semester": "Fall of every year", "credits": " 3", "description": "Impacts of climate variability and change on water availability, food security and global environmental change. Integrated models to identify adaption and mitigation strategies to such changes and to enhance the efficiency of natural resources use.", "restrictions": "Open to juniors or seniors or approval of department."}, "GLG470": {"name": " Solid Earth Geophysics and Geodynamics", "semester": "Spring of odd years", "credits": " 3", "description": "Theory and applications of solid-earth geophysics including geochronology, geothermics, geomagnetism and paleomagnetism, geodesy and gravity, rheology, and seismology.", "prerequisite": "GLG 201 and (MTH 133 or LB 119 or MTH 153H) and (PHY 183 or PHY 183B or PHY 193H or PHY 233B or LB 273)", "alias": "GLG 472"}, "GLG471": {"name": " Applied Geophysics", "semester": "Spring of every year", "credits": " 4", "description": "Application of seismic, gravity, magnetic, resistivity, and electromagnetic methods to problems related to engineering studies, mineral and oil exploration, groundwater, subsurface mapping, pollution, and hazardous waste.", "prerequisite": "((MTH 133 or concurrently) or (LB 119 or concurrently) or (MTH 153H or concurrently)) and ((PHY 184 or concurrently) or (PHY 184B or concurrently) or (PHY 232 or concurrently) or (PHY 232C or concurrently) or (PHY 294H or concurrently) or (LB 274 or concurrently))", "restrictions": "Not open to freshmen or sophomores."}, "GLG481": {"name": " Reservoirs and Aquifers", "semester": "Fall of every year", "credits": " 3", "description": "Principles of the origin and evolution of porous media. Porosity and permeability of sediments and sedimentary rocks. Computing techniques for evaluating reservoirs and aquifers. Field trip required.", "prerequisite": "GLG 431 or concurrently"}, "GLG491": {"name": " Field Geology - Summer Camp (W)", "semester": "Summer of every year", "credits": " 6", "description": "Field analysis of rock types", "prerequisite": "(GLG 431 and GLG 361) or (GLG 431 and GLG 401) or ((GLG 361 and GLG 401) and completion of Tier I writing requirement)", "restrictions": "Open to students in the Department of Geological Sciences or in the Lyman Briggs Geological Sciences Coordinate Major or in the Lyman Briggs Environmental Geosciences Coordinate Major. Approval of department."}, "GLG493": {"name": " Field Studies in Geological Sciences", "semester": "On Demand", "credits": "Variable from 1 to 6", "description": "Field experiences in solid earth and environmental geosciences within the US and abroad. Field trips required.", "prerequisite": "GLG 201 and GLG 304", "restrictions": "Open to juniors or seniors or graduate students in the Department of Geological Sciences or in the Lyman Briggs Environmental Geosciences Coordinate Major or in the Lyman Briggs Geological Sciences Coordinate Major. Approval of department."}, "GLG498": {"name": " Topics in Geological Sciences", "semester": "On Demand", "credits": "Variable from 1 to 4", "description": "Selected topics in geological and geoenvironmental sciences supplementing or expanding specific topics, or examining topics not covered in regular courses.", "prerequisite": "GLG 201 and GLG 304 or approval of department", "restrictions": "Open to juniors or seniors or graduate students in the Department of Geological Sciences or in the Lyman Briggs Environmental Geosciences Coordinate Major or in the Lyman Briggs Geological Sciences Coordinate Major."}, "GLG499": {"name": " Independent Study in Geological Sciences", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 3", "description": "Advanced individual study of special topics in the geological sciences.", "restrictions": "Open to seniors or juniors in the Department of Geological Sciences or in the Lyman Briggs Earth Science-Interdepartmental Coordinate Major or in the Lyman Briggs Environmental Geosciences Coordinate Major or in the Lyman Briggs Geological Sciences Coordinate Major. Approval of department; application required."}, "GLG801": {"name": " Seminar in Geochemistry", "semester": "On Demand", "credits": "Variable from 1 to 4", "description": "Recent developments in geochemistry, including aqueous, biologic and mineralogic aspects.", "restrictions": "Open to graduate students in the Department of Earth and Environmental Sciences."}, "GLG802": {"name": " Seminar in Geophysics and Geodynamics", "semester": "Fall of every year, Spring of every year", "credits": "Variable from 1 to 4", "description": "Applied, solid-earth, and theoretical geophysics, global and regional geodynamics. Plate tectonics, marine geophysics, and polar earth sciences.", "restrictions": "Open to graduate students in the Department of Earth and Environmental Sciences."}, "GLG803": {"name": " Seminar in Hydrogeology", "semester": "Fall of every year, Spring of every year", "credits": "Variable from 1 to 4", "description": "Occurrence, movement and composition of groundwater in geologic settings.", "restrictions": "Open to graduate students in the Department of Earth and Environmental Sciences."}, "GLG804": {"name": " Seminar in Paleobiology", "semester": "On Demand", "credits": "Variable from 1 to 4", "description": "Invertebrate, vertebrate and plant paleobiology.", "restrictions": "Open to graduate students in the Department of Earth and Environmental Sciences."}, "GLG805": {"name": " Seminar in Petrology", "semester": "Fall of every year, Spring of every year", "credits": "Variable from 1 to 4", "description": "Current topics in igneous petrology.", "restrictions": "Open to graduate students in the Department of Earth and Environmental Sciences."}, "GLG806": {"name": " Seminar in Sedimentology and Stratigraphy", "semester": "On Demand", "credits": "Variable from 1 to 4", "description": "Recent developments in stratigraphy and deposition, and diagenesis of sedimentary rocks.", "restrictions": "Open to graduate students in the Department of Earth and Environmental Sciences."}, "GLG807": {"name": " Seminar in Structural Geology and Tectonics", "semester": "On Demand", "credits": "Variable from 1 to 4", "description": "Rock deformation and major lithospheric structure.", "restrictions": "Open to graduate students in the Department of Earth and Environmental Sciences."}, "GLG808": {"name": " Seminar in Planetary Geology and Astromaterials", "semester": "Fall of every year, Spring of every year", "credits": "Variable from 1 to 4", "description": "Current topics in planetary geology and astromaterials, including meteorites and returned samples.", "restrictions": "Open to graduate students in the Department of Earth and Environmental Sciences. Approval of department."}, "GLG813": {"name": " Watershed Hydrology", "semester": "Spring of every year", "credits": " 4", "description": "Watershed hydrology covering the physical, chemical, and isotopic characteristics of river runoff generation from the pore to the catchment scale."}, "GLG821": {"name": " Aqueous Geochemistry", "semester": "Fall of odd years", "credits": " 3", "description": "Controls on the chemical and isotopic nature of water (fresh, marine, brine) and its solutes. Data acquisition and synthesis. Chemical modeling and evolution of water masses.", "restrictions": "Open to graduate students."}, "GLG824": {"name": " Stable Isotope Biogeochemistry", "semester": "Spring of even years", "credits": " 2", "description": "Principles of stable isotope chemistry applied to biogeochemical problems", "alias": "ZOL 824"}, "GLG850": {"name": " From Research to Publication", "semester": "Fall of every year", "credits": " 3", "description": "Moving research from data to publication including", "restrictions": "Open to graduate students and open to juniors or seniors. Approval of department."}, "GLG862": {"name": " Igneous Petrology", "semester": "Fall of even years", "credits": " 4", "description": "Origin and evolution of magmatic systems. Relationship of igneous activity to tectonic setting.", "restrictions": "Open to graduate students."}, "GLG863": {"name": " Mineral-Water Interactions", "semester": "Fall of even years", "credits": " 4", "description": "Mineralogy, petrology and geochemistry of fluid-rock reactions in geologic, sedimentary and geochemical cycles. Rock and mineral weathering, soil formation, genesis and burial diagenesis of sediments and sedimentary rocks, and metamorphism.", "restrictions": "Open only to graduate students in the Department of Crop and Soil Sciences or Department of Geological Sciences or Department of Geography."}, "GLG864": {"name": " Mineral and Rock Physics", "semester": "Spring of even years", "credits": " 4", "description": "Physical properties of rocks and minerals fundamental to understanding the structure and dynamics of the Earth and other planets for behavior, including elasticity, rheology, and thermal and electrical transport; theory, experimental measurement, and application to geophysical problems.", "prerequisite": "GLG 321"}, "GLG873": {"name": " Introduction to Numerical Tools for Earth and Environmental Scientists", "semester": "Spring of even years", "credits": " 3", "description": "Introduction to Linux and C including numerical methods, integration, curve-fitting, and differential equations with an emphasis on applications to the geological sciences."}, "GLG889": {"name": " Special Problems in GeocognItion", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 4", "description": "Individual study on current problems in geocognition and geoscience education research"}, "GLG890": {"name": " Special Problems in Planetary Geology and Astromaterials", "semester": "Fall of every year, Spring of every year", "credits": "Variable from 1 to 4", "description": "Individual study on current topics in planetary geology and astromaterials, including meteorites and returned samples.", "restrictions": "Open to graduate students in the Department of Earth and Environmental Sciences. Approval of department."}, "GLG891": {"name": " Special Problems in Geochemistry", "semester": "On Demand", "credits": "Variable from 1 to 4", "description": "Individual study on problems in geochemistry, including aqueous, biologic, and mineralogic aspects.", "restrictions": "Open to graduate students in the Department of Earth and Environmental Sciences. Approval of department."}, "GLG892": {"name": " Special Problems in Geophysics and Geodynamics", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 4", "description": "Individual study on problems in applied and solid-earth geophysics, global and regional geodynamics, and polar earth sciences.", "restrictions": "Open to graduate students in the Department of Earth and Environmental Sciences. Approval of department."}, "GLG893": {"name": " Special Problems in Hydrogeology", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 4", "description": "Individual study on the movement, occurrence and composition of groundwater in geologic environments.", "restrictions": "Open to graduate students in the Department of Earth and Environmental Sciences. Approval of department."}, "GLG894": {"name": " Special Problems in Paleobiology", "semester": "On Demand", "credits": "Variable from 1 to 4", "description": "Individual study on invertebrate, vertebrate and plant paleobiology.", "restrictions": "Open to graduate students in the Department of Earth and Environmental Sciences. Approval of department."}, "GLG895": {"name": " Special Problems in Petrology", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 4", "description": "Individual study on current problems in petrology.", "restrictions": "Open to graduate students in the Department of Earth and Environmental Sciences. Approval of department."}, "GLG896": {"name": " Special Problems in Sedimentology and Stratigraphy", "semester": "On Demand", "credits": "Variable from 1 to 4", "description": "Individual study on problems in sedimentology and stratigraphy.", "restrictions": "Open to graduate students in the Department of Earth and Environmental Sciences. Approval of department."}, "GLG897": {"name": " Special Problems in Structural Geology and Tectonics", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 4", "description": "Individual study on rock deformation or major expressions of deformation. From two to seven weeks of field study during semester breaks may be required for certain research projects.", "restrictions": "Open to graduate students in the Department of Earth and Environmental Sciences. Approval of department."}, "GLG898": {"name": " Special Problems in Environmental Geosociences", "semester": "On Demand", "credits": "Variable from 1 to 4", "description": "Individual study on problems in environmental geosciences.", "restrictions": "Open to graduate students in the Department of Earth and Environmental Sciences. Approval of department."}, "GLG899": {"name": " Master's Thesis Research", "semester": "On Demand", "credits": "Variable from 1 to 10", "description": "Master's thesis research.", "restrictions": "Open to master's students in the Department of Earth and Environmental Sciences. Approval of department."}, "GLG900": {"name": " Research Strategies and Methods in Environmental Engineering and Science", "semester": "Spring of every year", "credits": " 1", "description": "Criteria for quality research, scientific method, scientific arguments, statistical testing, critical thinking skills, reviewing journal articles, literature synthesis, writing proposals and papers, giving presentations, responsible conduct of research.", "restrictions": "Open to graduate students in the Department of Civil and Environmental Engineering and open to graduate students in the Department of Geological Sciences.", "exclude": "CE 900"}, "GLG901": {"name": " Research Strategies and Methods", "semester": "Fall of every year, Spring of every year", "credits": " 1", "description": "Selected topics in the earth and environmental sciences."}, "GLG999": {"name": " Doctoral Dissertation Research", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 24", "description": "Doctoral dissertation research.", "restrictions": "Open to doctoral students in the Department of Earth and Environmental Sciences. Approval of department."}}}