{"code": "GRM", "name": "German", "courses": {"GRM101": {"name": " Elementary German I", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "German language, civilization, and culture for beginning students. Work on all language skills with emphasis on speaking."}, "GRM102": {"name": " Elementary German II", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Further study of German language, civilization, and culture for beginning students. Continued work on all language skills with emphasis on speaking.", "prerequisite": "(GRM 101) or designated score on German Placement test"}, "GRM201": {"name": " Second-Year German I", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Intermediate-level development of all language skills. Reading, viewing, and discussion of a broad range of cultural materials from the German-speaking world.", "prerequisite": "(GRM 102) or designated score on German Placement test", "restrictions": "Approval of department."}, "GRM202": {"name": " Second-Year German II", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Further intermediate-level work on all language skills, based on topics such as popular music, literature, film, current events, and culture. Transition course to advanced work in German studies.", "prerequisite": "(GRM 201) or designated score on German Placement test"}, "GRM250": {"name": " German Literature and Culture in English", "semester": "Fall of every year", "credits": " 3", "description": "Selected representative texts or themes in the cultures of German-speaking countries."}, "GRM290": {"name": " Independent Study", "semester": "Fall of every year, Spring of every year", "credits": "Variable from 1 to 4", "description": "Special projects arranged by an individual student and a faculty member in areas supplementing regular course offerings.", "restrictions": "Not open to freshmen. Approval of department."}, "GRM301": {"name": " Third-Year German: Global Germany", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Advanced speaking, listening comprehension, reading, and writing skills. Intensive work with authentic texts dealing with contemporary issues in the German-speaking world. Selected review of grammar and syntax. Focus on the creation of German identity through migration, immigration, and exile.", "prerequisite": "(GRM 202) or designated score on German Placement test"}, "GRM302": {"name": " Third-Year German: Nature in Germany", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Advanced speaking, listening comprehension, reading, and writing skills. Intensive work with authentic texts dealing with contemporary issues in the German-speaking world. Selected review of grammar and syntax. Focus on the natural world and our often unnatural technologies that interfere with our ecological order. Intensive work with texts and films dealing with forests, gardens, plants, natural explorers, pollution and atomic disaster.", "prerequisite": "(GRM 202) or designated score on German Placement test"}, "GRM303": {"name": " Third-Year German: German Genders", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Advanced speaking, listening comprehension, reading, and writing skills. Intensive work with authentic texts dealing with contemporary issues in the German-speaking world. Selected review of grammar and syntax. Focus on the exploration of gender in German culture, from linguistic forms to social roles.", "prerequisite": "(GRM 202) or designated score on German Placement test"}, "GRM304": {"name": " Third-Year German: German Media", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Advanced speaking, listening comprehension, reading, and writing skills. Intensive work with authentic texts dealing with contemporary issues in the German-speaking world. Selected review of grammar and syntax. Focus on German media throughout history. Intensive work with films, images, written texts, advertising, news, social media, video games, and other forms of expression.", "prerequisite": "(GRM 202) or designated score on German Placement test"}, "GRM311": {"name": " Business German", "semester": "Fall of every year", "credits": " 3", "description": "Development of proficiency through readings, discussions, and assignments based on materials dealing with the German economic system and Germany in world trade. Taught in German.", "prerequisite": "(GRM 202) or designated score on German Placement test", "restrictions": "Not open to freshmen."}, "GRM325": {"name": " Third-Year German: Oral Communication", "semester": "Spring of every year, Summer of every year", "credits": " 3", "description": "Development of listening comprehension and oral communication in German beyond the intermediate level. Expansion of vocabulary, use of idiomatic expressions and review of grammatical structures relevant for speaking.", "prerequisite": "(GRM 202) or designated score on German Placement test"}, "GRM341": {"name": " German Literature and Culture Before 1918", "semester": "Spring of every year", "credits": " 3", "description": "Historical, social, and cultural developments in the German-speaking world before 1918 as revealed in textual material in German, including literature, essays, and film.", "prerequisite": "(GRM 202) or designated score on German placement test."}, "GRM342": {"name": " German Literature and Culture since 1918", "semester": "Fall of every year", "credits": " 3", "description": "Historical, social, and cultural developments in the German-speaking world since 1918 as revealed in textual material in German, including literature, essays, and film.", "prerequisite": "(GRM 202) or designated score on German Placement test", "alias": "GRM 340"}, "GRM420": {"name": " Advanced German (W)", "semester": "Fall of every year, Summer of every year", "credits": " 3", "description": "Advanced language skills using a variety of media. Review of grammar and syntax with attention to idiomatic usage and stylistic variation. Major writing project.", "prerequisite": "Completion of Tier I writing requirement."}, "GRM435": {"name": " 18th and 19th Century German Literary Studies (W)", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Literary and cultural texts from a given period before 1919 such as the Enlightenment, Romanticism. Representations of cultural identity, social issues and intellectual debates through literature and other texts. Major writing project.", "prerequisite": "Completion of Tier I writing requirement."}, "GRM445": {"name": " 20th Century and Contemporary German Literary Studies (W)", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Literary and cultural texts from a given period since 1919. Representations of cultural identity, social issues and intellectual debates through literature, film and other texts. Major writing project.", "prerequisite": "Completion of Tier I writing requirement."}, "GRM455": {"name": " Major Themes in German Cultural History (W)", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Evolution of key cultural issues. Use of cultural artifacts in tracing developments across time. Topics such as nationalism, minorities in Germany, literary genres, literacy and popular cultures. Major writing project.", "prerequisite": "Completion of Tier I writing requirement."}, "GRM460": {"name": " Linguistic Analysis of Modern German", "semester": "Spring of every year", "credits": " 3", "description": "Analysis of grammatical, lexical, phonological and cultural aspects of German and comparison with English. Course taught in German."}, "GRM461": {"name": " Applied Linguistics for German Learners and Teachers", "semester": "Spring of even years", "credits": " 3", "description": "Overview of applied linguistic topics relevant for both students of German and future teachers of German. Issues of contemporary language use, the connection between culture and language. Overview of second language acquisition principles. Introduction to effective audiodidactic or pedagogical techniques for language and culture learning.", "prerequisite": "GRM 301 or GRM 302 or GRM 303 or GRM 304 or GRM 311 or approval of department"}, "GRM490": {"name": " Independent Study", "semester": "Fall of every year, Spring of every year", "credits": "Variable from 1 to 4", "description": "Special projects arranged by an individual student and a faculty member in areas supplementing regular course offerings.", "restrictions": "Not open to freshmen. Approval of department."}, "GRM491": {"name": " Special Topics in German Studies", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 4", "description": "Special topics supplementing regular course offerings proposed by faculty on a group study basis."}, "GRM492": {"name": " Capstone Project", "semester": "Fall of every year, Spring of every year", "credits": " 1", "description": "Preparation of a paper or project that synthesizes the student's academic experiences in the major(s). Integration of linguistic, cultural and literary studies in German.", "prerequisite": "Completion of Tier I Writing Requirement", "restrictions": "Open to seniors."}, "GRM493": {"name": " International Internship", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 4", "description": "Experience of German life and language through participation in an approved international internship program.", "prerequisite": "GRM 102", "restrictions": "Not open to sophomores. Approval of department."}, "GRM499": {"name": " Senior Thesis Research", "semester": "Fall of every year, Spring of every year", "credits": "Variable from 1 to 4", "description": "An individual research project supervised by a faculty member that demonstrates the student's ability to do independent research and submit or present a major paper.", "restrictions": "Open to seniors. Approval of department."}, "GRM800": {"name": " Reading German", "semester": "Spring of even years", "credits": " 3", "description": "German grammar and syntax, with emphasis on reading and translation in specialized fields.", "restrictions": "Open to graduate students or approval of department.", "alias": "GRM 400"}, "GRM803": {"name": " Foundations of Contemporary Language Teaching", "semester": "Fall of every year", "credits": " 3", "description": "Theoretical and research foundations for communicative and proficiency-oriented instruction of World languages with implications for the classroom."}, "GRM805": {"name": " The German Language: Relationships, Development, and Varieties", "semester": "Spring of odd years", "credits": " 3", "description": "Methodology and sources in the linguistic study of German. Periodization, phonology, morphology, syntax, and lexicon. Dialects, social variants, and expatriate German. Relationship to other languages."}, "GRM815": {"name": " The Scholarship and Practice of Teaching German Culture", "semester": "Spring of every year", "credits": " 3", "description": "Methodologies for teaching culture in the foreign language classroom. Definitions of culture and the interrelatedness of language and culture. Practical application of theory in the development of strategies for teaching culture in the German classroom."}, "GRM820": {"name": " German Literature and Culture: Theory and Practice", "semester": "Spring of every year", "credits": " 3", "description": "Theoretical approaches to the study of literature and culture and their application. Research methodologies for literary and cultural studies."}, "GRM862": {"name": " German Studies: Constructions of Identity", "semester": "Fall of odd years", "credits": " 3", "description": "Aesthetic representations of cultural strategies and theories of self-definition in selected historical periods. Theories of subjectivity. Development of the bourgeois individual. Identity and gender."}, "GRM863": {"name": " German Studies: Constructions of Community", "semester": "Spring of even years", "credits": " 3", "description": "Aesthetic representations of group identification in selected historical periods. Nationalism. Concept of the Kulturnation. Role of religious, regional, or linguistic affiliations. Formation of communities based on ethnicity, class, and gender."}, "GRM864": {"name": " German Studies: Cultural Norms and Values", "semester": "Fall of even years", "credits": " 3", "description": "Literary and non-literary texts as affirmation, subversion, or critique of aesthetic and social norms in selected historical periods. Role of the artist or intellectual in society. \"High\" versus \"low\" culture. Consumerism."}, "GRM865": {"name": " German Studies: Culture in Context", "semester": "Spring of odd years", "credits": "Variable from 1 to 9", "description": "Society and the dissemination of cultural knowledge, practices, and values in selected historical periods. Educational and political institutions and cultural politics. Literary and cultural marketplace."}, "GRM890": {"name": " Independent Study", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 6", "description": "Special projects, directed reading, and research arranged by an individual graduate student and a faculty member in areas supplementing regular course offerings.", "restrictions": "Approval of department."}, "GRM891": {"name": " Special Topics in German Studies", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 6", "description": "Special topics supplementing regular course offerings proposed by faculty on a group study basis for graduate students.", "restrictions": "Approval of department."}, "GRM892": {"name": " Seminar", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Directed original research on current topics in German studies.", "restrictions": "Approval of department."}, "GRM893": {"name": " Interdisciplinary Seminar", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": " 3", "description": "Examination of a theme, topic, or genre from several different national and disciplinary perspectives in the appropriate cultural and socio-historical context. Significant texts and important critical analysis selected from Great Britain, Spain, France, Germany, the Americas, and others.", "restrictions": "Approval of department."}, "GRM898": {"name": " Master's Research Project", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 6", "description": "Directed research leading to a master's project in partial fulfillment of Plan B master's degree requirements."}, "GRM899": {"name": " Master's Thesis Research", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 6", "description": "Directed research leading to a master's thesis, used in partial fulfillment of Plan A master's degree requirements.", "restrictions": "Approval of department."}, "GRM990": {"name": " Doctoral Independent Study", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 6", "description": "Special projects, directed reading, and research arranged by an individual doctoral student and a faculty member in areas supplementing the regular course offerings.", "restrictions": "Approval of department."}, "GRM991": {"name": " Special Topics in German", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 6", "description": "Special topics supplementing regular course offerings proposed by faculty on a group study basis for doctoral students.", "restrictions": "Approval of department."}, "GRM999": {"name": " Doctoral Dissertation Research", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 36", "description": "Doctoral dissertation research.", "restrictions": "Approval of department."}}}