{"code": "GSAH", "name": "Global Studies in the Arts and Humanities", "courses": {"GSAH200": {"name": " Questions, Issues, and Debates in Global Studies", "semester": "Fall of every year", "credits": "Variable from 1 to 4", "description": "Global Studies issues and debates, addressed through creative, critical, and analytical approaches to understanding values, practices, interactions, and identities throughout history and in the present."}, "GSAH201": {"name": " Introduction to Global Studies in the Arts and Humanities", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Surveys the ways the arts and humanities interpret and represent global issues, themes and interactions. Introduces key interdisciplinary terms and concepts for understanding global themes and contexts."}, "GSAH220": {"name": " Global Interactions and Identities", "semester": "Fall of every year", "credits": " 3", "description": "Specific regions and their interactions across time. Historical and contemporary transformations of cultures and identities, in order to understand global conditions, concepts, and debates from the past and in the present."}, "GSAH230": {"name": " Values, Experience, and Difference in Global Contexts", "semester": "Spring of every year", "credits": " 3", "description": "Conflicting cultural systems. Differing norms and values. Ethics, values, judgments and responses as they are affected by interactions in global and local contexts."}, "GSAH301": {"name": " Approaches to Global Studies in the Arts and Humanities", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Explores broad theoretical debates in global studies. Offers a grounding in interdisciplinary frameworks of the humanities and the arts to understand and analyze global themes, contexts, and connections.", "prerequisite": "GSAH 201"}, "GSAH310": {"name": " Questions of Justice in Global Contexts", "semester": "Spring of every year", "credits": " 3", "description": "Addresses issues of global justice and ethics in regional, national and transnational contexts through the study of how the arts and humanities have engaged with questions of forms of justice and human rights.", "prerequisite": "(GSAH 201 or approval of department) and completion of Tier I writing requirement"}, "GSAH311": {"name": " Global Perspectives on Borders and Migration", "semester": "Spring of every year", "credits": " 3", "description": "Causes and motives, identities and relationships, transformations and traditions of people moving across geographic boundaries at local, regional, and national levels. Effect on local and global conditions, grounded in critical, creative, philosophical, and historical explorations.", "prerequisite": "(GSAH 201 or approval of department) and completion of Tier I writing requirement"}, "GSAH312": {"name": " Global Digital Cultures", "semester": "Spring of every year", "credits": " 3", "description": "Studies the transformative effects of digital media and communication on cultural exchange and creativity in global contexts. Introduces students to ethical and social questions concerning the use and circulation of digital media and communications in various regional, national, and transnational contexts.", "prerequisite": "(GSAH 201 or approval of department) and completion of Tier I writing requirement"}, "GSAH313": {"name": " Violence and Power in Global Contexts", "semester": "Spring of every year", "credits": " 3", "description": "Explores issues and questions of violence in various regional, national, and transnational contexts through manifestations of human conflict as addressed in the arts and humanities. Broadens students’ understanding of relationships between violence, power, and resistance throughout history and in the present.", "prerequisite": "GSAH 201"}, "GSAH314": {"name": " Race, Gender, and Global Identities", "semester": "Spring of every year", "credits": " 3", "description": "Addresses issues of diversity through an exploration of the complexity of identity and difference using global studies frameworks. Evaluates diversity in terms of race, gender, nationality, and inequality. Contributes to interdisciplinary understandings of intersecting identities and cultures in contemporary global settings using the arts and humanities.", "prerequisite": "GSAH 201"}, "GSAH315": {"name": " Global Perspectives on Arts and Performance", "semester": "Spring of every year", "credits": " 3", "description": "Engages the visual and performing arts. Showcases the creative arts and performance as critical components of global studies. Emphasizes the various traditional and contemporary modes of global artistic activity in various regional, national, and transnational contexts. Promotes knowledge of diverse practices as they are manifested through the creative arts and their intersection with global studies.", "prerequisite": "GSAH 201"}, "GSAH391": {"name": " Special Topics in Global Studies in the Arts and Humanities", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 4", "description": "Special topics supplementing regular course offerings proposed by faculty on a group study basis.", "prerequisite": "(GSAH 220 and GSAH 230 or approval of department) or GSAH 201"}, "GSAH450": {"name": " Senior Seminar in Global Studies in the Arts and Humanities (W)", "semester": "Spring of every year", "credits": " 3", "description": "Selected topics in global studies in the arts and humanities through guided interdisciplinary capstone research projects.", "prerequisite": "((GSAH 301 or approval of department) and completion of Tier I writing requirement) and (GSAH 310 or GSAH 311 or GSAH 312 or GSAH 313 or GSAH 314 or GSAH 315 or GSAH 391)"}, "GSAH490": {"name": " Independent Study", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 4", "description": "Special projects arranged by an individual student and a faculty member in areas supplementing regular course offerings."}, "GSAH499": {"name": " Senior Thesis in Global Studies in the Arts and Humanities (W)", "semester": "Spring of every year", "credits": " 2", "description": "Directed research and writing project, arranged by an individual student and a faculty member. Part of the capstone experience.", "prerequisite": "((GSAH 450 or concurrently)or approval of department) and completion of Tier I writing requirement", "restrictions": "Open to seniors. Approval of department."}, "GSAH850": {"name": " Seminar on Global Theories and Concepts in the Arts and Humanities", "semester": "Fall of every year", "credits": " 3", "description": "Advanced concepts and broad theoretical debates in global studies. Models and systems that theorize global relationships, formations, and interactions in the Arts and Humanities."}}}