{"code": "HB", "name": "Hospitality Business", "courses": {"HB100": {"name": " Introduction to Hospitality Business", "semester": "Fall of every year, Spring of every year", "credits": " 2", "description": "Sectors, segments and disciplines of the hospitality and tourism industries. Impact of travel and tourism. Hospitality trends. Overview of accounting, marketing, and sales.", "restrictions": "Not open to juniors or seniors.", "alias": "HB 200"}, "HB105": {"name": " Service Management Principles", "semester": "Fall of every year, Spring of every year", "credits": " 2", "description": "Concept of service organizations. Key issues in delivering and managing services. Service intangibility. Needs, expectations, habituation and customer satisfaction. Prepurchase and postpurchase behaviors.", "restrictions": "Open to students in the Hospitality Business Major."}, "HB201": {"name": " Hospitality Business Professional Development", "semester": "Fall of every year, Spring of every year", "credits": " 1", "description": "Self-assessment of personal and professional interests, skills, and values. Development of professional identity. Career exploration, planning, and development. Building professional relationships through networking and mentorships. Workplace competencies including diversity and multicultural awareness, interpersonal communication, team membership, and leadership.", "restrictions": "Open to undergraduate students in the School of Hospitality Business."}, "HB203": {"name": " Hospitality Communication", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Effective hospitality business communication. Selecting appropriate formats for the audience. Developing and delivering effective presentations. Analyzing, writing and revising hospitality business documents. Spotting, correcting and avoiding common writing pitfalls.", "prerequisite": "WRA 101", "restrictions": "Open to students in the Hospitality Business Major.", "exclude": "COM 100 or COM 225 or MKT 250"}, "HB207": {"name": " Hospitality Management and Leadership", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Overview of management and leadership theories and applications specific to the hospitality industry. Discussion of leadership principles, management principles, change management, decision-making, communications, motivational theories, and negotiation skills.", "restrictions": "Open to students in the Hospitality Business Major.", "exclude": "HB 267"}, "HB210": {"name": " Introduction to the Casino Industry", "semester": "Fall of odd years", "credits": " 3", "description": "Social issues of gaming, casino games of chance, management controls and marketing plans."}, "HB237": {"name": " Management of Lodging Systems", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Interrelated systems in lodging operations for front desk/guest services, reservations, housekeeping, engineering, sales/conference services, accounting, security as well as food and beverage. Segmentation of lodging products and associated management challenges.", "restrictions": "Not open to seniors."}, "HB265": {"name": " Food Management: Safety and Nutrition", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Standards of microbiology, sanitation, nutrition, and other quality issues in food management. Chemical, health, and workplace standards. Management of product quality and costs.", "restrictions": "Not open to seniors."}, "HB267": {"name": " Management of Food and Beverage Systems", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Principles of menu planning, designing and pricing. Control of food and beverage products during purchasing, receiving, storing and issuing. Labor control principles. Control of revenue during sale. Food and beverage segment overview.", "restrictions": "Not open to seniors."}, "HB293": {"name": " Cooperative Education for Business Students", "semester": "Fall of every year, Spring of every year", "credits": " 1", "description": "Integration of pre-professional educational employment experiences in industry and government with knowledge and processes taught in the student's academic program. Educational employment assignment approved by the Department of Supply Chain Management.", "restrictions": "Approval of department.", "alias": "MSC 293"}, "HB302": {"name": " Hospitality Managerial Accounting", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Principles of managerial accounting applied to hospitality enterprises. Topics include financial statements, forecasting methods, internal control, and ethics.", "prerequisite": "ACC 201", "restrictions": "Open to sophomores or juniors or seniors in the Hospitality Business Major.", "exclude": "ACC 202 or ACC 230"}, "HB307": {"name": " Hospitality Human Resources", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Human resource management and interpersonal skills in the hospitality industry. Managing in a culturally diverse workplace. Benefits, compensation, employee and labor relations, equal opportunity, ethics, interviewing, job analysis and description, labor laws, performance management and appraisal, personnel planning, recruitment, retention, risk management, strategic planning, talent management, testing and selection, training and development.", "prerequisite": "HB 201", "restrictions": "Open to juniors or seniors in the Hospitality Business Major.", "exclude": "MGT 315"}, "HB311": {"name": " Hospitality Finance", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Optimal management of a hospitality firm's assets and financing requirements. Analysis of financial statements, financial markets, risk, valuation, short-term and long-term financing and investment.", "prerequisite": "ACC 201 or ACC 230", "restrictions": "Open to sophomores or juniors or seniors in the Hospitality Business Major or in the Hospitality Business Real Estate Investment Management Minor.", "exclude": "FI 311 or FI 320"}, "HB320": {"name": " Casino Operations and Management", "semester": "Fall of even years", "credits": " 3", "description": "Practices and problems associated with casino management. Staffing, security, protection of table games, and control.", "prerequisite": "HB 210", "restrictions": "Open to students in the School of Hospitality Business."}, "HB321": {"name": " Club Operations and Management", "semester": "Fall of every year", "credits": " 3", "description": "Club operations and management. City, country, yacht, and athletic clubs.", "restrictions": "Open to juniors or seniors in the Hospitality Business Major.", "alias": "HB 211"}, "HB337": {"name": " Hospitality Information Systems", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Technology for gathering, analyzing, storing and communicating information within the hospitality industry.", "prerequisite": "CSE 101 or CSE 102", "restrictions": "Open to juniors or seniors in the Hospitality Business Major."}, "HB345": {"name": " Quantity Food Production Systems", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Organization of food and beverage operations. Product knowledge, especially purchasing, storing, preparing and production in food service operations. Menu development and recipe management.", "prerequisite": "HB 265 and HB 267", "restrictions": "Open to juniors or seniors in the School of Hospitality Business."}, "HB345L": {"name": " Quantity Food Production Systems Laboratory", "semester": "Fall of every year, Spring of every year", "credits": " 1", "description": "Practical applications of organization in food and beverage operations. Product knowledge, especially purchasing, storing, preparing, and production in food service operations. Menu development and recipe management.", "prerequisite": "HB 345 or concurrently", "restrictions": "Open to juniors or seniors in the School of Hospitality Business."}, "HB347": {"name": " The Foodservice Distribution Channel", "semester": "Fall of every year", "credits": " 3", "description": "Business and management of the foodservice distribution channel. Relationships among foodservice manufacturers, brokers, and distributors. Value-added services. Request for proposal (RFP) process. Current issues and future trends.", "prerequisite": "HB 265 and HB 267", "restrictions": "Open to juniors or seniors in the School of Hospitality Business."}, "HB349": {"name": " Facilities Maintenance and Systems", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Managing the physical plant of a hospitality business. Key systems, safety, preventive maintenance, energy conservation.", "prerequisite": "HB 237", "restrictions": "Open to sophomores or juniors or seniors in the School of Hospitality Business."}, "HB358": {"name": " Hospitality Business Ownership", "semester": "Spring of every year", "credits": " 3", "description": "Hospitality business ownership qualities and characteristics. Thinking like an owner and resultant actions. Ownership responsibilities across all functional areas of the hospitality entrepreneur business.", "restrictions": "Open to juniors or seniors in the School of Hospitality Business."}, "HB375": {"name": " Hospitality Marketing", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Marketing of hospitality products and services in an increasingly competitive, global, and culturally diverse market.", "restrictions": "Open to juniors or seniors in the School of Hospitality Business.", "exclude": "MKT 300 or MKT 327"}, "HB376": {"name": " Hospitality Sales Process", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Management of the sales process in the hospitality industry.", "restrictions": "Open to juniors or seniors in the Hospitality Business Major.", "exclude": "MKT 313"}, "HB380": {"name": " Meeting and Event Planning and Management", "semester": "Fall of every year", "credits": " 3", "description": "Planning, developing, budgeting, promoting, delivering, and evaluating meetings or special events in the hospitality industry.", "prerequisite": "(HB 375 or concurrently) or (MKT 300 or concurrently) or (MKT 327 or concurrently)", "restrictions": "Open to juniors or seniors in the School of Hospitality Business."}, "HB382": {"name": " Hospitality Business Real Estate Investment Management", "semester": "Fall of every year", "credits": " 3", "description": "Process of planning and developing a commercial real estate project", "restrictions": "Open to sophomores or juniors or seniors in the School of Hospitality Business or approval of school."}, "HB393": {"name": " Introduction to International Business", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 3", "description": "Introduction to the context of international business delivered on-site in foreign settings. Fundamental concepts and principles of globalization such as multinational corporations, foreign markets and economies, internal and external market transactions, international law, cultural influences, and multinational business strategies.", "restrictions": "Open to students in the Eli Broad College of Business and The Eli Broad Graduate School of Management or in the School of Hospitality Business."}, "HB405": {"name": " Advanced Management of Food and Beverage Systems", "semester": "Spring of every year", "credits": " 3", "description": "Design of food and beverage control systems, emphasis on product purchasing (policies, suppliers, selection and evaluation, determination of quality and quantity, ethics and use of technology), inventory management and issuing systems, revenue control procedures and equipment.", "prerequisite": "HB 345", "restrictions": "Open to juniors or seniors in the School of Hospitality Business."}, "HB409": {"name": " Introduction to Wine", "semester": "Summer of every year", "credits": " 3", "description": "Introduction to wine with emphasis on primary varietals and blends, legal nomenclature, classes of wine, and wine production. Potential health implications of wine consumption and socio-cultural and historical facts. Wine and food matching and tools and approaches for wine and food matching. Sensory assessment is discussed. No alcohol is consumed in this course.", "restrictions": "Open to juniors or seniors or graduate students."}, "HB411": {"name": " Hospitality Beverages", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Evaluation and selection of hospitality beverages. Geographical origins of beverages, beverage production, quality assessment, matching beverages with food, health and social considerations.", "restrictions": "Open to juniors or seniors in the Hospitality Business Major. Approval of school."}, "HB415": {"name": " Managing Quality in Hospitality Businesses", "semester": "Fall of every year", "credits": " 3", "description": "Quality management and leadership in hospitality businesses. Quality planning and improvement, assessment, internal and external customer surveys and feedback, costs of quality, strategic quality planning.", "restrictions": "Open to juniors or seniors in the School of Hospitality Business."}, "HB420": {"name": " The Business of Golf", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Accounting, branding, expensing, logistics, negotiations, recruiting, risk management, operations, and promotion in golf. Business considerations in the development and location of golf courses.", "restrictions": "Open to juniors or seniors or graduate students."}, "HB437": {"name": " Hospitality Revenue Management", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Exposure to key management and marketing issues relating to the effective implementation of revenue management. The relationships between the revenue management function and other functions or departments in the hospitality organization. The role and job responsibilities of a revenue manager. The identification of distribution channels that hospitality organizations may use to distribute their inventory.", "prerequisite": "((HB 273 or concurrently) or (ITM 209 or concurrently)) and (HB 375 or MKT 300 or MKT 327)", "restrictions": "Open to juniors or seniors in the Hospitality Business Major or in the Hospitality Business Real Estate Investment Management Minor."}, "HB447": {"name": " Hospitality Business Law", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Legal aspects of hospitality industry, including structure of the U.S. legal system, contracts, torts, discrimination, property and product liability. Administrative law and government regulation of the industry.", "restrictions": "Open to juniors or seniors in the Hospitality Business Major.", "alias": "GBL 447", "exclude": "GBL 323 or GBL 385"}, "HB451": {"name": " Emerging Leadership", "semester": "Fall of every year", "credits": " 3", "description": "Emerging hospitality business leadership challenges. Personal qualities and essentials. Integrity. Diversity. Emerging leadership process. Leadership in hospitality business organizations.", "restrictions": "Open to juniors or seniors in the School of Hospitality Business."}, "HB473": {"name": " Hospitality Business Analytics", "semester": "Fall of every year", "credits": " 3", "description": "Quantitative and analytical skills used to communicate key business information effectively. Study of how business modeling and data analytics can increase decision making efficacy. Course topics include but are not limited to sensitivity and scenario analysis, financial modeling and forecasting, and applied business statistics methods.", "restrictions": "Open to juniors or seniors in the School of Hospitality Business."}, "HB482": {"name": " Advanced Hospitality Finance", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Cash flow determination and management. Strategies for financing hospitality ventures and expansion. Determining financial viability of proposed and existing operations.", "prerequisite": "((HB 273 or concurrently) or (ITM 209 or concurrently)) and (HB 311 or FI 311 or FI 320)", "restrictions": "Open to juniors or seniors in the Hospitality Business Major or in the Hospitality Business Real Estate Investment Management Minor."}, "HB485": {"name": " Hospitality Foodservice Operations", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Beverage management and dining room service. Guest relations and current management topics. Emphasis on foodservice team projects.", "prerequisite": "HB 345 and HB 345L", "restrictions": "Open to juniors or seniors in the Hospitality Business Major."}, "HB486": {"name": " Advanced Hospitality Marketing", "semester": "Fall of every year", "credits": " 3", "description": "Application of advanced marketing principles in the hospitality industry. Identifying, influencing and servicing demand for hospitality products, services, and experiences.", "prerequisite": "HB 375 or MKT 300 or MKT 327", "restrictions": "Open to juniors or seniors in the Hospitality Business Major.", "alias": "HB 475, HB 476"}, "HB489": {"name": " Hospitality Business Strategy (W)", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Management problems and issues in the hospitality industry. Focus on decision-making models. Case study analysis, discussion and report writing.", "prerequisite": "(HB 307 or MGT 315) and completion of Tier I writing requirement", "restrictions": "Open to seniors in the Hospitality Business Major."}, "HB490": {"name": " Independent Study", "semester": "On Demand", "credits": "Variable from 1 to 3", "description": "Supervised research in hospitality management and operations.", "restrictions": "Open to juniors or seniors in the School of Hospitality Business. Approval of school."}, "HB491": {"name": " Current Topics in Hospitality Business", "semester": "On Demand", "credits": "Variable from 1 to 6", "description": "Emerging topics or issues confronting the hospitality service industry.", "restrictions": "Open to juniors or seniors in the School of Hospitality Business."}, "HB492": {"name": " Hospitality Business Real Estate Professional Skills Workshop", "semester": "Fall of every year, Spring of every year", "credits": "Variable from 1 to 6", "description": "Specific knowledge and analytical skills necessary to be successful in an analyst role with a consulting, real estate development, or investment advisory organization. Workshop topics include but are not limited to hospitality real estate investment, market valuation, Excel modeling, business writing, financing hospitality enterprises, asset management, and hotel industry data analytics.", "restrictions": "Open to students in the Hospitality Business Real Estate Investment Management Minor or approval of school."}, "HB801": {"name": " Seminar in Hospitality Business", "semester": "On Demand", "credits": " 3", "description": "Issues of critical importance to hospitality business."}, "HB807": {"name": " Workforce Management in the Hospitality Industry", "semester": "Fall of odd years", "credits": " 3", "description": "Identifying and solving hospitality workforce problems. Topics include leadership styles, interpersonal and organization communication.", "restrictions": "Open to graduate students in the Eli Broad College of Business and The Eli Broad Graduate School of Management.", "alias": "HRI 807"}, "HB837": {"name": " Hospitality Information Technology", "semester": "Fall of every year", "credits": " 3", "description": "Overview of computer systems and networks designed for the hospitality industry.", "restrictions": "Open to graduate students in the Eli Broad College of Business and The Eli Broad Graduate School of Management."}, "HB841": {"name": " Contemporary Trends in Cuisine and Culture", "semester": "Fall of odd years", "credits": " 3", "description": "Contemporary trends in cuisine and culture from the perspectives of global impact on food safety, food marketing and distribution, food production and the cross cultural adaptation of cuisines throughout the world"}, "HB847": {"name": " Hospitality Business Law", "semester": "Spring of even years", "credits": " 3", "description": "Legal aspects of hospitality industry, including structure of the U.S. legal system, contracts, torts, discrimination, property and product liability. Administrative law and government regulation of the industry.", "restrictions": "Open to graduate students in the Eli Broad College of Business and The Eli Broad Graduate School of Management."}, "HB882": {"name": " Financial Management in the Hospitality Industry", "semester": "Spring of every year", "credits": " 3", "description": "Interpretation and analysis of financial statements. Budget preparation and analysis. Leasing, franchising, and management contracts.", "alias": "HRI 882"}, "HB885": {"name": " Hospitality Business Research", "semester": "Spring of every year", "credits": " 3", "description": "Management principles and practices in hospitality businesses. Product, sales, service income, and human resource strategies."}, "HB886": {"name": " Marketing in the Hospitality Industry", "semester": "Spring of every year", "credits": " 3", "description": "Understanding hospitality marketing in a global business environment. Industry responses to changing consumer trends. Applying marketing principles to case studies.", "restrictions": "Open to graduate students in the School of Hospitality Business or in the Hospitality Business Specialization.", "alias": "HB 875"}, "HB889": {"name": " Hospitality Industry Field Study", "semester": "On Demand", "credits": "Variable from 1 to 6", "description": "Research on a current issue, problem or opportunity in a segment of the hospitality industry. Industry relationships and networking. Faculty supervision in a field setting.", "restrictions": "Open to graduate students in the Eli Broad College of Business and The Eli Broad Graduate School of Management or approval of school."}, "HB890": {"name": " Independent Study", "semester": "On Demand", "credits": "Variable from 1 to 6", "description": "Faculty-supervised independent study.", "restrictions": "Open to graduate students in the Eli Broad College of Business and The Eli Broad Graduate School of Management or approval of school."}}}