{"code": "HRT", "name": "Horticulture", "courses": {"HRT100": {"name": " Horticulture: Plants and People", "semester": "Spring of every year", "credits": " 3", "description": "Functional uses of plants", "restrictions": "Not open to juniors or seniors in the Department of Horticulture."}, "HRT102": {"name": " Plants for Food, Fun, and Profit", "semester": "Fall of every year, Summer of every year", "credits": " 2", "description": "Introduction to the science and art of horticulture including plant breeding, ornamental plant and food production (organic and traditional), postharvest handling, horticultural industries and landscaping. Educate consumers about horticultural plants, products, and their relationship to environment."}, "HRT109": {"name": " Introduction to Applied Plant Science", "semester": "Fall of every year", "credits": " 2", "description": "Plant growth and development. Interrelationship between cultural practice and plant performance. Plant classification, plant physiology and metabolism.", "restrictions": "Open to students in the Institute of Agricultural Technology."}, "HRT111": {"name": " Landscape Design", "semester": "Spring of every year", "credits": " 3", "description": "Functional uses of the landscape, landscape design process, drafting and graphic representation, plant selection and use, planting design principles, construction materials and specifications. Offered first ten weeks of semester.", "alias": "HRT 072", "exclude": "HRT 311"}, "HRT124": {"name": " Introduction to Sustainable Agriculture and Food Systems", "semester": "Fall of every year, Spring of every year", "credits": " 2", "description": "Contemporary research and movements involving agricultural and food system sustainability. Socio-cultural factors influencing food and agriculture.", "restrictions": "Open to undergraduate students or agricultural technology students."}, "HRT135": {"name": " Crop Scouting and Investigation", "semester": "Spring of every year", "credits": " 3", "description": "Crop scouting and agricultural clientele interactions for improved crop management. Offered first ten weeks of semester.", "prerequisite": "CSS 101 or HRT 203", "restrictions": "Open to undergraduate students or agricultural technology students."}, "HRT203": {"name": " Introduction to Horticulture", "semester": "Fall of every year", "credits": " 3", "description": "Concepts and practices of horticulture. Crop selection and management, factors affecting plant growth and development, and plant identification. Field trip required.", "alias": "HRT 201"}, "HRT204": {"name": " Plant Propagation and Use", "semester": "Spring of every year", "credits": " 3", "description": "Asexual and sexual propagation. Genetic variation and plant selection/breeding. Plant production, use and plant identification. Field trip required.", "alias": "HRT 204L, HRT 104"}, "HRT205": {"name": " Plant Mineral Nutrition", "semester": "Spring of every year", "credits": " 1", "description": "Mineral elements required by plants. Essential elements, effect of soil and potting media on nutrient availability, absorption and function in plant physiology, and nutrient deficiency and toxicity symptoms. Methods of monitoring and managing plant nutrient levels. Class meets first five weeks of semester.", "prerequisite": "CSS 210"}, "HRT206": {"name": " Training and Pruning Plants", "semester": "Spring of every year", "credits": " 1", "description": "Principles and techniques of pruning for landscape and nursery ornamentals, Christmas tree production, tree fruits, and small fruits. Pruning practices, equipment, and basic large tree care techniques. Class meets last five weeks of the semester."}, "HRT207": {"name": " Horticulture Career Development", "semester": "Fall of every year", "credits": " 1", "description": "Internship preparation and identification of employment opportunities. Career goal establishment, resume construction, correspondence development, personal budgeting, interview skills and strategies."}, "HRT211": {"name": " Landscape Plants I", "semester": "Fall of every year", "credits": " 3", "description": "Identification, adaptation, and evaluation of shade trees, narrow-leaved evergreens, shrubs, woody vines, herbs, ornamental grasses, and herbaceous perennials.", "restrictions": "Open to undergraduate students or agricultural technology students."}, "HRT212": {"name": " Landscape Plants II", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Identification, adaptation, and evaluation of flowering trees and shrubs, evergreen trees and shrubs, ground covers and bulbs.", "restrictions": "Open to undergraduate students or agricultural technology students."}, "HRT213": {"name": " Landscape Maintenance", "semester": "Fall of every year, Spring of odd years", "credits": " 2", "description": "Ornamental plant management. Plant growth and development related to pruning, fertilization, irrigation, weed control, transplanting; development of landscape management specifications; integrated plant management and plant health care programs.", "restrictions": "Open to undergraduate students or agricultural technology students."}, "HRT213L": {"name": " Landscape Maintenance Field Laboratory", "semester": "Fall of every year", "credits": " 1", "description": "Landscape maintenance. Site analysis. Pruning woody plants, transplanting by hand and mechanical tree spade, and planting techniques for ornamentals. Herbaceous perennial care, cutting back, dividing. Scouting as a component of integrated pest management and plant health care programs.", "prerequisite": "HRT 213 or concurrently", "restrictions": "Open to undergraduate students or agricultural technology students."}, "HRT214": {"name": " Landscape and Turfgrass Business Operations", "semester": "Spring of every year", "credits": " 2", "description": "Organizing, marketing, and directing a business enterprise within the turf and landscape industry. Project estimating, bidding, payroll, equipment, and accounting. Offered first ten weeks of semester.", "restrictions": "Open to undergraduate students or agricultural technology students.", "alias": "AT 082"}, "HRT218": {"name": " Irrigation Systems for Horticulture", "semester": "Spring of every year", "credits": " 2", "description": "Irrigation design, installation, maintenance, hydraulics, equipment and component selection, pumps, troubleshooting, best management practices, water quality and conservation.", "restrictions": "Open to undergraduate students or agricultural technology students."}, "HRT218L": {"name": " Irrigation Systems for Horticulture Laboratory", "semester": "Spring of every year", "credits": " 1", "description": "Irrigation design, installation, maintenance, controller programming, assembly of equipment and components, electrical and hydraulic troubleshooting.", "prerequisite": "HRT 218 or concurrently", "restrictions": "Open to undergraduate students or agricultural technology students."}, "HRT219": {"name": " Landscape Computer Aided Design", "semester": "Spring of even years", "credits": " 2", "description": "Computer Aided Design (CAD) for landscape design. Calculations, take offs, perspective drawings using AutoCAD software. Offered first ten weeks of semester."}, "HRT220": {"name": " Annual and Aquatic Landscape Plants", "semester": "Fall of every year", "credits": " 3", "description": "Identification and evaluation of annuals, biennials and aquatic plants used in landscapes and for other horticultural purposes.", "restrictions": "Open to undergraduate students or agricultural technology students."}, "HRT221": {"name": " Greenhouse Structures and Management", "semester": "Fall of every year", "credits": " 3", "description": "Planning and operation of a commercial greenhouse. Structures, coverings, heating, cooling, ventilation, irrigation, fertilization, root media, and pest control."}, "HRT224": {"name": " Sustainable Farm and Food Systems Field Studies", "semester": "Fall of every year", "credits": " 1", "description": "Field visits to farm and food system operations that utilize sustainable practices in Michigan. Offered first half of semester.", "prerequisite": "CSS 124", "restrictions": "Not open to freshmen or agricultural technology students."}, "HRT231": {"name": " Clerkship in Grape Harvesting and Processing", "semester": "Fall of even years", "credits": " 1", "description": "Hands-on skills in the management of grape harvest and processing; winery and cellar operations. Course meets on-farm. Field trips required.", "restrictions": "Open to undergraduate students or agricultural technology students."}, "HRT232": {"name": " Principles of Viticulture", "semester": "Spring of even years", "credits": " 3", "description": "Grapevine physiology, grape production, cultural practices and vineyard management. Field trip required.", "prerequisite": "PLB 105", "restrictions": "Open to undergraduate students or agricultural technology students.", "alias": "HRT 432"}, "HRT233": {"name": " Field Practices of Viticulture", "semester": "Summer of even years", "credits": " 3", "description": "Cool climate grape production and vineyard management. Field trips required.", "prerequisite": "HRT 232", "restrictions": "Open to undergraduate students or agricultural technology students."}, "HRT234": {"name": " Current Issues in Viticulture and Enology", "semester": "Spring of even years", "credits": " 1", "description": "Grape, juice, and wine production. Current and new technologies. Wine sales and marketing. Vineyard and winery establishment and management. Presentations and discussions by MSU faculty and Michigan grape and wine industry professionals.", "restrictions": "Open to undergraduate students or agricultural technology students.", "alias": "HRT 334"}, "HRT242": {"name": " Passive Solar Greenhouses for Protected Cultivation", "semester": "Spring of every year", "credits": " 1", "description": "Season extension and year-round vegetable, herb, flower, and fruit production in unheated, low cost passive solar greenhouses. Marketing options, site selection, site preparation, structures, and organic crop management methods. Field trip required.", "restrictions": "Open to undergraduate students or agricultural technology students."}, "HRT243": {"name": " Organic Transplant Production", "semester": "Spring of every year", "credits": " 1", "description": "Seed ordering. Seed storage and seed germination. Vegetative propagation. Growing containers. Organic root media. Fertility, light, and temperature. Plant health. Hardening off. Considerations for organic certification. Field trip required."}, "HRT251": {"name": " Organic Farming Principles and Practices", "semester": "Spring of every year", "credits": " 3", "description": "History and principles of organic farming. Farms as ecological systems. Certification process and agencies. Organic matter management, the soil food web, and nutrient availability. Biodiversity, crop rotations, plant competition, ground cover, and plant health. Integrating crops and animals. Organic animal husbandry. Field trip required."}, "HRT253": {"name": " Compost Production and Use", "semester": "Spring of every year", "credits": " 1", "description": "Process and methods of composting, maturity and quality analysis, and use of compost products at home and farm scale. Field trip required.", "restrictions": "Open to undergraduate students or agricultural technology students."}, "HRT290": {"name": " Independent Study in Horticulture", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 4", "description": "A planned learning experience developed by the student in cooperation with a faculty member.", "restrictions": "Open to students in the Institute of Agricultural Technology.", "alias": "HRT 075"}, "HRT310": {"name": " Nursery Management", "semester": "Fall of every year", "credits": " 3", "description": "Management and cultural practices of field and container grown nursery operations. Site selection and development, financing, legal restrictions, personnel management, production practices, nutrition, irrigation, weed and pest control, modification of plant growth, storage, shipping, and marketing. Field trip required.", "prerequisite": "HRT 203 or HRT 109", "alias": "HRT 071, HRT 210"}, "HRT311": {"name": " Landscape Design and Management Specifications", "semester": "Spring of every year", "credits": " 4", "description": "Landscape design techniques, spatial organization, plant selection, plant and site interaction. Relationship between design, construction and maintenance. Preparation of planting and maintenance specifications.", "prerequisite": "HRT 211 and (HRT 212 or concurrently)"}, "HRT323": {"name": " Floriculture Production: Herbaceous Perennials and Annuals", "semester": "Spring of even years", "credits": " 3", "description": "Commercial greenhouse and outdoor production of herbaceous perennials, annuals, and other plants typically sold in retail nurseries for outdoor gardens. Plant identification, propagation, production, scheduling, and finishing procedures based on specific plant growth requirements. Plant selection, marketing, and retailing issues.", "prerequisite": "HRT 203 and (HRT 204 or concurrently) and HRT 221"}, "HRT332": {"name": " Tree Fruit Production and Management", "semester": "Fall of every year", "credits": " 3", "description": "Commercial apple, cherry, peach, and pear production. Cultural practices to manipulate growth and development and optimize fruit yields and quality. Field trips required.", "prerequisite": "HRT 203 or PLB 105 or PLB 203"}, "HRT336": {"name": " Viticulture and Berry Production", "semester": "Spring of every year", "credits": " 2", "description": "Commercial production of grapes, blueberries, strawberries, raspberries, blackberries, cranberries and minor fruit. Physiology, growth and development of these species. Cultural practices used to optimize fruit yields and quality. Field trip required.", "prerequisite": "HRT 203 or HRT 251", "alias": "HRT 335"}, "HRT341": {"name": " Vegetable Production and Management", "semester": "Spring of every year", "credits": " 3", "description": "Field production of vegetable crops. Marketing systems, tillage practices, field establishment, cultural management, pest management, harvesting, and postharvest handling and storage.", "prerequisite": "HRT 203 or (HRT 251 or concurrently)", "alias": "HRT 440, HRT 442"}, "HRT361": {"name": " Applied Plant Physiology", "semester": "Fall of every year", "credits": " 3", "description": "Whole plant physiological and growth responses of plants to light, temperature, and gases during commercial plant production. Coordination and management of growth for optimum production and quality.", "prerequisite": "PLB 105 or BS 161 or BS 171"}, "HRT362": {"name": " Applied Crop Improvement", "semester": "Spring of every year", "credits": " 1", "description": "History of plant improvement. Basic genetic principles of crop breeding and biotechnology. Class meets weeks 6 to 10 of the semester.", "prerequisite": "HRT 203 and PLB 105"}, "HRT401": {"name": " Advanced Horticultural Crop Physiology", "semester": "Spring of every year", "credits": " 3", "description": "Physiological and flowering responses of horticultural crop plants to environmental variables. Adaptive responses of plants to environmental stress Management of these factors for optimum production.", "prerequisite": "HRT 361 or PLB 301", "restrictions": "Not open to freshmen or sophomores.", "alias": "HRT 480"}, "HRT403": {"name": " Handling and Storage of Horticultural Crops", "semester": "Fall of every year", "credits": " 3", "description": "Biological principles involved in quality maintenance of horticultural products. Control of deterioration during harvesting, handling, transport, and storage.", "prerequisite": "BS 161 or PLB 105", "restrictions": "Not open to freshmen or sophomores.", "alias": "HRT 482"}, "HRT404": {"name": " Horticulture Management (W)", "semester": "Spring of every year", "credits": " 3", "description": "Integration of management, economic, marketing, and horticultural production principles to develop personnel, financial, and resource strategies. Horticultural business plan development in a team situation. Effects of business decisions on people and profits.", "prerequisite": "(HRT 203) and completion of Tier I writing requirement", "restrictions": "Open to seniors in the College of Agriculture and Natural Resources.", "alias": "HRT 488"}, "HRT405": {"name": " Sustainable Practices for Horticultural Food Crop Production", "semester": "Spring of every year", "credits": " 1", "description": "Effects of horticultural practices on ecosystem services, integrated efficiency across perennial and annual food crop production systems. Impact of crops on the land and biodiversity. Management decision-making. Global forces impacting sustainability.", "prerequisite": "HRT 203"}, "HRT407": {"name": " Horticulture Marketing", "semester": "Fall of every year", "credits": " 3", "description": "Demographic and purchase trends of perishable horticultural commodities including landscape and floral crops, and fruits and vegetables. Market segmentation and product targeting, distribution, branding and packaging, and advertising and promotion. Services as a critical component of strategic business planning.", "restrictions": "Open to juniors or seniors or graduate students in the College of Agriculture and Natural Resources."}, "HRT411": {"name": " Landscape Contract Management", "semester": "Fall of every year", "credits": " 3", "description": "Management of landscape construction and maintenance operations. Working drawing, contracts, bonds, and insurance. Estimating and bidding procedures. Installation techniques for hardscapes and plant material.", "prerequisite": "HRT 311"}, "HRT415": {"name": " Natural Landscapes, Native Plants and Landscape Restoration", "semester": "Fall of even years", "credits": " 3", "description": "Natural landscapes, native plants and landscape restoration options for natural and built environments. Planning and design approaches, site engineering, construction practices, and management guidelines. Case studies, regulatory policies, contract services, resources and issues. Field trip required.", "prerequisite": "HRT 211 or HRT 212 or BS 162 or LB 144", "restrictions": "Not open to freshmen."}, "HRT417": {"name": " Sustainable Sites and Environmental Landscape Practices", "semester": "Fall of odd years", "credits": " 3", "description": "Sustainable sites and environmental landscape practices integrated into the built environment. Planning and design approaches, site engineering, construction practices, and management guidelines. Case studies, specifications, certification programs.", "prerequisite": "HRT 211 or HRT 212", "restrictions": "Not open to freshmen."}, "HRT424": {"name": " Sustainable Agriculture and Food Systems: Integration and Synthesis", "semester": "Fall of every year", "credits": " 3", "description": "Biogeochemical and socio-economic aspects of food, fiber, and fuel production. Environmental impacts and social context. Experiential learning projects.", "prerequisite": "CSS 124 and (CSS 224 or concurrently)", "restrictions": "Open to juniors or seniors or graduate students."}, "HRT430": {"name": " Exploring Wines and Vines", "semester": "Spring of every year", "credits": " 3", "description": "Consumer-oriented study of wine history, production methods, climatic influences, cultural impacts, social responsibility, and economic impact of wine industry as part of modern agriculture. Sensory evaluation and its relationship to food pairings.", "restrictions": "Approval of department."}, "HRT441": {"name": " Plant Breeding and Biotechnology", "semester": "Spring of even years", "credits": " 3", "description": "Plant improvement by genetic manipulation. History of plant breeding. Traditional and biotechnological means of improving plant cultivars by genetic manipulation. Importance of plant breeding to our food system, economy, and environment.", "prerequisite": "(CSS 350 or concurrently) or (IBIO 341 or concurrently)"}, "HRT451": {"name": " Biotechnology Applications for Plant Breeding and Genetics", "semester": "Spring of every year", "credits": " 3", "description": "Principles, concepts, and techniques of agricultural plant biotechnology. Recombinant DNA technology, plant molecular biology and transformation in relation to plant improvement.", "prerequisite": "CSS 350 or IBIO 341", "restrictions": "Open to juniors or seniors or graduate students."}, "HRT460": {"name": " Green Roofs and Walls", "semester": "Fall of every year", "credits": " 2", "description": "Green roof and wall design and installation practices including plant species and substrates. Environmental impact, ecosystem services, integration with other environmental practices. Influence of economics, public policy, and industry organizations on the implementation of green roofs on a wide scale. Multidisciplinary nature of planning and implementation of successful green roof and wall projects.", "prerequisite": "HRT 203 or FW 101 or GEO 206 or PDC 120 or EGR 100", "restrictions": "Open to juniors or seniors or graduate students."}, "HRT461": {"name": " Seminar in Plant, Animal and Microbial Biotechnology", "semester": "Spring of every year", "credits": " 1", "description": "Current applications of plant, animal and microbial biotechnology in agriculture and related industries. Technologies under development and factors associated with moving from laboratory to product development. Field trips required.", "prerequisite": "(ANS 425 or concurrently) or (BE 360 or concurrently) or (CSS 451 or concurrently) or (MMG 445 or concurrently)"}, "HRT475": {"name": " International Studies in Horticulture", "semester": "Spring of odd years, Summer of every year", "credits": "Variable from 1 to 6", "description": "Study and travel experience emphasizing contemporary problems, issues, and trends in horticulture.", "restrictions": "Approval of department; application required."}, "HRT477": {"name": " Pesticides in Pest Management", "semester": "Fall of even years", "credits": " 3", "description": "Chemistry, modes of action, product development and regulation of pesticides. Environmental and social aspects of pesticide use.", "restrictions": "Open to juniors or seniors or graduate students."}, "HRT486": {"name": " Biotechnology in Agriculture: Applications and Ethical Issues", "semester": "Fall of even years", "credits": " 3", "description": "Current and future roles of biotechnology in agriculture", "prerequisite": "BS 161 or PLB 105", "restrictions": "Not open to freshmen or sophomores."}, "HRT490": {"name": " Independent Study", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 2", "description": "Independent study of horticulture on a field, laboratory, or library research program of special interest to the student.", "prerequisite": "HRT 203 and HRT 204", "restrictions": "Approval of department; application required."}, "HRT491": {"name": " Selected Topics in Horticulture", "semester": "Fall of every year, Spring of every year", "credits": "Variable from 1 to 3", "description": "Selected topics in horticulture of current interest and importance.", "prerequisite": "HRT 203 and HRT 204", "restrictions": "Not open to freshmen or sophomores."}, "HRT492": {"name": " Undergraduate Research", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 2", "description": "Mentored field or laboratory research experience.", "prerequisite": "HRT 203 and HRT 204", "restrictions": "Approval of department; application required."}, "HRT493": {"name": " Professional Internship in Horticulture", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": " 3", "description": "Professional career-related work experience supervised by a professional horticulturist.", "prerequisite": "HRT 203 and HRT 204", "restrictions": "Open to seniors. Approval of department; application required. A student may earn a maximum of 6 credits in all enrollments for any or all of these courses"}, "HRT812": {"name": " Laboratory Research Techniques", "semester": "Fall of even years", "credits": " 2", "description": "Demonstration and experience using various research techniques.", "restrictions": "Open to graduate students in the Department of Horticulture."}, "HRT816": {"name": " Environmental Design Theory", "semester": "Fall of every year", "credits": " 3", "description": "Differences between normative theories, scientific theories, models, and constructs. Exploration of normative theories related to thesis or practicum."}, "HRT817": {"name": " Environmental Design Studio", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Development of a student-selected environmental design project in a collaborative setting."}, "HRT819": {"name": " Advanced Plant Breeding", "semester": "Fall of even years", "credits": " 3", "description": "Genetic expectations resulting from breeding strategies with cross- and self-pollinated crop plants. Germplasm collections, mapping populations, and modifications of reproductive biology useful for crop improvement."}, "HRT820": {"name": " Plant Reproductive Biology and Polyploidy", "semester": "Spring of odd years", "credits": " 1", "description": "Genetic processes underlying variations in plant reproductive biology and polyploidy. Utilization of these characteristics in plant breeding."}, "HRT840": {"name": " Agroforestry Systems", "semester": "Fall of every year", "credits": " 3", "description": "Agroforestry systems with a local and global perspectives, abbreviate biological and chemical processes in agroforestry ecosystems, effects and potential of agroforestry on forest dependent communities, climate change and ecosystem sustainability. Field trips required."}, "HRT853": {"name": " Plant Mineral Nutrition", "semester": "Fall of odd years", "credits": " 3", "description": "Inorganic ion transport in plant cells and tissues. Physiological responses and adaptation to problem soils. Genetic diversity in nutrient uptake and use by plants. Physiological roles of elemental nutrients in crop growth."}, "HRT860": {"name": " Scientific Writing: Workshop", "semester": "Spring of every year", "credits": " 1", "description": "Development of scientific writing skills.", "restrictions": "Open to graduate students."}, "HRT863": {"name": " Environmental Plant Physiology", "semester": "Spring of odd years", "credits": " 3", "description": "Interaction of plant and environment. Photobiology, thermophysiology, and plant-water relations.", "alias": "BOT 863"}, "HRT865": {"name": " Plant Growth and Development", "semester": "Fall of even years", "credits": " 3", "description": "Genetics and molecular biology of development in higher plants as influenced by genes and environment. Biosynthesis, action and signal transduction of phytohormones and other signaling molecules. Initiation, formation and patterning of plant organs and cell types. Genetic mechanisms underlying developmental diversity.", "alias": "BOT 865"}, "HRT883": {"name": " Environmental Design Seminar", "semester": "Spring of every year", "credits": " 3", "description": "Examination of the breadth of environmental design projects. Literature review of focused projects. Development of practicum or thesis proposals.", "restrictions": "Open to graduate students in the Department of Horticulture or in the School of Planning, Design and Construction.", "alias": "HRT 883"}, "HRT890": {"name": " Independent Study", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 4", "description": "Individual study of problems of special interest.", "restrictions": "Approval of department."}, "HRT891A": {"name": " Selected Topics in Horticulture", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 3", "description": "Horticultural science topics of current interest and importance.", "restrictions": "Open only to graduate students in the Department of Horticulture. Approval of department."}, "HRT891B": {"name": " Selected Topics in Plant Breeding and Genetics", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 2", "description": "Selected topics in plant breeding.", "restrictions": "Open only to graduate students in the Plant Breeding and Genetics major or Genetics major. Approval of department."}, "HRT892": {"name": " Plant Breeding and Genetics Seminar", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": " 1", "description": "Experience in review, organization, oral presentation, and analysis of research."}, "HRT894": {"name": " Horticulture Seminar", "semester": "Fall of every year, Spring of every year", "credits": " 1", "description": "Experience in review, organization, oral presentation and analysis of research."}, "HRT898": {"name": " Master's Research", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 6", "description": "Master's degree Plan B project.", "restrictions": "Approval of department."}, "HRT899": {"name": " Master's Thesis Research", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 10", "description": "Master's thesis research.", "restrictions": "Open only to graduate students in the Department of Horticulture."}, "HRT941": {"name": " Quantitative Genetics in Plant Breeding", "semester": "Spring of even years", "credits": " 3", "description": "Theoretical and genetic basis of statistical analysis of quantitative traits using genetic markers. Computational tools for the study of quantitative traits."}, "HRT999": {"name": " Doctoral Dissertation Research", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 24", "description": "Doctoral dissertation research.", "restrictions": "Open to doctoral students in the Department of Horticulture."}}}