{"code": "HST", "name": "History", "courses": {"HST110": {"name": " Historical Approaches to Contemporary Issues", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Origins, contexts, and meaning of a current issue. Use of historical methods to understand an important problem or issue."}, "HST140": {"name": " World History to 1500", "semester": "Fall of every year, Spring of every year", "credits": " 4", "description": "Similarities and distinctive qualities of civilizations in the pre-modern era. Social, cultural, and economic influences and interactions."}, "HST150": {"name": " World History since 1500", "semester": "Fall of every year, Spring of every year", "credits": " 4", "description": "The making of the modern world with focus on international relations. Major changes in culture and human understanding of the world."}, "HST160": {"name": " Introduction to Asian History and Culture", "semester": "Fall of every year", "credits": " 4", "description": "History and culture of East, South and Southeast Asia in the early modern and modern periods."}, "HST201": {"name": " Historical Methods and Skills", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": " 3", "description": "The nature and discipline of history. Introduction to analytical and interpretive reading and writing, historical research, and historical methodologies.", "exclude": "HST 201H"}, "HST201H": {"name": " Historical Methods and Skills for Honors Students", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "The nature and discipline of history. Introduction to analytical and interpretive reading and writing, historical research, and historical methodologies.", "restrictions": "Open to students in the Honors College.", "exclude": "HST 201"}, "HST202": {"name": " U.S. History to 1876", "semester": "Fall of every year, Spring of every year", "credits": " 4", "description": "Major topics and themes in U.S. history from the colonial and revolutionary periods through the Civil War and reconstruction."}, "HST203": {"name": " U.S. History since 1876", "semester": "Fall of every year, Spring of every year", "credits": " 4", "description": "Major topics and themes in U.S. history from 1876 to the present including such topics as political development, social change, women's history, race and ethnicity."}, "HST205": {"name": " The Ancient Mediterranean and the Medieval World", "semester": "Fall of every year", "credits": " 4", "description": "Major political, cultural, social and economic developments and themes from the ancient civilizations to the late Middle Ages. Mesopotamia and Egypt. Greece and Rome. Charlemagne and the Franks. Normans and Crusaders. Popes and feudal monarchs. Bubonic plagues. The early Renaissance.", "alias": "HST 205A, HST 205B"}, "HST206": {"name": " European History since 1500", "semester": "Fall of every year, Spring of every year", "credits": " 4", "description": "Major topics in European history from 1500 to present including Reformation, Renaissance, Enlightenment, the French Revolution, social, political changes in nineteenth century, nature of twentieth century."}, "HST208": {"name": " Introduction to African History, Culture and Society", "semester": "Summer of every year", "credits": " 4", "description": "General survey of the history, culture and society of Africa, from around 1500 to the present. Interplay between internal and external socio-economic, political, cultural and religious forces in African societies."}, "HST209": {"name": " Traditional East Asia", "semester": "Fall of every year", "credits": " 4", "description": "Major trends in the history, government, religion, philosophy, society and cultures of China, Japan and Korea."}, "HST210": {"name": " Modern East Asia", "semester": "Spring of every year", "credits": " 4", "description": "Major trends in the history, government, religion, philosophy, society and cultures of China, Japan and Korea. Evolving East-West contacts."}, "HST211": {"name": " Colonial Latin America", "semester": "Fall of every year", "credits": " 4", "description": "Political, economic and social structures in the Spanish and Portuguese empires. Emergence of multi-racial, multi-cultural societies through the interaction of Amerindians, Europeans and Africans.", "alias": "HST 380"}, "HST212": {"name": " National Latin America", "semester": "Spring of every year", "credits": " 4", "description": "Political, economic and social history of Latin America from the 1820s to the present, including relations between Latin America and the United States.", "alias": "HST 381"}, "HST213": {"name": " U.S. Business and Economic History", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Evolution of American economy from colonial period to the present. Relationship between government and business. The relationship of labor to industry and government. Political culture and the world of business."}, "HST220": {"name": " History of Food and Alcohol", "semester": "Spring of every year", "credits": " 3", "description": "How food and alcohol have shaped world history. Relationship to politics, nationalism, religion, economics and culture. Consumption, trade, migration, slavery, globalization, environmental impacts."}, "HST225": {"name": " Law, History and Society in the United States", "semester": "Spring of every year", "credits": " 3", "description": "Legal history of the United States. How law shapes and is shaped by culture and society. Framing the Constitution. Religious freedom. Gender and the law. Race and the law."}, "HST250": {"name": " History and Technology of the Digital Age", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": " 3", "description": "Historical foundations of modern computing technology."}, "HST251": {"name": " Doing Digital History", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Historical data mining. New technologies for historical data analysis. Web-based presentations of historical material."}, "HST255": {"name": " American Cinema and the American Century", "semester": "Fall of every year, Summer of every year", "credits": " 3", "description": "History, evolution and transformation of the film industry in the extended twentieth century. From penny arcades and nickelodeons to the leading section of the global entertainment industry. Social and economic circumstances shaping developments in the film industry. Representations of race, gender and class in motion pictures. Production, distribution, consumption and reception of motion pictures in specific historical periods."}, "HST260": {"name": " Navigations and Encounters in an Age of Discovery", "semester": "Fall of odd years", "credits": " 3", "description": "European voyages and navigations, 1400-1600. Developments in cartography and technology. Cultural encounters with non-European peoples."}, "HST281": {"name": " Atlantic Slavery", "semester": "Spring of even years", "credits": " 3", "description": "Slavery and human trafficking in western Europe, Africa and the Americas from the fifteenth century to the present."}, "HST293": {"name": " Witches, Demons and the Occult in Pre-Modern Europe", "semester": "Fall of every year", "credits": " 3", "description": "Witch hunts in Europe in their religious and social contexts. European beliefs about magic, demonology and the occult from the late Middle Ages to c. 1700."}, "HST294": {"name": " History of Catholicism, Late Antiquity to the Present", "semester": "Spring of odd years", "credits": " 3", "description": "Roman Catholicism. Changing structures of administration, instruments of repression, and responses to and impact on social, cultural and political transformations. Missionary movements, orders and councils."}, "HST295": {"name": " The Nazis", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Genesis of National Socialism and its trajectory as a political movement and dictatorship. Life in the Third Reich. Regime's military and genocidal aims. Role of Adolf Hitler."}, "HST301": {"name": " Indigenous-European Encounters in North America", "semester": "Fall of every year", "credits": " 3", "description": "European-Indigenous encounters and long-term perspectives on Indigenous and European contact"}, "HST302": {"name": " Revolutionary America", "semester": "Spring of every year", "credits": " 3", "description": "The American Revolutionary era in an international context, 1763-1826. Liberty and equality in a world of empires, republics and slavery. Role of gender, race and class in defining the meaning of the revolution. The U.S. Constitution. Early American diplomacy in transition from colony to nation."}, "HST303": {"name": " The Young American Republic", "semester": "Fall of every year", "credits": " 3", "description": "Rise of political democracy in the United States, 1820-1850. Emergence of a market economy and industrialization. Movements by laborers, women, African Americans, immigrants and Native Americans to expand rights. Religious and cultural change. Sectional conflict between North and South. Westward expansion, Oregon Trail, Gold Rush."}, "HST304": {"name": " The Civil War Era", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": " 3", "description": "Political, constitutional, social, economic and military conflict between the North and the South, 1848-1876. Political realignment and birth of the Republican Party. States rights and secession. U.S. and C.S.A governments at war. Military campaigns, strategies, leadership. Slavery, emancipation, equal rights. Reconstruction."}, "HST305": {"name": " The Making of the Modern United States", "semester": "Spring of every year", "credits": " 3", "description": "Social, economic, and political transformations, 1877-1929. Rise of the modern United States. Gilded Age, robber barons, high finance. Industrialization. Science, technology and innovation. Populism, Jim Crow, woman suffrage, labor unrest, immigration, ethnicity. Imperialism. Progressive reform. Popular culture, amusements, media."}, "HST306": {"name": " Modern United States", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "United States history from 1920 to the present. Transformations in political, economic, and social institutions and Americans' responses to these changes. Development of the welfare-warfare state. The transformation to a post-industrial economy. Political and cultural responses to these changes."}, "HST309": {"name": " American Indian History: Precontact to the Present", "semester": "Spring of every year", "credits": " 3", "description": "Gendered overview of indigenous history in the Americas. Precontact, encounter, intrusion and resistance to settler colonialism, forced removal, reservations, boarding schools, allotment, indigenous sovereignty.", "alias": "HST 378, HST 379"}, "HST310": {"name": " African American History to 1876", "semester": "Fall of every year", "credits": " 3", "description": "American slavery in the mainland colonies. Establishment and nature of free black communities. The impact of emancipation."}, "HST311": {"name": " African American History since 1876", "semester": "Spring of every year", "credits": " 3", "description": "Blacks in America from Reconstruction to the present. Grass roots and cultural revitalization. The Civil Rights movement and black power."}, "HST312": {"name": " African American Women", "semester": "Spring of every year", "credits": " 3", "description": "Black women in American history. Slavery, the work place, politics, and the Civil Rights movement."}, "HST313": {"name": " Women in the United States to 1869", "semester": "Fall of every year", "credits": " 3", "description": "United States history through the experiences of women. Gender, family, work, and political activism."}, "HST314": {"name": " Women in the United States since 1869", "semester": "Spring of every year", "credits": " 3", "description": "United States history through the experiences of women. Gender, family, work, and political activism."}, "HST315": {"name": " American Intellectual History to 1860", "semester": "Fall of every year", "credits": " 3", "description": "Development and influence of major ideas from the colonial period to 1860. Topics include Puritanism, the Enlightenment, Romanticism, and the women's movement."}, "HST316": {"name": " United States Intellectual History since 1860", "semester": "Spring of every year", "credits": " 3", "description": "Development and influence of major ideas from 1860 to present. Topics include Social Darwinism, imperialism, religion, and women's rights."}, "HST317": {"name": " American Jewish History", "semester": "Spring of every year", "credits": " 3", "description": "American Jewish history from colonial period to present. Jewish immigration to the United States, patterns of religious and cultural adjustment, social relations and anti-Semitism, Jewish politics, the construction of Jewish identities."}, "HST318A": {"name": " United States Constitutional History to 1890", "semester": "Fall of every year", "credits": " 3", "description": "Formation of the Union. Articles of Confederation. Origins, formation, and development of the Constitution. Role of the Supreme Court. Landmark cases. Law and society. Economic issues. Slavery and emancipation.", "restrictions": "Not open to freshmen or sophomores.", "alias": "HST 318"}, "HST318B": {"name": " United States Constitutional History from 1877", "semester": "Spring of every year", "credits": " 3", "description": "Social, economic, political and legal developments affecting the interpretation of the Constitution from the end of Reconstruction to the present. Role of the Supreme Court. Landmark cases.", "restrictions": "Not open to freshmen or sophomores.", "alias": "HST 318"}, "HST319": {"name": " Asian American History", "semester": "Spring of every year", "credits": " 4", "description": "Survey of Asian American history from mid-nineteenth century to present. Analysis of shared and different experiences of the Chinese, Japanese, Korean, Filipino, Vietnamese, Hmong, and East Indian peoples who have come to the United States.", "restrictions": "Not open to freshmen or sophomores."}, "HST320": {"name": " History of Michigan", "semester": "Fall of every year", "credits": " 3", "description": "Political, social, and economic development from colonial beginnings to the present."}, "HST321": {"name": " History of the American West", "semester": "Fall of odd years", "credits": " 3", "description": "Westward movement of people from European and African origins into Native American lands. Contact and conflict among cultures. Role of the west in national economic and political development."}, "HST322": {"name": " History of the American South", "semester": "Fall of even years", "credits": " 3", "description": "Development of southern society, with emphasis on relationships among the races. Role of the south in economic, social, and political development of the nation."}, "HST324": {"name": " History of Sport in America", "semester": "Spring of every year", "credits": " 3", "description": "Social and cultural ramifications of colonial sport. Rise of modern sport in the nineteenth century. Social significance of sport in modern America with special attention to economics, gender, race, and politics."}, "HST325": {"name": " United States Foreign Relations to 1914", "semester": "Fall of every year", "credits": " 3", "description": "Foreign policy of the United States from Benjamin Franklin and the origins of the nation to 1914. Topics include Jeffersonian foreign policy, the War of 1812, the Monroe Doctrine, and the rise to world power."}, "HST326": {"name": " United States Foreign Relations since 1914", "semester": "Spring of every year", "credits": " 3", "description": "Foreign policy of the United States from the outbreak of World War I to the present. Topics include Wilson's foreign policy, the policy of isolation, World War II, the Cold War, the Vietnam War, and current developments."}, "HST327": {"name": " History of Mexican Americans in the United States", "semester": "Fall of every year", "credits": " 3", "description": "Mexican American history from 1492 to present. Cultural, social, economic, and political activities of Mexican Americans. Relationship of Mexican Americans to other groups."}, "HST328": {"name": " Military History of the United States 1900-Present", "semester": "Fall of every year", "credits": " 3", "description": "Military history of the United States in the twentieth and twenty-first centuries. American involvement in major conflicts"}, "HST329": {"name": " College Sports in the United States", "semester": "Fall of every year, Summer of every year", "credits": " 3", "description": "Origins of sports in higher education. Effects of industrialization and television. Civil rights movement in sports"}, "HST330": {"name": " Ancient Greek History to 200 BCE", "semester": "Fall of every year", "credits": " 3", "description": "Major social, cultural and political themes in the history of ancient Greece from the Bronze Age to Alexander the Great. Minoan and Mycenaean civilization, rise of the polis, Athenian democracy, Persian and Peloponnesian Wars, Alexander's empire. Consideration of art, architecture, literature, religion, women, and gender."}, "HST331": {"name": " Ancient Roman History 200 BCE to 500 CE", "semester": "Spring of every year", "credits": " 3", "description": "Social, economic, and political history of Rome from its origins until the collapse of the Mediterranean empire."}, "HST332": {"name": " Medieval Europe", "semester": "Spring of every year", "credits": " 3", "description": "Europe in the Middle Ages. End of the Western Roman Empire. Germanic kingdoms. Islam and the Mediterranean. The Christian church in the early Middle Ages. Carolingian empire and renaissance. The Vikings. Medieval learning. Chivalry. Formation of states. Feudal tenure. Economic revival and growth of towns. Hundred Years War. The Black Death. Popular Rebellion. Religion and Spirituality.", "alias": "HST 332A, HST 332B, HST 333"}, "HST334A": {"name": " Renaissance and Reformation Europe", "semester": "Fall of even years", "credits": " 3", "description": "Western Europe from 1450 to 1575. Intellectual developments of the Renaissance. Religious trends of the Reformation and Counter-Reformation. Political and imperial history.", "alias": "HST 334"}, "HST334B": {"name": " Seventeenth-Century Europe", "semester": "Spring of odd years", "credits": " 3", "description": "European history from 1575 to 1715. Rise of modern states. Thirty Years' War. Absolutism and revolt. Growth of Empire. Scientific revolution.", "alias": "HST 334"}, "HST335": {"name": " Europe in the Age of Revolution, 1700-1870", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "European political, social, economic, and cultural developments from the Old Regime to German unification. Topics include the French Revolution, the Industrial Revolution and the Revolutions of 1848."}, "HST336": {"name": " Europe from Bismarck to Brexit", "semester": "Spring of every year", "credits": " 3", "description": "Politics, society, economy, and culture of Europe and Europe's relations with the wider world, from 1870 to the present, focusing on histories of violence and conflict and struggles for community, including world wars, revolutions, colonialism, decolonization, and European integration."}, "HST338": {"name": " European Power, Culture and Thought: The Modern Era", "semester": "Spring of every year", "credits": " 3", "description": "Ideas in historical context, 1750-1980. Enlightenment, revolution, conservatism, romanticism. Liberalism, socialism, Marx. Science, realism; anti-positivism, Nietzsche, Freud. Modernism in art and social theory. Feminism. World Wars, Fascism, Communism. Existentialism, structuralism, post-modernism.", "restrictions": "Open to undergraduate students."}, "HST340": {"name": " England and Its Culture to 1688", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Political, social, economic, religious, and intellectual developments from the Anglo-Saxons to the revolution of 1688."}, "HST341": {"name": " Modern Britain since 1688", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Political, economic, and social survey of monarchy and party government, industrial development, rise and decline of Empire, democratization and social programs, the world wars, and cultural and literary trends."}, "HST342": {"name": " Modern Eastern Europe", "semester": "Fall of every year", "credits": " 3", "description": "Roots of national and social conflict in the lands between Germany and Russia, from the Baltic to the Balkans, in the 19th and 20th centuries. Formation of independent states, the rise and collapse of Communism, and ethnic tensions in former Yugoslavia."}, "HST343": {"name": " Russia from Peter the Great to Lenin", "semester": "Fall of every year", "credits": " 3", "description": "Interplay between Westernization, modernization, and imperial expansion in Imperial Russia. Revolutionary, nationalist, and peasant resistance."}, "HST344": {"name": " Russia in the Twentieth Century", "semester": "Spring of every year", "credits": " 3", "description": "End of Imperial Russia. Soviet Union from the 1917 Revolution to 1991. Post-Soviet Russia and other successor states. Bolshevism, Stalinism, social transformation and identities."}, "HST347": {"name": " Modern France", "semester": "Fall of every year", "credits": " 3", "description": "Politics and society from the French Revolution to the present. Impact industrialization. Changing political culture. Role of gender in society."}, "HST348": {"name": " Modern Germany", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Enlightenment, industrial and political revolutions, and national unification. Jewish emancipation and antisemitism, Catholicism and Protestantism. Nationalism and militarism. World War I, Weimar, Nazism, Holocaust. Postwar developments, reunification and aftermath."}, "HST351": {"name": " Constitutional and Legal History of England since 1400", "semester": "Spring of every year", "credits": " 3", "description": "Developments from Henry IV's accession to the present. Constitutional principles of the Stuart monarchy and of the Glorious Revolution that underlie the modern constitution.", "restrictions": "Not open to freshmen or sophomores."}, "HST355": {"name": " Spain and the Muslim World", "semester": "Fall of odd years", "credits": " 3", "description": "Spain and Portugal within and in relation to the Muslim world, especially North Africa, from the thirteenth century to approximately 1700. Muslim Iberia. Convivencia and Reconquista. Jewish communities. Expulsions and forced conversions. Moriscos and Conversos. Renegades and mercenaries. Captivity and ransom. Trade, diplomacy and warfare."}, "HST363": {"name": " East Africa in the Twentieth Century", "semester": "Fall of even years", "credits": " 3", "description": "Background up to 1500. European invasions, colonialism, nationalism, and independence.", "restrictions": "Not open to freshmen"}, "HST364": {"name": " South Africa: From Shaka Zulu to Mandela", "semester": "Fall of every year", "credits": " 3", "description": "Social, political, and economic history. Rise of the Zulu State. European conquest and colonization. The mineral revolution. Segregation and apartheid. The liberation struggle. Democracy after 1994."}, "HST365": {"name": " The Vietnam War", "semester": "Fall of every year", "credits": " 3", "description": "French colonial rule and the rise of Vietnamese nationalism. Communism and the Vietnamese revolution. The Cold War and American intervention. Reunification and economic renovation."}, "HST366": {"name": " Modern Southeast Asia", "semester": "Spring of even years", "credits": " 3", "description": "Southeast Asia from 1500 to the present. Foundations of southeast Asian cultures. Religious revolutions and the rise of absolutist states. Trade and early contacts with the West. Indigenous and European empires. Forms of and responses to colonialism. Nationalist movements and independence."}, "HST367": {"name": " Imperial China", "semester": "Fall of every year", "credits": " 3", "description": "Traditional China from the earliest period to the end of the Qing dynasty. Dynastic and state structure. Confucian, Taoist, and Buddhist traditions. Everyday lives of women and men. Social practices. Economic influences."}, "HST368": {"name": " China since 1900", "semester": "Spring of every year", "credits": " 3", "description": "Political, social, economic, and cultural developments. The nationalist and communist revolutions. China under communism, 1940s to present."}, "HST369": {"name": " Japan in the Age of the Samurai", "semester": "Spring of every year", "credits": " 3", "description": "Japan before 1800. Exploration of political, religious, and literary developments including Buddhism and Shinto, foreign relations and state formation, poetry and theater. Evolution of women’s roles, samurai and warfare, and early modern popular culture."}, "HST370": {"name": " Modern Japan: History, Culture, and Society", "semester": "Fall of every year", "credits": " 3", "description": "Japan since 1800. Transformation of Japan's political structure, society, and economy from a feudalist country to a modern and militant empire, then from a war-torn and destitute nation to an economic giant with a flourishing culture in the contemporary world."}, "HST371": {"name": " Women and Gender in Asia", "semester": "Fall of every year", "credits": " 3", "description": "Women in Asian societies, including political and religious leaders, merchants and traders, authors and artists, as well as ordinary women. Family structures, patriarchy and gendered social roles."}, "HST372": {"name": " The Middle East: Islam and Empires", "semester": "Fall of every year", "credits": " 3", "description": "Survey of North Africa and the Arab, Persian, and Turkic lands of Southwest Asia from the rise of Islam to the early nineteenth century."}, "HST373": {"name": " The Modern Middle East: From Empires to Nation States", "semester": "Spring of every year", "credits": " 3", "description": "Survey of the Middle East from Napoleon's invasion of Egypt (1798) to the present. Reforms and revolutions in the Safawid and Ottoman Empires. European colonialism. World War I. Rise of nation states. World War II. Islamic revolution in Iran. Modern movements. Political, cultural, social, and economic developments."}, "HST382": {"name": " Modern Brazil", "semester": "Spring of every year", "credits": " 3", "description": "Political, economic, and social history from independence to the present. The state and the economy, social changes, and political developments."}, "HST383": {"name": " The Caribbean", "semester": "Spring of every year", "credits": " 3", "description": "Political, economic, and social history. Sugar and slavery, nationalism, and relations with the United States."}, "HST384": {"name": " Modern Mexico", "semester": "Fall of every year", "credits": " 3", "description": "Political, economic, and social history, including United States-Mexican relations."}, "HST387": {"name": " The First World War", "semester": "Fall of every year", "credits": " 3", "description": "Causes of World War I, conduct of the war, and its consequences. Political, diplomatic, economic and social factors. Technological and cultural aspects.", "alias": "HST 415"}, "HST388": {"name": " World War II: Causes, Conduct and Consequences", "semester": "Spring of every year", "credits": " 3", "description": "Causes of World War II, conduct of the war and its consequences. Political, diplomatic, economic and social factors as well as technological and artistic aspects.", "alias": "HST 414"}, "HST389": {"name": " World War II in Asia and the Pacific", "semester": "Fall of every year", "credits": " 3", "description": "World War II with specific reference to Asia and the Pacific theater. Historical contexts, legacies and memories in popular culture. Relationship to modern colonialism, decolonization, nationalism and racism."}, "HST390": {"name": " History of International Relations", "semester": "Spring of every year", "credits": " 3", "description": "Evolution of the nation state system. Its spread from Europe throughout the world and the consequences of that spread."}, "HST391": {"name": " Environmental History of North America", "semester": "Spring of every year", "credits": " 3", "description": "Interaction of peoples of North America and their natural environments."}, "HST392": {"name": " History of the Holocaust", "semester": "Spring of every year", "credits": " 3", "description": "Nazi persecution and genocide in Europe, 1933-1945. Jewish experience within broader context. Perpetrators, victims, bystanders, and resistors. Post-Holocaust memory, film, literature, and philosophical implications."}, "HST394": {"name": " The Space Age", "semester": "Summer of every year", "credits": " 3", "description": "The exploration and science of aeronautics and space from the age of Galileo to the present. International relations as a driving force in technological advances. Cultural understandings and imaginings of space and space travel."}, "HST396": {"name": " The City and its Discontents: Perspectives Past and Present", "semester": "Spring of every year", "credits": " 3", "description": "Historical transformations in modern urban social relations and their relationship to contemporary urban problems and governance.", "prerequisite": "Completion of Tier I Writing Requirement", "restrictions": "Not open to freshmen."}, "HST411": {"name": " European Jewish History", "semester": "Spring of every year", "credits": " 3", "description": "European Jewry since medieval era. Napoleonic emancipation, Jewish liberalism, assimilation, Zionism, anti-Semitism, and recent issues."}, "HST412": {"name": " Women in Modern European History", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Women in European society, economy, and politics since 1750, emphasizing the lives of ordinary women and the impact of industrial capitalism and the nation-state.", "restrictions": "Not open to freshmen."}, "HST413": {"name": " Families in Historical Perspective", "semester": "Fall of every year", "credits": " 3", "description": "Family forms and socio-economic change in Europe and the United States. Gender, childhood, courtship, sexual relations, marriage, divorce, childbearing, and old age in peasant, industrial, and postindustrial society. War, welfare state, and the family. The marginalized", "restrictions": "Not open to freshmen."}, "HST420": {"name": " History of Sexuality since the 18th Century", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Changing gender roles, sex in the Victorian era, prostitution, pornography, birth control, emergence of homo- and heterosexuality, sex under fascism, the sexual revolution, contemporary conflicts.", "restrictions": "Not open to freshmen."}, "HST421": {"name": " Women and Gender in Africa", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Gender-aware and women-centered approaches to the study of African history", "restrictions": "Not open to freshmen or sophomores."}, "HST425": {"name": " American and European Health Care since 1800", "semester": "Spring of every year", "credits": " 4", "description": "Social and cultural transformation in health care delivery since 1800, primarily in North America and western Europe. Therapeutic revolutions. Medical education and professionalization. Social and alternative medicine. Managed care.", "prerequisite": "Completion of Tier I writing requirement.", "restrictions": "Not open to freshmen."}, "HST450": {"name": " Special Topics in African History", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Experimental courses and courses taught by visiting faculty.", "restrictions": "Not open to freshmen."}, "HST451": {"name": " Special Topics in Asian History", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Experimental courses and courses taught by visiting faculty", "restrictions": "Not open to freshmen."}, "HST452": {"name": " Special Topics in European History", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Experimental courses and courses taught by visiting faculty", "restrictions": "Not open to freshmen."}, "HST453": {"name": " Special Topics in Latin American History", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Experimental courses and courses taught by visiting faculty", "restrictions": "Not open to freshmen."}, "HST454": {"name": " Special Topics in American History", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Experimental courses and courses taught by visiting faculty", "restrictions": "Not open to freshmen."}, "HST455": {"name": " Special Topics in Modern History", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Experimental courses and courses taught by visiting faculty", "restrictions": "Not open to freshmen."}, "HST456": {"name": " Special Topics in the History of Sexuality", "semester": "Spring of every year", "credits": " 3", "description": "Experimental courses and courses taught by visiting faculty.", "restrictions": "Not open to freshmen."}, "HST475": {"name": " History of the Book: From Manuscripts to Comics", "semester": "Fall of even years", "credits": " 3", "description": "History of the book from medieval manuscripts to modern forms. Publishing, illustration, censorship, manuscript and print culture.", "restrictions": "Not open to freshmen."}, "HST480": {"name": " Seminar in American History (W)", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Exploration of particular topics in cultural, intellectual, or political history, seventeenth century to the present.", "prerequisite": "(HST 201 or HST 201H) and completion of Tier I writing requirement"}, "HST481": {"name": " Seminar in Ancient History (W)", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "A specific problem or theme in the history of Greece and Rome.", "prerequisite": "(HST 201 or HST 201H) and completion of Tier I writing requirement"}, "HST482": {"name": " Seminar in Medieval History (W)", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "A specific problem or theme in medieval social, cultural, intellectual, legal, and political history, 500-1300.", "prerequisite": "(HST 201 or HST 201H) and completion of Tier I writing requirement"}, "HST483": {"name": " Seminar in Modern European History (W)", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "A specific problem or theme in European social, political, cultural, or economic history since 1300.", "prerequisite": "(HST 201 or HST 201H) and completion of Tier I writing requirement"}, "HST484": {"name": " Seminar in African History (W)", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Issues in African social, political, cultural, and environmental history.", "prerequisite": "(HST 201 or HST 201H) and completion of Tier I writing requirement"}, "HST485": {"name": " Seminar in Asian History (W)", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Intensive study of a specific problem or theme in the social, political, economic, or cultural history of Asia.", "prerequisite": "(HST 201 or HST 201H) and completion of Tier I writing requirement"}, "HST486": {"name": " Seminar in Latin American History (W)", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "A specific problem or theme in the social, cultural, economic, and political history of Latin America.", "prerequisite": "(HST 201 or HST 201H) and completion of Tier I writing requirement"}, "HST487": {"name": " Seminar in Comparative History (W)", "semester": "Fall of every year, Spring of even years", "credits": " 3", "description": "Analysis of themes or problems from different cultures and countries.", "prerequisite": "(HST 201 or HST 201H) and completion of Tier I writing requirement"}, "HST488": {"name": " Seminar in International Relations (W)", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "A specific problem or theme in the history of international relations.", "prerequisite": "(HST 201 or HST 201H) and completion of Tier I writing requirement"}, "HST489": {"name": " Seminar in Digital History (W)", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "A specific problem or theme in history approached through digital research to create digital work product.", "prerequisite": "Completion of Tier I Writing Requirement", "restrictions": "Not open to freshmen."}, "HST490": {"name": " Independent Study", "semester": "Fall of every year, Spring of every year", "credits": "Variable from 1 to 4", "description": "Special projects arranged by an individual student and a faculty member in areas supplementing regular course offerings.", "restrictions": "Approval of department."}, "HST493": {"name": " History Internship", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 4", "description": "Domestic and international history and history education placements with educational institutions, museums, libraries, archives, historic sites, digital history programs, public agencies, legal firms and departments, non-profit agencies, and private businesses.", "restrictions": "Open to juniors or seniors. Approval of department."}, "HST495": {"name": " History Harvest", "semester": "Fall of every year", "credits": " 3", "description": "Identification, collection, and digitization of oral histories and historical artifacts in the local community. Family heirlooms, lived experiences of everyday people, stories passed down through generations. Emphasis on digital history techniques.", "restrictions": "Not open to freshmen."}, "HST499H": {"name": " Senior Honors Thesis", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Individual research projects, supervised by a faculty member.", "restrictions": "Approval of department."}, "HST800": {"name": " Historiography of the United States to 1865", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Overview of American history through the Civil War. Writings of historians on issues in social, cultural, intellectual, and/or political history."}, "HST801": {"name": " Historiography of the United States Since 1865", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Americanist historiography since the Civil War. Historical writings about issues in social, cultural, intellectual, or political history."}, "HST803": {"name": " Seminar in Methodology of Historical Research", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Historical research techniques and methodologies."}, "HST805": {"name": " Readings in the Historical Roots of Epidemiological Thought", "semester": "Fall of every year", "credits": " 3", "description": "Historical evolution of models of disease causation and population perspectives on disease.", "prerequisite": "EPI 810 or approval of department", "restrictions": "Open to graduate students in the Department of Epidemiology and Biostatistics or approval of department."}, "HST807": {"name": " Readings in Early American and U.S. History", "semester": "Fall of every year", "credits": " 3", "description": "Exploration of historical literature on a particular time period, region, or topic in Early American and U.S. History."}, "HST808": {"name": " Research in Early American and U.S. History", "semester": "Spring of every year", "credits": " 3", "description": "Research process, methods, and sources on a particular time period, region, or topic in Early American and U.S. History."}, "HST810": {"name": " Anthrohistory: Exploring the Crossroads of Anthropology and History", "semester": "Fall of even years", "credits": " 3", "description": "Recent trends in work between anthropology and history. Emphasis on themes of representation, methodology and epistemology.", "restrictions": "Open to doctoral students or approval of department."}, "HST812": {"name": " History in the Digital Age", "semester": "Fall of every year", "credits": " 3", "description": "Historical data mining. New technologies for historical data analysis. Methods for digitizing historical materials. Web-based presentations of historical material."}, "HST814": {"name": " Historiography and Social Theory", "semester": "Spring of every year", "credits": " 3", "description": "Social theory and historical research. Topics will vary. Potential themes include"}, "HST816": {"name": " Historiography of Europe since 1870", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Readings organized around themes and genres of historical inquiry into late nineteenth and twentieth century European history."}, "HST822": {"name": " Seminar in Early Modern European History", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Political, social, and economic history of Europe from 1500-1800. Major interpretations and research methods. Topics vary."}, "HST823": {"name": " Seminar in Modern European History", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Political, social, and economic history of Europe after 1800. Major interpretations and research methods. Topics vary."}, "HST824": {"name": " Seminar in Russian History", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Political, social, and economic history of Russia. Major interpretations and research methods. Periods and topics vary."}, "HST829": {"name": " African Historiography", "semester": "Spring of even years", "credits": " 3", "description": "Survey of important works and topics in African history"}, "HST830": {"name": " Seminar in African History", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Political, social, and economic history of Africa. Major interpretations and research methods. Periods and topics vary."}, "HST831": {"name": " Seminar in Latin American History", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Political, social, and economic history of Latin America. Major interpretations and research methods. Periods and topics vary."}, "HST832": {"name": " Seminar in Japanese History", "semester": "Spring of every year", "credits": " 3", "description": "Political, social, and economic history of Japan. Major interpretations and research methods. Periods and topics vary."}, "HST833": {"name": " Seminar in Chinese History", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Political, social, and economic history of China. Major interpretations and research methods. Periods and topics vary."}, "HST850": {"name": " Seminar in Comparative History", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Comparative themes or problems from different cultures and countries. Major interpretations and research methods."}, "HST855": {"name": " Interdisciplinary Topics in Film Studies", "semester": "Spring of even years", "credits": " 3", "description": "Topics in film studies that engage other disciplines and fields through historical, cultural, and formal content."}, "HST860": {"name": " Seminar in Women's History", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Political, social, and economic history of women. Major interpretations and research findings. Topics vary."}, "HST870": {"name": " Seminar in African-American History", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Social, political, economic, and cultural topics emphasizing the intersection of race, class, and gender. Periods and topics vary."}, "HST875": {"name": " Seminar in International Labor and Working Class History", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "History of labor, capital, and the working class in international perspective."}, "HST880": {"name": " Seminar In Comparative Black History", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Methods and concepts that inform comparative history. The slave trade as a definitive link between Africa and the two Americas and the Caribbean, creating the black diaspora. Rise and fall of the slave trade and of disparate slave systems. Periods andtopics vary."}, "HST886": {"name": " Fundamentals of Museum Studies", "semester": "Fall of every year", "credits": " 3", "description": "Introduction to the history of museums and current practices, standards, issues and ethics related to education, administration, visitor studies and the development, care and use of museum collections.", "restrictions": "Open to lifelong graduate students in the College of Arts and Letters or in the Department of Anthropology or in the Department of History. Approval of department.", "alias": "AL 886", "exclude": "MUSM 485"}, "HST887": {"name": " Museums and Technology", "semester": "Summer of even years", "credits": " 3", "description": "Theoretical and practical approaches to the way museums, zoos, gardens and other cultural sites use digital media, the web, interactive media and databases to engage the public, create virtual exhibits and web presences, and manage collections. Ways technologies are changing the definition of visitors and visitor experiences and the definitions of museums.", "restrictions": "Open to graduate students or lifelong graduate students in the College of Arts and Letters.", "alias": "AL 887"}, "HST890": {"name": " Independent Study", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 3", "description": "Special projects, directed reading, and research arranged by an individual graduate student and a faculty member in areas supplementing regular course offerings.", "restrictions": "Approval of department."}, "HST897": {"name": " Practicum in Museum Studies", "semester": "On Demand, On Demand, On Demand", "credits": "Variable from 1 to 3", "description": "Practical experience in museum studies.", "alias": "AL 897"}, "HST898": {"name": " Master's Research", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 3", "description": "Directed research in support of Plan B master's degree requirements.", "restrictions": "Approval of department."}, "HST899": {"name": " Master's Thesis Research", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 6", "description": "Directed research in partial fulfillment of Plan A master's degree requirements.", "restrictions": "Open only to graduate students in the Department of History."}, "HST900": {"name": " Research and Pedagogy in Digital History", "semester": "Spring of every year", "credits": "Variable from 1 to 4", "description": "Practical and theoretical issues related to digital research, scholarship, and teaching. Identifying and using digital research tools. Creating/presenting digital scholarship. Online teaching methods. Digital methods in the classroom and for public history.", "prerequisite": "HST 812 or approval of department"}, "HST990": {"name": " Independent Study", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 4", "description": "Special projects, directed reading, and research arranged by an individual doctoral student and a faculty member in areas supplementing the regular course offerings.", "restrictions": "Open only to doctoral students. Approval of department."}, "HST999": {"name": " Doctoral Dissertation Research", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 24", "description": "Doctoral dissertation research.", "restrictions": "Open to doctoral students in the Department of History."}}}