{"code": "ISE", "name": "Integrated Science Education", "courses": {"ISE120": {"name": " Seminar in Integrated Science for Elementary Schools", "semester": "Spring of every year", "credits": " 1", "description": "Exploration of major connecting themes in life sciences, earth science, and physical science as evidenced in the K-8 science curriculum and college science courses.", "prerequisite": "(BS 161 or BS 162 or BS 181H or BS 182H or LB 144 or LB 145) or (CEM 141 or PHY 231 or PSL 250 or GLG 201 or GEO 203)", "restrictions": "Open to students in the College of Education or in the Education major or in the Special Education major or approval of college.", "alias": "SME 120"}, "ISE301": {"name": " Science for Elementary Schools", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Topics in earth science, life science, and physical science explored through discussion, demonstrations, readings, presentations, and field trips.", "restrictions": "Open to students in the elementary teacher certification program (admitted).", "alias": "NSC 301, SME 301"}, "ISE320": {"name": " Integrated Science for Elementary Schools", "semester": "Spring of every year", "credits": " 3", "description": "Analysis of the concepts integrating science across life sciences, earth sciences, and physical sciences. Applications to the K-8 science curriculum.", "prerequisite": "ISE 120 and (BS 161 or BS 162 or BS 181H or BS 182H or LB 144 or LB 145 or PSL 250 or ZOL 355) and (PHY 231 or PHY 231C or CEM 141 or LB 171) and (GLG 201 or GEO 203 or AST 207)", "restrictions": "Open to students in the Integrated Science Elementary Teaching Major.", "alias": "SME 320", "exclude": "ISE 301"}, "ISE401": {"name": " Science Laboratories for Secondary Schools (W)", "semester": "Fall of every year", "credits": " 4", "description": "Laboratory equipment, supplies, demonstrations, exercises, and safety. Care of live organisms. Disposal of biological and chemical wastes.", "prerequisite": "Completion of Tier I writing requirement.", "restrictions": "Open to seniors in the Chemistry major or in the Earth Science major or in the Biological Science major or in the Physical Science major.", "alias": "NSC 401, SME 401"}, "ISE420": {"name": " Integrated Science Research", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Research design and data analysis of individual research projects relevant to the K-12 science curriculum, integrating topics in life, earth, and physical science.", "restrictions": "Open to seniors in the General Science Secondary Teaching Major and open to seniors in the Integrated Science Elementary Teaching Major.", "alias": "SME 420"}, "ISE490": {"name": " Special Problems", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 4", "description": "Faculty directed individualized study of an interdisciplinary problem.", "restrictions": "Approval of department.", "alias": "SME 490"}, "ISE600": {"name": " Special Problems for K-8 Teachers", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 5", "description": "Supervised study of problems or issues in biological sciences, physical sciences, earth sciences or mathematical sciences.", "restrictions": "Approval of college.", "alias": "NSC 600, SME 600"}, "ISE820": {"name": " College Student Cognition in Science", "semester": "Spring of every year", "credits": " 3", "description": "Introduction to research methodologies and findings relevant to college student cognition in science disciplines. Material from education, psychology, cognitive sciences, and the science disciplines will be used to reveal college student cognitive processes as they relate to science fields.", "alias": "SME 820"}, "ISE870": {"name": " Teaching College Science", "semester": "Spring of every year", "credits": " 2", "description": "Philosophies of education. Ethnic, gender, and cultural issues. Designing a laboratory course. Problems of class size. Instructional technologies. Assessment and evaluation.", "restrictions": "Approval of college.", "alias": "NSC 870, SME 870"}, "ISE899": {"name": " Master's Thesis Research", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 8", "description": "Master's thesis research.", "restrictions": "Open to master's students in the College of Natural Science. Approval of college.", "alias": "NSC 899, SME 899"}}}