{"code": "ITM", "name": "Information Technology Management", "courses": {"ITM209": {"name": " Business Analytics and Information Systems", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": " 3", "description": "Use of business processes, information technologies, and analytics in creating value and enabling improvements in global business performance.", "prerequisite": "CSE 101", "restrictions": "Open to undergraduate students in the Business - Admitted major and open to undergraduate students in the Information Technology Minor.", "alias": "BUS 309, ITM 309"}, "ITM311": {"name": " Systems Analysis and Design", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Structured analysis and design of information systems. Understanding of the system development process, and organizational issues associated with the design and implementation of information systems.", "restrictions": "Open to juniors or seniors in the Eli Broad College of Business and The Eli Broad Graduate School of Management or in the Information Technology Minor."}, "ITM412": {"name": " Digital Marketing", "semester": "Spring of every year", "credits": " 3", "description": "Theoretical foundation of digital marketing. Recent tactics, applications, and trends in the online marketplace. Basics of online marketing communications, search engine marketing, social media marketing, and web analytics.", "prerequisite": "MKT 300 or MKT 327", "restrictions": "Open to juniors or seniors in the Eli Broad College of Business and The Eli Broad Graduate School of Management.", "alias": "MSC 412"}, "ITM444": {"name": " Information Technology Project Management", "semester": "Spring of every year", "credits": " 3", "description": "Practical training and experiences in design, testing, and launch of new information technologies and systems.", "prerequisite": "ITM 311", "restrictions": "Open to students in the Information Technology Minor."}, "ITM481": {"name": " Introduction to Business Analytics", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Exploration and predictive analysis of business problems. Analysis concepts and skills in business contexts.Strategic and operational impacts of a firm’s analytics efforts. Basic concepts of big data and specific methods of conceptualizing and analyzing business problems.", "prerequisite": "CSE 201 or CSE 231 or MKT 317", "restrictions": "Open to undergraduate students in the Eli Broad College of Business and The Eli Broad Graduate School of Management or in the Information Technology Minor or approval of department."}, "ITM490": {"name": " Independent Study in Information Technology", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 4", "description": "Directed study in information technology under faculty supervision.", "prerequisite": "ITM 209", "restrictions": "Open to students in the Eli Broad College of Business and The Eli Broad Graduate School of Management."}, "ITM491": {"name": " Special Topics in Information Technology", "semester": "Fall of every year, Spring of every year", "credits": "Variable from 1 to 4", "description": "Current topics in information technology.", "prerequisite": "ITM 209", "restrictions": "Open to students in the Eli Broad College of Business and The Eli Broad Graduate School of Management."}, "ITM818": {"name": " Data Management and Visualization in Analytics", "semester": "Fall of every year", "credits": "Variable from 1 to 3", "description": "Role of analytics in shaping competitive strategy and improving the design and implementation of business processes. Emphasis on enterprise data management and visualization skill development. Analysis of enterprise data identifying findings and making recommendations. Real-world cases of successes and failures with analytics-based business strategies.", "restrictions": "Open to graduate students in the Business Analytics Major or approval of department."}, "ITM821": {"name": " Enterprise Database Systems", "semester": "Fall of every year", "credits": " 3", "description": "Management of information in business organizations. Conceptual modeling of transaction process systems, workflow systems and enterprise-wide networks of value-added activities. Integration of decision support and policy level systems with economic event processing systems. Evolution of accounting systems.", "restrictions": "Open to master's students in the Accounting major or approval of department.", "exclude": "ACC 321"}, "ITM822": {"name": " Information Systems Project Management", "semester": "Fall of every year, Spring of every year", "credits": "Variable from 1 to 3", "description": "Management of information system projects. Modeling of business processes. Management of project scope, time and costs. Planning and control of projects. Program and portfolio management. Consulting issues for effective project management.", "restrictions": "Open to graduate students in the Accounting major and open to MBA students or approval of department."}, "ITM823": {"name": " Advanced Enterprise Database Systems", "semester": "Spring of every year", "credits": " 3", "description": "Architecture of enterprise information. Semantic and syntactic modeling of enterprise economic phenomena, relational database technology and database design for business systems, business process analysis patterns and implementation compromises.", "prerequisite": "ACC 321 or ACC 821 or ITM 821", "restrictions": "Open to graduate students in the Accounting major or approval of department."}, "ITM824": {"name": " Governance and Control of Enterprise Systems", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Governance and control of information technologies. Identification and valuation of key information and communication technologies, frameworks for assessing information system risk, information system auditing, and international standards for information technology governance and control.", "restrictions": "Open to graduate students in the Accounting major or in the Master of Business Administration in Business Administration or approval of department."}, "ITM825": {"name": " Object-Oriented Business Information Systems", "semester": "Fall of every year", "credits": " 3", "description": "Analysis and design of object-oriented business systems. Unified modeling language descriptions of business phenomena and rules, object-oriented programming, use-case analysis and specifications, and XML tag sets for transactions and reporting.", "prerequisite": "ACC 321 or ACC 821", "restrictions": "Open to graduate students in the Accounting major or approval of department."}, "ITM826": {"name": " Enterprise Information Systems", "semester": "Spring of every year", "credits": " 3", "description": "Enterprise resource planning (ERP) systems. ERP implementation issues and success factors. Use of enterprise systems, and exploring future directions in ERP systems.", "restrictions": "Open to graduate students in the Accounting major or in the Master of Business Administration in Business Administration or approval of department."}, "ITM881": {"name": " Network Analytics", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 3", "description": "Application of network analysis in business contexts. Basic methods and terminology associated with network analysis and text analytics leading to broad-based applications. Applications of these techniques span a broad range of business contexts including human resource management, customer relationship management systems, supplier networks, and online networks.", "prerequisite": "MKT 829 or MBA 820", "restrictions": "Open to master's students in the Business Analytics Major or approval of department."}, "ITM882": {"name": " Analytics Practicum", "semester": "Summer of every year", "credits": " 3", "description": "Supervised analytics practicum. The design, analysis, execution, and presentation of an analytics project.", "restrictions": "Approval of department."}, "ITM883": {"name": " Business Analytics Problem Solving", "semester": "Spring of every year", "credits": "Variable from 1 to 3", "description": "Statistical techniques, use of statistical software platform, exposure to statistical programming languages.", "restrictions": "Open to graduate students in the Business Analytics Major or approval of department."}, "ITM885": {"name": " Machine Learning and Optimization in Analytics", "semester": "Fall of every year", "credits": "Variable from 1 to 3", "description": "Applying different machine learning and optimization techniques to solve organizational problems.", "restrictions": "Open to graduate students in the Business Analytics Major or approval of department."}, "ITM886": {"name": " Communication Strategies for Analytics", "semester": "Spring of every year", "credits": "Variable from 1 to 3", "description": "Professional communication skills, from basic business writing techniques to cutting-edge digital and social-media strategies.", "restrictions": "Open to graduate students in the Business Analytics Major or approval of department."}, "ITM888": {"name": " Capstone: Business Analytics", "semester": "Fall of every year", "credits": "Variable from 1 to 3", "description": "Practicum in the development and delivery of predictive data analysis for strategic decision making in organizations. Application of the principles and tools of analytics to real-world problems in research and development, marketing, supply chain, accounting, finance and human resources management. Development and presentation of analytical insights and recommendations.", "restrictions": "Approval of department."}, "ITM890": {"name": " Independent Study", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 3", "description": "Faculty-supervised independent study.", "restrictions": "Open to graduate students in the Eli Broad College of Business and The Eli Broad Graduate School of Management. Approval of department."}, "ITM891": {"name": " Special Topics in Information Technology Management", "semester": "Fall of every year", "credits": "Variable from 1 to 3", "description": "Selected topics in current and emerging issues related to information technology management.", "restrictions": "Approval of department."}, "ITM893": {"name": " Business Analytics Internship", "semester": "Summer of every year", "credits": "Variable from 1 to 3", "description": "Professional internship in a public, industrial, or governmental organization where one or more business analytics projects are performed under faculty supervision.", "restrictions": "Open to master's students in the Business Analytics Major or approval of department."}, "ITM911": {"name": " Doctoral Seminar in Information Systems", "semester": "Fall of every year", "credits": " 3", "description": "Seminar in management information systems for new doctoral students and researchers new to the field."}, "ITM912": {"name": " Information Technology Transactional Perspectives", "semester": "Spring of even years", "credits": " 3", "description": "Multiple perspectives on relationships between organizations and information technology. Information processing, communications and management strategy approaches. Economic perspectives.", "restrictions": "Open to doctoral students."}, "ITM913": {"name": " Seminar in Information Systems Design Science", "semester": "Spring of odd years", "credits": " 3", "description": "Research in design science in information systems. Ontological issues in design science research."}, "ITM914": {"name": " Behavioral Aspects of Information Systems", "semester": "Fall of every year", "credits": " 3", "description": "Information systems theory from a behavioral and social science perspective.", "restrictions": "Open to graduate students in the Eli Broad College of Business and The Eli Broad Graduate School of Management or approval of college."}, "ITM915": {"name": " Seminar in Information Systems and Networks", "semester": "Spring of odd years", "credits": " 3", "description": "Research in social networks in information systems.", "restrictions": "Open to doctoral students in the Eli Broad College of Business and The Eli Broad Graduate School of Management."}, "ITM917": {"name": " Research Methods in Information Systems", "semester": "Fall of every year", "credits": " 3", "description": "Research methodologies utilized to study information systems phenomena from social science, computational science, and clinical approaches. Critique information systems literature from various methodological perspectives.", "restrictions": "Open to graduate students in the Eli Broad College of Business and The Eli Broad Graduate School of Management or in the College of Communication Arts and Sciences or approval of college."}}}