{"code": "JRN", "name": "Journalism", "courses": {"JRN108": {"name": " The World of Media", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": " 3", "description": "Introduction to the wide array of the journalism and media industries. Examination of established to emerging media and their content and audiences, content dissemination, policy and management decision-making, theory, history, development and current structure of the media. Role and impact of media on society and vice-versa, careers, law and ethics, media literacy and diversity."}, "JRN200": {"name": " Writing and Reporting News", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": " 3", "description": "Basic reporting and writing skills. Storytelling with news judgment, information gathering, readability and ethics. News styles and structure in alternative delivery methods. Independent sources and interviewing techniques in a lab setting. Writing news across platforms. AP style.", "prerequisite": "Completion of Tier I Writing Requirement", "restrictions": "Approval of school."}, "JRN203": {"name": " Visual Storytelling", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": " 3", "description": "Explorations of visual storytelling techniques and technologies, including photography, audio, video, information graphics, alternative story forms and social media.", "restrictions": "Open to undergraduate students in the College of Communication Arts and Sciences."}, "JRN206": {"name": " Video Storytelling with Phones", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": " 3", "description": "Fundamentals of video storytelling using phone cameras. Basics of shooting and editing video. Video aesthetics. Natural sound. Audio and microphones. Interviewing. Journalism news gathering and ethics."}, "JRN211": {"name": " Documentary History and Theory", "semester": "Fall of every year", "credits": " 3", "description": "Documentary history and theory form its origins to the present.", "restrictions": "Open to students in the School of Journalism or in the Department of Media and Information or in the Department of Writing, Rhetoric and American Cultures or in the Documentary Studies Specialization or in the Film Studies major."}, "JRN212": {"name": " 2D Animation Storytelling", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Theory and production practice of creating 2D animation in cultural storytelling and education."}, "JRN213": {"name": " Animation, Comics, Culture and Graphic Novels in Media", "semester": "Summer of every year", "credits": " 3", "description": "Study of the development and relevance of comics and graphic novels from around the world to cultural and historical issues and events. Creation of digital and interactive comics to market work for transmedia publication. Special emphasis is put on creating short comics around news issues and events, educational and instructional comics, interactive, animated and experimental comic styles."}, "JRN218": {"name": " Sports in Contemporary Media", "semester": "Fall of every year", "credits": " 3", "description": "Introduction to today’s media coverage of sports, including college and professional major and Olympic sports. Survey of development of traditional and new media reporting. Legal, and ethical issues, including contracts and copyrights of sports media.", "prerequisite": "Completion of Tier I Writing Requirement"}, "JRN265": {"name": " International Journalism and Media", "semester": "Fall of every year", "credits": " 3", "description": "Survey of journalism processes and media systems around the world. Contemporary issues in international journalism. Press theory and effects on press freedom and media independence. Foreign correspondence reporting."}, "JRN300": {"name": " Multimedia Writing and Reporting (W)", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": " 3", "description": "Powerful writing combined with visual communication and social media for multimedia reporting. Developing story ideas and interview techniques for covering public affairs and communities. Stories are published online.", "prerequisite": "(JRN 200 and (JRN 203 or concurrently)) and completion of Tier I writing requirement"}, "JRN303": {"name": " On-Air Announcing, Interviewing and Hosting", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": " 3", "description": "Hands-on experience to be comfortable in front of a camera and microphone in a live setting doing interviews or presenting information. Effective host and anchor techniques across various digital platforms for all different styles of programming, including news, sports and entertainment."}, "JRN305": {"name": " Editing for Print and Digital", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": " 3", "description": "Editing for accuracy, brevity and maximum impact to improve one's own writing and that of others for today's media and publication.", "prerequisite": "JRN 200", "alias": "JRN 405"}, "JRN306": {"name": " Introduction to Radio, Podcasting and TV News", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": " 3", "description": "Fundamentals of audio storytelling. Introduction to broadcast style writing; scripting for radio news and podcasting; voice tone and cadence. Exposure to professional cameras for video stories.", "prerequisite": "(JRN 300 or concurrently) and JRN 206 or approval of department"}, "JRN310": {"name": " Photojournalism", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Photography storytelling by learning the principles and ethics of successful visual communication, camera operation and software editing.", "prerequisite": "JRN 203 or JRN 483 or approval of school", "restrictions": "Open to students in the School of Journalism."}, "JRN311": {"name": " Introduction to Documentary Production", "semester": "Spring of every year", "credits": " 3", "description": "Introduction to documentary production using accessible and affordable digital technology.", "prerequisite": "MI 211", "restrictions": "Open to students in the Documentary Production Minor.", "alias": "TC 233"}, "JRN312": {"name": " Stop Motion Animation Storytelling", "semester": "Summer of every year", "credits": " 3", "description": "Creation of digital stop motion animation sequences to tell a narrative story or recreate a historical or current world event. History of stop motion animation, character rigging and kinetics, storyboarding, plot and sequence development."}, "JRN313": {"name": " Political Cartoons", "semester": "Summer of every year", "credits": " 3", "description": "Survey and critique of political cartoons from around the world from ancient Egypt through today. Impact the cartoons can have on society as well as the techniques to research, create, and market political cartoons."}, "JRN317": {"name": " Sports Journalism", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Introduction to the specialized field of sports journalism. Reporting on high school, college, Olympic, and professional major sports. Interaction with sports journalists from various media; writing and producing sports stories in multi-media formats. Ethical decision-making.", "prerequisite": "JRN 200", "alias": "JRN 417"}, "JRN325": {"name": " Journalism History", "semester": "Fall of every year", "credits": " 3", "description": "Development of journalism in the United States from colonial to the present; examination of evolving written, aural, visual and multimedia forms and relevant media technology. Journalism's history has impacted and influenced U.S. history in interesting ways.", "alias": "JRN 425"}, "JRN336": {"name": " Designing for Media", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Creating and composing visual communication design for digital and print publications. Theory and practice in typography, visual editing, alternative story forms, hierarchy and use of color.", "prerequisite": "JRN 203 or approval of school"}, "JRN338": {"name": " Information Graphics", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Information graphics, or infographics, are graphic visual representations of information used to make information clearer and more understandable, accessible and engaging. Theory, application and production of print, animated and interactive information graphics using visual tools, like maps, charts, diagrams and illustrations.", "prerequisite": "JRN 203 or approval of school"}, "JRN345": {"name": " Images and Messages", "semester": "Spring of every year", "credits": " 3", "description": "Visual communication through analytical, historical and critical views. Role and effects of imagery in storytelling, news and documentary presentations. Ethics of visual messages. Impact of technology on visual journalism. Aesthetics of imagery and cultural belief systems associated with the medium of photography.", "alias": "JRN 445"}, "JRN365": {"name": " International News and Government Dynamics", "semester": "Spring of every year, Summer of every year", "credits": " 3", "description": "Explores the importance of journalism in the process of building governments in different countries. Compares features of global media and coverage in international contexts. Regions rotate each year", "alias": "JRN 335"}, "JRN372": {"name": " Environment, Science and Health Journalism Special Topics", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Analyze and understand the context of environment, science and health events and issues for news coverage."}, "JRN375": {"name": " International Journalism and Media", "semester": "Fall of every year", "credits": " 3", "description": "Survey of media and journalism news systems around the world. Contemporary issues in international journalism. Press theory and effects on press freedom and media independence. Foreign correspondence reporting.", "alias": "JRN 335"}, "JRN402": {"name": " Public Relations Topics in Journalism", "semester": "Fall of every year, Spring of every year", "credits": " 1", "description": "Current and rotating topics related to the practice of public relations.", "restrictions": "Open to students in the Journalism Major or in the Public Relations Minor. A student may earn a maximum of 6 credits in any or all enrollments in ADV 402, COM 402, JRN 402."}, "JRN403": {"name": " TV News", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Creating video news stories for TV and digital platforms. Entry-level producing and anchoring for regular short newscasts. Introduction to broadcast style writing for video. Multi-media reporting for TV news broadcasts.", "prerequisite": "JRN 306 or approval of department", "restrictions": "Open to students in the School of Journalism."}, "JRN406": {"name": " Advanced TV News Storytelling and Producing", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Announcing, reporting, and producing newscasts for TV and digital platforms, honing skills in video, audio, broadcast writing, TV news storytelling, interviewing and reporting. Advanced producing techniques, social media strategies for journalism and create a professional portfolio for future employers.", "prerequisite": "JRN 403 or approval of department"}, "JRN407": {"name": " Advanced Reporting", "semester": "Fall of every year", "credits": " 3", "description": "Developing indepth news stories, using traditional and innovative investigative reporting skills and techniques. Finding and analyzing databases. Following up with interviews and sources. Visualizing data. Employing the Freedom of Information Act to obtain public/government records.", "prerequisite": "JRN 300"}, "JRN409": {"name": " Advising Student Publications", "semester": "Spring of every year, Summer of every year", "credits": "Variable from 3 to 12", "description": "Themes and issues to oversee successful student publications such as staff organization and policies, finance, law, photography, design and role of the student press.", "prerequisite": "Completion of Tier I Writing requirement", "restrictions": "Open to juniors or seniors or graduate students and approval of school."}, "JRN410": {"name": " Advanced Photojournalism: Documentary", "semester": "Spring of every year", "credits": " 3", "description": "Advanced photographic storytelling and editing for media. Social documentary/long-form photography and layout. Technical and aesthetic skills. Studio and strobe lighting. Build a portfolio.", "prerequisite": "JRN 310 or approval of school"}, "JRN411": {"name": " Collaborative Documentary Design and Production (W)", "semester": "Spring of every year", "credits": " 3", "description": "Design and development of documentaries in a team setting using video and audio, still photography, web design, and print media. Participation in a production cycle including idea generation, research, design, production, and distribution.", "prerequisite": "Completion of Tier I Writing Requirement", "restrictions": "Open to students in the Documentary Production Minor.", "alias": "TC 411"}, "JRN413": {"name": " 3D Animation Storytelling", "semester": "Summer of every year", "credits": " 3", "description": "Character development in regard to culture and story. Advanced relationship of physics between character and the environment through micro facial expressions, body language of walk and gesture."}, "JRN416": {"name": " Sports Multimedia Content Management", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": " 3", "description": "Packaging, editing, and making ethical decisions in sports newsrooms. Making strong content choices, from SEO to visual to broadcast to print. Editing, content choice, and coverage on ethical/diversity levels.", "prerequisite": "JRN 300 and JRN 317"}, "JRN417": {"name": " Sports Reporting", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Introduction to specialized field of sports journalism; reporting on high school, college and professional major sports and Olympic sports. Interaction with sports journalists from various media; writing and producing sports stories in multi-media formats.", "prerequisite": "JRN 200 and JRN 218"}, "JRN418": {"name": " Advanced Sports Reporting", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Upper-level exploration of issues in sports journalism and directed professional work experiences at outlets such as WKAR's Current Sports (radio/TV/web) and FOX Sports.", "prerequisite": "JRN 416"}, "JRN420": {"name": " Capital News Service", "semester": "Fall of every year, Spring of every year", "credits": "Variable from 1 to 6", "description": "Supervised professional experience in covering Michigan politics and state government as correspondents for selected media. Student work and bylines appear in professional print and online media, preparing them for the industry."}, "JRN430": {"name": " News Media Law and Ethics", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": " 3", "description": "Legal and ethical nature of news gathering and dissemination. Moral issues in gathering and reporting news. First amendment principles of press freedom. Libel, invasion of privacy, prior restraint, access to information. Objectivity, sensitivity, covering victims, source relations."}, "JRN432": {"name": " Magazine, Feature and Freelance Writing", "semester": "Spring of every year", "credits": " 3", "description": "Storytelling for long-form narratives for magazines and other media outlets. Delve into the human interest angle when developing stories to educate and/or entertain. Learn how to pitch stories to get published.", "prerequisite": "JRN 300"}, "JRN436": {"name": " Design for Web and Mobile Devices", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Theory and practice in designing online publications. Content gathering including text, digital images and multimedia elements. Emphasis on information, interaction and presentation design. Includes coding such as HTML and CSS.", "prerequisite": "JRN 336"}, "JRN438": {"name": " Advanced Information Graphics", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Creating visual storytelling with advanced techniques and technologies for communicating information online and across media. Using graphics, animation and other methods to represent data simply to various audiences.", "prerequisite": "JRN 338 or approval of school"}, "JRN450": {"name": " Media Innovation and Entrepreneurship", "semester": "Spring of every year", "credits": " 3", "description": "Developing and marketing innovations in journalism media that have the potential for commercial enterprise. Building blocks of entrepreneurship to know how to test markets, prototype, and develop audiences.", "prerequisite": "JRN 200 and JRN 300", "restrictions": "Open to students in the College of Communication Arts and Sciences."}, "JRN465": {"name": " International Reporting", "semester": "Spring of every year", "credits": " 3", "description": "Writing and reporting significant and innovative stories on international and global affairs. Understanding varying degrees of press freedom in different cultures, and reporting with a sensitivity to diversity and cultural contexts.", "prerequisite": "JRN 265 and JRN 300 or approval of school"}, "JRN472": {"name": " Environmental, Science and Health Reporting", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": " 3", "description": "Investigative reporting on environment, science and health. Text, video, audio stories published on GreatLakesEcho.org and other venues. Analyzing environment, science and health events and issues for news coverage."}, "JRN475": {"name": " International News and Government Dynamics", "semester": "Spring of every year", "credits": " 3", "description": "Comparative features of global media and coverage within regional contexts that rotate each year", "restrictions": "Not open to freshmen."}, "JRN483": {"name": " Photo Communication in Europe", "semester": "Summer of every year", "credits": " 6", "description": "Study abroad. Introduction to contemporary photographers including those working in documentary, photojournalism, advertising and art. Visits to historical collections of photography, museums, galleries, and studios. Structured travel to historical and cultural sites. Practical experience in digital photography including shooting, editing, storytelling and packaging.", "restrictions": "Approval of school."}, "JRN484": {"name": " Sports Journalism Education Abroad", "semester": "Summer of even years", "credits": " 6", "description": "Examine European sporting cultures (ancient and modern) in Paris and Rome. Study how sports journalism operates in both cities through experiential learning by attending tours, guest lectures, experiencing live sporting events and seeing sports journalism in action.", "prerequisite": "JRN 200 or approval of school"}, "JRN485": {"name": " Environmental Communication Education Abroad", "semester": "Summer of every year", "credits": " 6", "description": "Local environmental problems and the ways in which they are connected to political, economic, social, and ecosystemic dynamics at a global scale. Explore the ways in which diverse stakeholders involved in environmental decision-making use communication strategies to achieve their goals and objectives.", "restrictions": "Approval of school."}, "JRN486": {"name": " British and Irish Mass Media Education Abroad", "semester": "Summer of every year", "credits": " 3", "description": "Examine the rapidly changing world of media and communication in London, Scotland, Ireland, and Wales. Themes studied are traditional and digital media, marketing and advertising, journalism, broadcasting and public relations.", "restrictions": "Approval of school."}, "JRN487": {"name": " Creative Journey Education Abroad", "semester": "Summer of every year", "credits": " 6", "description": "Visual communication for the transfer of ideas, knowledge and data. Visual tools including videos, infographics, color, typography, and photography.", "restrictions": "Approval of school."}, "JRN490": {"name": " Independent Study", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 4", "description": "Supervised individual study in an area of journalism.", "restrictions": "Approval of school."}, "JRN492": {"name": " Journalism Special Topics", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 6", "description": "Various issues, skills or themes relating to journalism."}, "JRN493": {"name": " Journalism Professional Field Experience", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 6", "description": "Supervised field experience at a professional media organization. Media related issues.", "prerequisite": "JRN 200", "restrictions": "Open to students in the Journalism Major. Approval of school; application required."}, "JRN800": {"name": " Multiple Media Reporting I", "semester": "Fall of every year", "credits": " 3", "description": "Development and practice of professional news judgment, writing, ethics, and skills across media platforms, such as print, online, audio, and video storytelling.", "restrictions": "Open to graduate students."}, "JRN801": {"name": " Multiple Media Reporting II", "semester": "Spring of every year", "credits": " 3", "description": "Investigative and in-depth project reporting across media platforms. Use of databases, documents, financial data, survey data and geographic information systems.", "prerequisite": "JRN 800", "restrictions": "Open to graduate students."}, "JRN803": {"name": " Introduction to Quantitative Research Methods", "semester": "Fall of every year, Summer of every year", "credits": " 3", "description": "Introduction to quantitative social science research methods and applied analyses for understanding research reports and developing graduate level research projects.", "alias": "ADV 875, COM 800, JRN 817, TC 802"}, "JRN810": {"name": " Visual Journalism", "semester": "Fall of every year", "credits": " 3", "description": "Historical, theoretical, conceptual, ethical and technological approaches to the creation, processing and dissemination of visual information in journalism, documentary film, public relations and advertising. Explores both U.S. and international case studies.", "restrictions": "Open to graduate students."}, "JRN815": {"name": " Media, Society and Theory", "semester": "Fall of every year", "credits": " 3", "description": "Roles, impacts, organization, and performance of the news media in society.", "restrictions": "Open to graduate students."}, "JRN816": {"name": " Applied Research Methods in Journalism", "semester": "Spring of every year", "credits": " 3", "description": "Exposure to qualitative and quantitative methods of research for journalism. Methods include surveys, content analysis, focus groups, participant observation, historical, visual and document research.", "restrictions": "Open to graduate students."}, "JRN820": {"name": " Capital News Service", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Supervised professional experience in covering politics and state government as correspondents for selected media. Student work appears in professional print and online media.", "prerequisite": "JRN 800 or approval of school", "restrictions": "Open to master's students in the College of Communication Arts and Sciences or in the School of Journalism or in the Journalism Major or approval of school."}, "JRN821": {"name": " Social Media News and Information", "semester": "Spring of every year", "credits": " 3", "description": "New technologies relevant to journalism. Assessing impact on the field. Use of these technologies in their work.", "restrictions": "Open to graduate students."}, "JRN872": {"name": " Environment, Science and Health Reporting Topics", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Resources and practical experience in reporting and writing about environment, science and health topics.", "prerequisite": "JRN 800", "restrictions": "Open to graduate students."}, "JRN873": {"name": " Environment, Science and Health Journalism Seminar", "semester": "Spring of every year", "credits": " 3", "description": "Issues in environmental, science and health journalism."}, "JRN875": {"name": " Global Affairs Reporting", "semester": "Fall of every year", "credits": " 3", "description": "Techniques and challenges in covering international events and issues such as economics, security, disasters, and public policy. Understanding international press systems, rights and constraints.", "prerequisite": "JRN 800", "restrictions": "Open to graduate students."}, "JRN887": {"name": " Journalism Study Abroad Topics", "semester": "Summer of every year", "credits": " 6", "description": "Topics vary. Blend of lectures, visits to media organizations, and fieldwork.", "restrictions": "Open to graduate students. Approval of school."}, "JRN890": {"name": " Independent Study", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 3", "description": "Individualized study under faculty direction.", "restrictions": "Open only to graduate students in the School of Journalism. Approval of school."}, "JRN892": {"name": " Journalism Special Topics", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 3", "description": "Topics vary."}, "JRN896": {"name": " Journalism Professional Project", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 6", "description": "Individualized research, writing and production of in-depth journalism projects.", "restrictions": "Open to master's students in the Journalism major. Approval of school."}, "JRN899": {"name": " Master's Thesis Research", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 6", "description": "Master's thesis research.", "restrictions": "Open to master's students in the Journalism major. Approval of school."}, "JRN900": {"name": " Theory Building in Media and Information Studies", "semester": "Fall of every year", "credits": " 3", "description": "Concepts and issues relating explanation, scientific inquiry, theory building and applications to interdisciplinary studies in media and information."}, "JRN916": {"name": " Qualitative Research Methods", "semester": "Spring of every year", "credits": " 3", "description": "Qualitative research in mass and specialized communication systems. Topics include documentary, bibliographic, case study and participant observation methods.", "restrictions": "Open to doctoral students in the College of Communication Arts and Sciences."}, "JRN921": {"name": " Theories of Media and Information", "semester": "Fall of every year", "credits": " 3", "description": "Overview of the relations between information theory, communication theory, and media theory, and an understanding of how these theories have evolved over time and which competing approaches coexist.", "restrictions": "Open to doctoral students in the College of Communication Arts and Sciences or approval of college.", "alias": "ADV 921"}, "JRN960": {"name": " Media and Technology", "semester": "Spring of every year", "credits": " 3", "description": "Theoretical frameworks concerning media and communication processes, and their interactions with technology. Social, organizational, critical, and economic perspectives.", "restrictions": "Open to doctoral students in the Communication Major or in the Media and Information Studies Major or approval of department.", "alias": "TC 960"}, "JRN975": {"name": " Introductory Methods", "semester": "Fall of every year", "credits": " 3", "description": "A survey of qualitative and quantitative research design including validity and reliability, hypothesis formation, sampling, ethics, survey, experimental, ethnographic, observational and mixed methods.", "restrictions": "Open to doctoral students."}, "JRN985": {"name": " Advanced Quantitative Analysis for Media", "semester": "Spring of every year", "credits": " 3", "description": "Multivariate research methods for media and information studies research.", "prerequisite": "ADV 975"}, "JRN990": {"name": " Independent Study", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 3", "description": "Independent research under faculty direction.", "restrictions": "Open to doctoral students in the College of Communication Arts and Sciences or approval of college."}, "JRN991": {"name": " Ways of Knowing", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Ways humans acquire, convey, organize and shape knowledge and information, and are shaped and influenced by it. Neurological, psychological linguistic, philosophical, cultural, and logical dimensions of human knowledge.", "restrictions": "Open to doctoral students in the College of Communication Arts and Sciences or approval of college."}, "JRN992": {"name": " Doctoral Seminar", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Topics on theoretical and research issues in communication and mass media.", "restrictions": "Open to doctoral students in the College of Communication Arts and Sciences or approval of college."}, "JRN993": {"name": " Research Practicum in Information and Media", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 3", "description": "Directed research collaboration with a faculty member or a team of students/faculty.", "restrictions": "Open to doctoral students in the College of Communication Arts and Sciences or approval of college."}}}