{"code": "LLT", "name": "Language, Learning and Teaching", "courses": {"LLT306": {"name": " Methods of Teaching Adult and Community English to Speakers of Other Languages", "semester": "Fall of every year", "credits": " 3", "description": "Methods for teaching English as second language to adult learners in a variety of domestic and international contexts. Focus on communicative and task-based methods involving both oral and written skills. Objective writing, lesson planning and execution."}, "LLT307": {"name": " Methods of Second and Foreign Language Teaching", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "National and international approaches, methods, materials, settings, needs, and characteristics of ESL and foreign language students. Survey, evaluation, and application of major effective methods and materials.", "prerequisite": "Completion of Tier I Writing Requirement", "alias": "ENG 307"}, "LLT346": {"name": " Pedagogical English Grammar for English Teachers", "semester": "Fall of every year", "credits": " 3", "description": "Teaching grammar to English-as-second language (ESL) students. Grammar lesson plan development. English grammar, error identification, common English-as-second language errors, evaluation of grammar textbooks, and the role of error correction in English-as-second language teaching.", "prerequisite": "LIN 200 or LIN 401 or ENG 302"}, "LLT361": {"name": " Second and Foreign Language Learning", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Basic principles of learning a second or foreign language. Issues in first language acquisition. Theories of second language learning. Aptitude, motivation, attitude, learning grammar, age, learning in a classroom, myths, and facts about second language learning.", "prerequisite": "LIN 200 or LIN 401 or ENG 302"}, "LLT490": {"name": " Independent Study", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 4", "description": "Special projects arranged by an individual student and a faculty member in areas supplementing regular course offerings.", "restrictions": "Approval of department."}, "LLT496": {"name": " Practicum in Adult English as a Second Language Teaching", "semester": "Spring of every year", "credits": " 3", "description": "Practical experience in adult ESL teaching. Classroom observations, tutoring, teaching demonstrations, lesson planning, and materials development.", "prerequisite": "LLT 346 and LLT 306 and (LLT 361 or concurrently)", "restrictions": "Open to undergraduate students."}, "LLT807": {"name": " Language Teaching Methods", "semester": "Spring of every year", "credits": " 3", "description": "Approaches, methods, and materials for teaching foreign and second languages , including the teaching of listening, speaking, reading, and writing. Selection and evaluation of materials, lesson planning, and management of activities and materials.", "restrictions": "Open only to graduate students in College of Arts and Letters.", "alias": "ENG 807"}, "LLT808": {"name": " Assessment for Language Teaching and Research", "semester": "Spring of every year", "credits": " 3", "description": "Classroom diagnostic and achievement assessment. Reliability and validity of language tests. Alternative assessment methods. Standardized and performance-based testing. Program-level assessment. Measuring language proficiency for research.", "restrictions": "Open to graduate students in the Second Language Studies major or in the Teaching English to Speakers of Other Languages major or approval of department.", "alias": "ENG 808"}, "LLT809": {"name": " Teaching Second Language Reading and Writing", "semester": "Fall of every year", "credits": " 3", "description": "Teaching reading and writing in foreign and second language contexts. Vocabulary and pre-reading activities; materials development; integrating, assessing and researching reading and writing; reading and writing to learn language, academic reading and writing.", "restrictions": "Open to graduate students in the Teaching English to Speakers of Other Languages major or approval of department."}, "LLT813": {"name": " CALL: Technology-mediated Language Learning and Teaching", "semester": "Spring of odd years", "credits": " 3", "description": "Overview of pedagogical, empirical, methodological, and theoretical issues regarding language learning and teaching in technology-mediated contexts. Discussion, simulations and case studies, the creation of a teaching portfolio, and the participation in action research.", "restrictions": "Open to graduate students in the Second Language Studies Major or in the Teaching English to Speakers of Other Languages Major or approval of department."}, "LLT818": {"name": " Eye Tracking in Second Language Acquisition and Bilingualism", "semester": "Fall of odd years", "credits": " 3", "description": "Use eye-movement recordings (eye-tracking) in second language acquisition research and bilingualism. Conduct an eye-tracking study from start to finish. Foundational texts on eye-movement research and selected empirical studies.", "restrictions": "Open to graduate students in the Second Language Studies Major or in the Teaching English to Speakers of Other Languages Major or in the Cognitive Science Specialization or approval of department."}, "LLT822": {"name": " Interlanguage Analysis", "semester": "Fall of every year", "credits": " 3", "description": "Phonetics, phonology, morphology, syntax within the context of second language acquisition and teaching. Approaches to analysis of second language learner data.", "restrictions": "Open to graduate students in the Teaching English to Speakers of Other Languages major or approval of department."}, "LLT823": {"name": " Introduction to Corpus Linguistics for Second Language Studies", "semester": "Fall of even years", "credits": " 3", "description": "Overview of corpus linguistics in applied contexts such as second language acquisition and use as well as second/foreign language teaching. Key concepts and methods in corpus linguistics and preparation for basic corpus-based research.", "restrictions": "Open to graduate students in the Second Language Studies Major or in the Teaching English to Speakers of Other Languages Major or approval of department."}, "LLT841": {"name": " Topics in Second/Foreign Language Learning and Teaching", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Selected topics and issues in second/foreign language learning and teaching.", "restrictions": "Open to graduate students in the Second Language Studies Major or in the Teaching English to Speakers of Other Languages Major."}, "LLT842": {"name": " Teaching and Learning Vocabulary in Another Language", "semester": "Spring of even years", "credits": " 3", "description": "Overview of second language vocabulary acquisition research and its implications for second language teaching. Dimensions of vocabulary knowledge. Vocabulary and the four communicative skills. Incidental versus intentional vocabulary learning. Vocabulary learning strategies.", "restrictions": "Open to graduate students in the Second Language Studies Major or in the Teaching English to Speakers of Other Languages Major or approval of department."}, "LLT846": {"name": " English Structures and Functions", "semester": "Spring of every year", "credits": " 3", "description": "Phonological, morphological, grammatical, lexical, discourse and pragmatic systems of English, including historical origins and social, regional, and gender variations. Application to the teaching of English to speakers of other languages.", "restrictions": "Only open to master's students in the Teaching English to Speakers of Other Languages major.", "alias": "ENG 846"}, "LLT856": {"name": " Language Identity and Ideology in Multilingual Settings", "semester": "Spring of every year", "credits": " 3", "description": "Current debates on the relationship between language, identity, and ideology. Theories of identity and ideology related to a variety of educational settings. Negotiation of identity and ideology with respect to social relationships between writer and reader, teacher and student, classroom and community.", "restrictions": "Open to graduate students in the College of Education or in the Department of Linguistics and Germanic, Slavic, Asian and African Languages or in the Second Language Studies Major or in the Teaching English to Speakers of Other Languages Major or in the Sociology Disciplinary Teaching Minor."}, "LLT860": {"name": " Second Language Acquisition", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Factors in second language learning such as age, motivation, language input and interaction, social influences, the role of the native language, and language universals.", "restrictions": "Open to graduate students in the Second Language Studies major or in the Teaching English to Speakers of Other Languages major or approval of department.", "alias": "LLT 461, ENG 461"}, "LLT861": {"name": " Advanced Topics in Second Language Acquisition", "semester": "Fall of every year", "credits": " 3", "description": "Advanced course in second language acquisition. Topics vary based on current topics in the field and faculty interests.", "prerequisite": "LLT 860 or LLT 872", "restrictions": "Open to graduate students in the Second Language Studies major or approval of department."}, "LLT862": {"name": " Advanced Research in Second Language Acquisition", "semester": "Spring of every year", "credits": " 3", "description": "Continuation of LLT 861. Professional development seminar in second language acquisition. Research project. Collecting and analyzing data. Preparing projects for conference presentation and publication. Topics vary.", "prerequisite": "LLT 861", "restrictions": "Approval of department."}, "LLT863": {"name": " Second Language Acquisition of Morphosyntax", "semester": "Fall of every year", "credits": " 3", "description": "Theoretical issues related to second language acquisition. Acquisition of morphosyntax.", "prerequisite": "LIN 434 and LLT 860 or approval of department", "restrictions": "Open to graduate students in the Second Language Studies major or approval of department."}, "LLT864": {"name": " Second Language Psycholinguistics", "semester": "Spring of every year", "credits": " 3", "description": "Second and foreign language learning from a psycholinguistic perspective. Discussion of major research findings and theories of second and foreign language perception, comprehension, and production.", "prerequisite": "LLT 860", "restrictions": "Approval of department."}, "LLT872": {"name": " Research Methods for Language Teaching and Foreign/Second Language Learning", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Concepts and procedures for designing and conducting research in second/foreign language learning and teaching.", "prerequisite": "LLT 860 or approval of department", "restrictions": "Open to graduate students in the Second Language Studies major or in the Teaching English to Speakers of Other Languages major."}, "LLT873": {"name": " Quantitative Research in Second Language Studies", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Statistical principles and techniques with particular application to investigating second language learning and teaching.", "prerequisite": "LLT 872", "restrictions": "Open to graduate students in the Second Language Studies major or in the Teaching English to Speakers of Other Languages major or approval of department."}, "LLT874": {"name": " Qualitative Research in Second Language Studies", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Theories, principles, and techniques underlying qualitative research. Applications to investigating second language learning and teaching.", "prerequisite": "LLT 872", "restrictions": "Open to doctoral students in the Second Language Studies major or in the Teaching English to Speakers of Other Languages major or approval of department."}, "LLT890": {"name": " Independent Study", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 6", "description": "Special projects, directed reading, and research arranged by an individual graduate student and a faculty member in areas supplementing regular course offerings."}, "LLT895": {"name": " English as a Second Language: Classroom Practices", "semester": "Fall of every year", "credits": " 3", "description": "Lesson planning, materials development, adapting authentic materials, and microteaching. Classroom management for the teaching of English as a second language."}, "LLT896": {"name": " Practicum in Teaching English as a Second Language", "semester": "Spring of every year", "credits": " 3", "description": "Syllabus and lesson plan development for a six-week English as a Second Language course. Team teach in a community setting."}, "LLT898": {"name": " Master's Research", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 6", "description": "Directed research in support of Plan B master's degree requirements."}, "LLT899": {"name": " Master's Thesis Research", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 6", "description": "Directed research leading to a master's thesis, used in partial fulfillment of Plan A master's degree requirements."}, "LLT992B": {"name": " Seminar in English as a Second Language", "semester": "Fall of every year", "credits": " 3", "description": "Contemporary theories and issues relating to learning English as a second language.", "restrictions": "Open only to doctoral students in the College of Arts and Letters or approval of department.", "alias": "ENG 992B"}, "LLT999": {"name": " Doctoral Dissertation Research", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 36", "description": "Doctoral dissertation research.", "restrictions": "Approval of department."}}}