{"code": "MBA", "name": "Master of Business Administration", "courses": {"MBA802": {"name": " Financial Accounting and Reporting Strategy", "semester": "Fall of every year, Summer of every year", "credits": "Variable from 1 to 3", "description": "Financial accounting model underlying financial statements of firms. Information in financial statements and role of these statements in capital markets. Information intermediaries, regulators, and role of independent auditor. Standard setting and the impact of changing standards. Globalization of standards.", "restrictions": "Open to MBA students or approval of department."}, "MBA804": {"name": " Applied Data Analysis for Managers", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 3", "description": "Analysis of business and economic data to support managerial decision-making. Building, interpreting, and applying time-series, regression, and forecasting models.", "restrictions": "Open to MBA students or approval of department.", "exclude": "SCM 833"}, "MBA806": {"name": " Social Issues in Management", "semester": "Spring of every year", "credits": "Variable from 1 to 3", "description": "Analysis of the business environment including social, ethical, public policy, ecological, and international dimensions. Management of stakeholder relationships.", "restrictions": "Open to MBA students."}, "MBA808": {"name": " Leadership and Teamwork", "semester": "Fall of every year", "credits": "Variable from 1 to 3", "description": "Understanding team management and leadership through experiential and skill-based learning. Effective communication, including the use of electronic communication technologies for team development and maintenance. Active practice of teamwork, communication, and leadership skills.", "restrictions": "Open to MBA students."}, "MBA812": {"name": " Accounting for Decision-Making and Control", "semester": "Spring of every year", "credits": "Variable from 1 to 3", "description": "The use of accounting information for planning and control. Cost structure and the use of cost analysis, activity-based costing, capacity costing, and cost modeling for improved decision-making. Controlling decisions through budgeting, variance analysis, transfer pricing, financial and non-financial performance measurement, and incentives. Use of the balanced scorecard for assessing strategy implementation.", "restrictions": "Open to MBA students."}, "MBA814": {"name": " Applied Economics", "semester": "Spring of every year, Summer of every year", "credits": "Variable from 1 to 3", "description": "Economic view of the firm. Use marginal analysis to analyze firms' decisions such as pricing, entry, and price discrimination. Use game theory to analyze firms' strategic behavior, priniciple-agent relationships, adverse selection, and signaling.", "restrictions": "Open to MBA students or approval of department."}, "MBA816": {"name": " Managerial Communication Strategy and Tactics", "semester": "Fall of every year", "credits": "Variable from 1 to 3", "description": "Learning, applying and adapting the basic principles of persuasion and argumentation to oral and written communication in business settings.", "restrictions": "Open to MBA students."}, "MBA817": {"name": " Designing and Delivering Impactful Business Presentations", "semester": "Spring of every year", "credits": "Variable from 1 to 3", "description": "Determining relevant presentation content based on audience analysis. Strategic design of content. Oral presentation delivery using PowerPoint as a visual aid. Introduction to effective question and answer methods in business environment.", "prerequisite": "MBA 816", "restrictions": "Open to MBA students."}, "MBA818": {"name": " Creating Competitive Advantage through Presentations", "semester": "Spring of every year", "credits": "Variable from 1 to 3", "description": "Complex business presentations to top business executives and corporate boards. Managing presentation flow and successful completion when facing interruptions and challenges to proposals and findings in real-time presentation settings.", "prerequisite": "MBA 816 and MBA 817", "restrictions": "Open to MBA students."}, "MBA820": {"name": " Marketing Management", "semester": "Fall of every year", "credits": "Variable from 1 to 3", "description": "Leadership principles in marketing strategy development. Fundamental marketing concepts such as strategic marketing analysis, market segmentation, targeting, and competitive positioning. Problem-solving and market planning. Application of concepts to case analysis.", "restrictions": "Open to MBA students."}, "MBA821": {"name": " Introduction to Supply Chain Management Concepts", "semester": "Fall of every year", "credits": "Variable from 1 to 3", "description": "Integrative approach to understanding supply chain management. Flow of products from concept development through delivery to the final user, including product and process development, managing information, inventory and product flows, and supplier and customer management.", "restrictions": "Open to MBA students."}, "MBA822": {"name": " Corporate Investment Decisions", "semester": "Fall of every year", "credits": "Variable from 1 to 3", "description": "Corporate investment decisions including calculation of present value, valuation of bonds and common stock, net present value and other investment criteria, portfolio theory and financial asset pricing models, risk and cost of capital.", "restrictions": "Open to MBA students."}, "MBA823": {"name": " Information Technology Strategy", "semester": "Spring of every year, Summer of every year", "credits": "Variable from 1 to 3", "description": "Integrative perspectives on the use, management, and economic value of information technologies in organizations. Financial and strategic assessment of the business value of information technologies. Transformational effects of business intelligence and social networking technologies. Technology strategy and entrepreneurship.", "restrictions": "Open to MBA students or approval of department."}, "MBA824": {"name": " Managing the Workforce", "semester": "Spring of every year", "credits": "Variable from 1 to 3", "description": "Role of workforce management in fulfilling the goals and mission of the organization. Theories and applications of management principles to motivating, rewarding, and structuring employees' work; managing groups and teams; and structuring the organization. Domestic and international issues in the workplace.", "restrictions": "Open to MBA students.", "exclude": "MGT 824"}, "MBA830": {"name": " Marketing Strategy Execution", "semester": "Fall of every year", "credits": "Variable from 1 to 3", "description": "Executing marketing strategy. Using the marketing decision variables to plan and execute in a competitive marketplace. Fundamental marketing topics such as customer satisfaction, customer loyalty and lifetime value, growth strategies, brand value propositions, new product strategies, brand equity development, marketing communication, pricing, channel relationships, internet marketing, and global marketing. Application of course concepts to case analysis.", "prerequisite": "MBA 820", "restrictions": "Open to MBA students."}, "MBA831": {"name": " Supply Chain Management Applications", "semester": "Fall of every year", "credits": "Variable from 1 to 3", "description": "Application of supply chain management concepts. Examining how procurement, logistics and operations management enable value propositions and gain competitive advantage.", "prerequisite": "MBA 821", "restrictions": "Open to MBA students."}, "MBA832": {"name": " Corporate Financing Decisions", "semester": "Fall of every year", "credits": "Variable from 1 to 3", "description": "Corporate financing decisions including efficient markets and behavioral finance, how corporations issue securities, capital structure, shareholder payout policy and agency cost issues.", "prerequisite": "MBA 822", "restrictions": "Open to MBA students."}, "MBA841": {"name": " Studies in the Global Marketplace", "semester": "Summer of every year", "credits": "Variable from 1 to 3", "description": "Commercial, economic, cultural, and political aspects of global environments. Exposure to leading executives and government representatives in world markets. Comparative framework for competitive strategy in a multi-country context. Participation in international field trip required.", "restrictions": "Open to MBA students."}, "MBA843": {"name": " Career Management", "semester": "Fall of every year", "credits": "Variable from 1 to 3", "description": "Understanding career development theory through experiential and skill-based learning. Active practice of career management, networking, negotiation, goal setting, and development planning skills.", "restrictions": "Open to MBA students."}, "MBA845": {"name": " Integrative Action Projects", "semester": "Fall of every year, Spring of every year", "credits": "Variable from 1 to 2", "description": "Multi-day intensive action-based learning experience in which students apply business theories and concepts to real business issues.", "restrictions": "Open to MBA students."}, "MBA846": {"name": " Executive Lecture Series", "semester": "Fall of every year", "credits": " 1", "description": "CEO perspectives on interdisciplinary business topics. Real-world events and scenarios, global business community, and innovative strategies to manage high-performance organizations.", "restrictions": "Open to MBA students in the The Eli Broad College of Business and open to undergraduate students in the Honors College."}, "MBA850": {"name": " Strategic Management", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 3", "description": "Examines ways top managers create and sustain competitive advantage in today's challenging global marketplace from a total firm perspective.", "restrictions": "Open to MBA students.", "exclude": "MGT 850"}, "MBA891": {"name": " Special Topics in Business Management", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 3", "description": "Current and emerging issues in management. New and changing developments affecting managers.", "restrictions": "Open to MBA students."}, "MBA893": {"name": " MBA Internship Experience", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 2", "description": "Internship in business organizations; application of business knowledge and management techniques in a work environment.", "restrictions": "Open to MBA students and not open to students in the Master of Business Administration in Integrative Management."}}}