{"code": "MC", "name": "James Madison College", "courses": {"MC100": {"name": " Freshmen Success Seminar", "semester": "Fall of every year", "credits": " 1", "description": "Exploration of academic, social, personal and career decisions that students face in college, with a primary focus on the first year and the James Madison College experience.", "restrictions": "Open to freshmen in the James Madison College or in the James Madison-No Major."}, "MC111": {"name": " Identity and Community: An Approach to Writing I", "semester": "Fall of every year", "credits": " 4", "description": "Identity and community in American and cross-cultural contexts. Influences of family, education, work, religion, gender, race, class and/or sexuality on identity and community. Critical reading and analytical writing and public speaking.", "restrictions": "Open to undergraduate students in the James Madison College or approval of college."}, "MC112": {"name": " Identity and Community: An Approach to Writing II", "semester": "Spring of every year", "credits": " 4", "description": "Identity and community in American and cross-cultural contexts in selected historical eras. Reconstructing images of self and society in time of stress or transition. History, narrative, literature, film, art, politics. Principles of research, documentation, persuasive writing, and public speaking.", "prerequisite": "MC 111", "restrictions": "Open to students in the James Madison College."}, "MC181": {"name": " Introduction to Science, Technology, the Environment and Public Policy", "semester": "Fall of every year", "credits": " 3", "description": "Relation of science and technology to ethics and public policy. Environmental law and public policy. Managing fish, water and wildlife resources at state, national, and international levels. Science and technology in developing countries. Impacts of military technology on environmental policy."}, "MC201": {"name": " Introduction to the Study of Public Affairs I", "semester": "Fall of every year", "credits": " 4", "description": "Interdisciplinary exploration of enduring issues and conflicts in American and international public affairs. Historical, social science, and comparative approaches.", "restrictions": "Open to undergraduate students in the James Madison College. Approval of college."}, "MC202": {"name": " Introduction to the Study of Public Affairs II", "semester": "Spring of every year", "credits": " 4", "description": "Continued interdisciplinary exploration of enduring issues and conflicts in American and international public affairs. Historical, social science, and comparative approaches.", "prerequisite": "(MC 201)"}, "MC220": {"name": " International Relations I: World Politics and International Security", "semester": "Fall of every year", "credits": " 4", "description": "Evolution of the contemporary international system. Theories, explanations, and comparisons of actions and interactions of state and non-state actors. Causes of war and peace.", "restrictions": "Open to sophomores or juniors or seniors in the James Madison College."}, "MC221": {"name": " International Relations II: The Politics of International Economic Relations", "semester": "Spring of every year", "credits": " 4", "description": "Theories and policy issues in international political economy. Analysis of trade, money and finance, technology, transnational corporations, debt and environment. Globalization, hegemonic power, international regimes.", "prerequisite": "MC 220"}, "MC230": {"name": " Cultures and Politics in Comparative Perspective", "semester": "Fall of every year", "credits": " 4", "description": "Interdisciplinary and comparative approaches to analysis of culture and politics. Whole culture, structuralist, post structuralist, and interpretive theories of culture. Analysis of the relationship of political regimes, cultural diversity, identity, and representation, and case studies."}, "MC231": {"name": " Cultures and Politics in Transnational Perspective", "semester": "Spring of every year", "credits": " 4", "description": "Interdisciplinary study of cross-cultural interactions and transnational politics in the context of globalization. Competing approaches to inter-cultural interaction. Case studies of cultural conflict, assimilation, and hybridization. Legacies of imperialism and colonialism. Narratives and representations of transnational interactions."}, "MC270": {"name": " Classical Republicanism", "semester": "Fall of every year", "credits": " 4", "description": "Theory and practice of popular government in classical Greece and Rome. Rebirth of such forms in the cities and monarchies of Medieval and Renaissance Europe.", "restrictions": "Open to sophomores or juniors or seniors in the James Madison College."}, "MC271": {"name": " Constitutionalism and Democracy", "semester": "Spring of every year", "credits": " 4", "description": "Origins and development of liberal constitutionalism and its democratization. Theory and practice of the modern state, especially the American variant.", "prerequisite": "MC 270"}, "MC272": {"name": " Political Theory and Political Issues", "semester": "Spring of every year, Summer of every year", "credits": " 4", "description": "Selected issues in political theory or specific political problems. Topics vary.", "restrictions": "Not open to freshmen."}, "MC280": {"name": " Social Theory and Social Relations", "semester": "Fall of every year", "credits": " 4", "description": "Classical and contemporary theories of social structure, intergroup process, inequality, and social change. Class, ethnicity, race, gender, social stratification, social mobility and conflict.", "restrictions": "Open to sophomores or juniors or seniors in the James Madison College or approval of college."}, "MC281": {"name": " Immigrants, Minorities, and American Pluralism", "semester": "Spring of every year", "credits": " 4", "description": "Comparative social history of American peoples, focused on immigrants and ethnic and racial minorities. Comparisons of patterns of adjustment, intergroup relations, and politics.", "restrictions": "Open to sophomores or juniors or seniors in the James Madison College or approval of college."}, "MC290": {"name": " Special Topics", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": " 4", "description": "Selected topics in public affairs including issues in international relations, political theory and constitutional democracy, social relations and policy, and comparative cultures and politics.", "restrictions": "Open to sophomores or juniors or seniors in the James Madison College or approval of college."}, "MC293": {"name": " Methods for Strategic Analysis in Public Affairs", "semester": "Fall of even years", "credits": " 4", "description": "Basic methods of strategic analysis and game theory. Applications and case studies in international relations, politics, political economy, and social relations.", "prerequisite": "(MTH 110 or MTH 116 or MTH 112 or MTH 114 or MTH 124 or MTH 132 or STT 200) or designated score on Mathematics Placement test"}, "MC295": {"name": " Research Design and Quantitative Analysis in Public Policy", "semester": "Fall of every year, Spring of every year", "credits": " 4", "description": "Design and execution of research in public policy analysis and evaluation. Critical evaluation of data and arguments. Data collection, hypothesis testing, survey of measures of association and evaluation.", "exclude": "PLS 201 or SOC 281"}, "MC299": {"name": " Independent Study", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 4", "description": "Individual reading and research under faculty direction.", "restrictions": "Open to undergraduate students. Approval of college."}, "MC300": {"name": " Collaborative Study", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 2", "description": "Group reading, research or simulations under faculty direction.", "restrictions": "Approval of college."}, "MC318": {"name": " Chinese Foreign Policy", "semester": "Fall of odd years", "credits": " 4", "description": "Theory, process and patterns of Chinese foreign policy. Underlying forces that shape Chinese foreign policy. Assumptions and bureaucratic processes of China's foreign policymaking.", "prerequisite": "(MC 220) and completion of Tier I writing requirement", "restrictions": "Open to students in the James Madison College."}, "MC319": {"name": " Asian American History", "semester": "Spring of every year", "credits": " 4", "description": "Survey of Asian American history from mid-nineteenth century to present. Analysis of shared and different experiences of the Chinese, Japanese, Korean, Filipino, Vietnamese, Hmong, and East Indian peoples who have come to the United States.", "restrictions": "Not open to freshmen or sophomores."}, "MC320": {"name": " Politics, Society and Economy in the Third World", "semester": "Fall of every year", "credits": " 4", "description": "Politics of social and economic change. Policies and strategies of development and of state and nation building in Third World countries. Impact of international political, security, and economic structures on the process of state and nation building in the Third World.", "prerequisite": "(MC 221 or MC 231 or MC 281) and Completion of Tier I Writing Requirement"}, "MC321": {"name": " The Cold War: Culture, Politics and Foreign Policy", "semester": "Spring of odd years", "credits": " 4", "description": "Cultural representations to explore the Cold War's balance of power politics and domestic consequences.", "prerequisite": "(MC 220 or MC 231) and completion of Tier I writing requirement"}, "MC322": {"name": " International Security", "semester": "Spring of odd years", "credits": " 4", "description": "Analysis of selected classic and/or contemporary theories and issues in international security, which could include humanitarian intervention, human security, weapons of mass destruction, ethnic and religious conflict, environmental security, terrorism and changing ways of warfare.", "prerequisite": "MC 220"}, "MC324A": {"name": " Regional Politics, Cooperation, and Conflict in the Middle East", "semester": "Spring of every year, Summer of every year", "credits": " 4", "description": "Sources of conflict and cooperation in the Middle East through case studies such as the Arab-Israeli conflict. Intrastate, regional, and global factors.", "prerequisite": "(MC 220 or PLS 160) or completion of Tier I writing requirement"}, "MC324C": {"name": " Regional Politics, Cooperation, and Conflict in Latin America and the Caribbean", "semester": "Fall of even years", "credits": " 4", "description": "Domestic and international politics of Latin American or Caribbean countries. Conflict and cooperation among states of the region. Government policies to promote security, democracy, and growth.", "prerequisite": "(MC 220 or PLS 160) or completion of Tier I writing requirement"}, "MC324D": {"name": " Regional Politics, Cooperation, and Conflict in Asia", "semester": "Fall of odd years", "credits": " 4", "description": "Sources and consequences of conflict and cooperation in Asia. Conflict and cooperation among states of the region. Government policies to promote security, democracy, and growth.", "prerequisite": "(MC 220 or PLS 160) or completion of Tier I writing requirement"}, "MC324E": {"name": " Regional Politics, Cooperation, and Conflict in Europe", "semester": "Summer of every year", "credits": " 4", "description": "Sources and consequences of conflict and cooperation in Europe. Government policies to promote security, democracy, and growth.", "prerequisite": "(MC 220 or PLS 160) or completion of Tier I writing requirement"}, "MC325": {"name": " State and Society in Comparative Perspective", "semester": "Spring of every year", "credits": " 4", "description": "Comparison of political systems and social-economic structures in capitalist and state-socialist societies. Political history, institutions, culture, and current policy issues.", "prerequisite": "(MC 221 or MC 271 or MC 230 or MC 281) and Completion of Tier I Writing Requirement"}, "MC326": {"name": " U.S. Foreign Policy", "semester": "Fall of every year, Spring of every year", "credits": " 4", "description": "U.S. foreign policy decision-making structures and processes. Domestic and international determinants of foreign policy. Evolution of U.S. foreign policy.", "prerequisite": "(MC 221) and completion of Tier I writing requirement", "alias": "MC 323A"}, "MC328": {"name": " Russian Foreign Policy", "semester": "Spring of even years", "credits": " 4", "description": "Evolution of Russian and Soviet foreign policy. Foreign policy decision-making structures and processes and domestic and international determinants of foreign policy.", "prerequisite": "Completion of Tier I Writing Requirement", "alias": "MC 323B"}, "MC329": {"name": " European Security: Challenges and Strategies", "semester": "Summer of every year", "credits": " 4", "description": "Evolution of challenges facing Europe in post-cold war period. Critical examination of alternative policies and structures proposed in response to these challenges.", "prerequisite": "(MC 221) and completion of Tier I writing requirement"}, "MC331": {"name": " Encounters With Post-Communism", "semester": "Spring of odd years", "credits": " 4", "description": "Interdisciplinary approach to the study of the cultural politics of post-communism and of international relations with countries of Eastern Europe and the former Soviet Union.", "prerequisite": "((MC 230 or MC 231 or MC 220)or approval of college) and completion of Tier I writing requirement", "restrictions": "Open to undergraduate students in the James Madison College."}, "MC332": {"name": " Literature and Politics in a Comparative Perspective", "semester": "Fall of every year, Spring of every year", "credits": " 4", "description": "Comparative examination of literary representations of politics and political themes involving different national literatures, literary genres and/or other narrative forms.", "prerequisite": "Completion of Tier I Writing Requirement", "restrictions": "Open to undergraduate students in the James Madison College."}, "MC333": {"name": " Performance, Politics, and Nation", "semester": "Spring of every year", "credits": " 4", "description": "Analysis of theories of and approaches to political performances and constructions of cultural nationalism, which includes social construction theory, the sociology of performance, ethnography, ethnomusicology and folklore, and critical approaches to nationalism, from classic studies to issues in gender, race, and post-colonialism.", "prerequisite": "MC 230 or MC 231 or MC 280 or MC 281 or approval of college", "restrictions": "Open to undergraduate students in the James Madison College or approval of college."}, "MC334": {"name": " Rights, Advocacy, and Activism", "semester": "Fall of odd years", "credits": " 4", "description": "Global perspectives on human rights, non-governmental organization (NGO) advocacy, and grassroots activism as mechanisms of change. Case studies on racial and cultural discrimination, gender-based violence, sexuality and rights, environment and climate justice, refugees and immigration, and other topics.", "prerequisite": "MC 230 or MC 231 or MC 280 or MC 281 or approval of college", "restrictions": "Open to undergraduate students in the James Madison College."}, "MC335": {"name": " Israeli Politics, Cultures and Society", "semester": "Spring of even years", "credits": " 4", "description": "Analysis of Israeli politics and society. Relationship between society and", "prerequisite": "Completion of Tier I Writing Requirement", "restrictions": "Not open to freshmen."}, "MC337": {"name": " Global Public Health", "semester": "Fall of every year", "credits": " 4", "description": "Comprehensive, interdisciplinary and policy-orientated approach to global public health. Examination of infectious disease, as well as case studies.", "prerequisite": "Completion of Tier I Writing Requirement"}, "MC341": {"name": " Politics and Markets", "semester": "Spring of every year", "credits": " 4", "description": "Comparative study of economic organization via firms, markets, and governments. Political economy approaches to evaluation of the firm, market, and government organization. Normative principles for evaluating firm, market, and government organization.", "prerequisite": "EC 201 or EC 251H", "alias": "MC 241"}, "MC348": {"name": " Educational Policy", "semester": "Spring of every year", "credits": " 4", "description": "Examination of alternative policies to improve K-12 educational outcomes, including school finance, educational standards, teacher professional development, and school choice.", "prerequisite": "(EC 201 or EC 251H) or completion of Tier I writing requirement"}, "MC349": {"name": " Economics of Legal Relationships in Comparative Perspective", "semester": "Fall of every year", "credits": " 4", "description": "Survey and comparison of major schools of legal-economic thought, and their implications for policy. Economic impacts of law and legal institutions.", "prerequisite": "(EC 201 or EC 251H) or completion of Tier I writing requirement"}, "MC350": {"name": " Evolution and Society", "semester": "Spring of even years", "credits": " 4", "description": "The reciprocal relationship between evolutionary science and American culture. Social, political, and economic influences that shape biological scientists' descriptions of evolutionary change and their claims about evolutionary influence on cultures.", "prerequisite": "Completion of Tier I Writing Requirement"}, "MC351": {"name": " Science and Social Policy", "semester": "Fall of even years", "credits": " 4", "description": "Role that scientific research on group differences plays in creating and maintaining social stereotypes and policy. Practical implications of scientific research, sources of bias among scientific investigators, and the role of scientists in creating and changing stereotypes and in attacking social prejudice.", "prerequisite": "Completion of Tier I Writing Requirement"}, "MC358": {"name": " Politics of the U.S.S.R. and Its Successor States", "semester": "Spring of every year", "credits": " 3", "description": "Political history, communist ideology, state institutions, and political processes in the Soviet Union and its successor states."}, "MC361": {"name": " Political Economy and Comparative Public Policymaking", "semester": "Spring of odd years", "credits": " 4", "description": "Use of political economy approaches to explain public policies and policymaking processes in comparative perspective.", "prerequisite": "(MC 221 or MC 231) and completion of Tier I writing requirement"}, "MC362": {"name": " Public International Law", "semester": "Spring of even years", "credits": " 4", "description": "Impact of international law on social, political and economic change in the international system. Military conflict and conflict resolution, economic prosperity and redistribution, human rights and ecology. Origin and operation of international laws.", "prerequisite": "(MC 221) and completion of Tier I writing requirement"}, "MC363": {"name": " Global Governance", "semester": "Spring of odd years", "credits": " 4", "description": "Impact of international institutions on social, political, and economic change in the international system. Evolution and devolution of global governance in international trade and finance, the environment, and military security.", "prerequisite": "(MC 221) and completion of Tier I writing requirement", "exclude": "PLS 364"}, "MC364": {"name": " Policy Evaluation", "semester": "Spring of every year", "credits": " 4", "description": "Economic concepts and analytic techniques for the design and evaluation of public policies. Political environment of policy formation and implementation. Basic data analysis. Application of concepts and techniques to selected government policies.", "prerequisite": "((EC 201 or concurrently) or (EC 251H or concurrently)) and ((EC 202 or concurrently) or (EC 252H or concurrently)) and ((SOC 281 or concurrently) or (MC 295 or concurrently) or (PLS 201 or concurrently)) and Completion of Tier I Writing Requirement", "alias": "MC 444", "exclude": "PLS 313"}, "MC366": {"name": " Film, History and Nation", "semester": "Spring of every year", "credits": " 4", "description": "Relation of film and cinema to nationalism, nation building, and national identity construction. Relation of film to history and historical representation. Role of domestic and international feature films in the formation of local, national, and global identities.", "prerequisite": "(MC 221 or MC 230 or MC 231 or approval of college) and Completion of Tier I Writing Requirement", "restrictions": "Open to juniors or seniors."}, "MC367": {"name": " Global Cities and Urbanism", "semester": "Spring of even years", "credits": " 4", "description": "An interdisciplinary approach to the dynamic global system of cities and the local ways of urban life embedded in global structures. Cities as crucibles of power, production, and development at the neighborhood, city and regional levels.", "prerequisite": "(MC 280 and MC 281) or (MC 230 and MC 231)", "restrictions": "Not open to freshmen."}, "MC368": {"name": " The Civil Rights Movement and its Legacies", "semester": "Fall of even years", "credits": " 4", "description": "History of the U.S. civil rights movement. Race, class and gender dimensions. National and local perspectives. Aims, strategies, and achievements. Relevance to contemporary social movements.", "prerequisite": "Completion of Tier I Writing Requirement", "restrictions": "Open to students in the James Madison College."}, "MC369": {"name": " Global Issues in Citizenship (W)", "semester": "Fall of odd years", "credits": " 4", "description": "History and political theory of citizenship, including citizenship laws and policies; classical, liberal and republican perspectives; gender and race; national, postnational, and transnational citizenship.", "prerequisite": "Completion of Tier I Writing Requirement", "restrictions": "Open to undergraduate students in the James Madison College or approval of college."}, "MC370": {"name": " Radical Challenges to Liberal Democracy", "semester": "Fall of every year", "credits": " 4", "description": "Criticisms of constitutionalism and liberal democracy. Theory and practice of 19th and early 20th century attempts to perfect or transcend bourgeois life through radical reform or revolution.", "prerequisite": "(MC 271) or completion of Tier I writing requirement"}, "MC371": {"name": " Beyond Liberal Democracy? New Directions in Political Theory", "semester": "Spring of every year", "credits": " 4", "description": "The contemporary status of liberal democracy. Theory and practice of late 20th century attempts to perfect, transcend, or undermine liberal democracy in light of crisis of rationalism.", "prerequisite": "(MC 370) and completion of Tier I writing requirement"}, "MC372": {"name": " Comparative Black Political Thought", "semester": "Spring of every year", "credits": " 4", "description": "Comparative examination of the political thought of blacks in the United States, Africa, and elsewhere in the African Diaspora", "prerequisite": "Completion of Tier I Writing Requirement", "restrictions": "Not open to freshmen."}, "MC373A": {"name": " Constitutionalism: The Supreme Court", "semester": "Fall of every year", "credits": " 4", "description": "Theory of constitutional democracy through examination of selected Supreme Court cases. History of the Supreme Court and principles of constitutionalism.", "prerequisite": "Completion of Tier I Writing Requirement", "restrictions": "Open to juniors or seniors in the James Madison College or approval of college.", "alias": "MC 373, MC 374"}, "MC373B": {"name": " Constitutionalism: The Presidency", "semester": "Spring of odd years", "credits": " 4", "description": "The Presidency in American constitutional democracy. Origins and development of the executive, constitutional issues, presidential practice.", "prerequisite": "Completion of Tier I Writing Requirement", "restrictions": "Open to juniors or seniors in the James Madison College or approval of college.", "alias": "MC 373, MC 374"}, "MC373c": {"name": " Constitutionalism: Congress", "semester": "Spring of odd years", "credits": " 4", "description": "Congress in American constitutional democracy. Origins and development of the legislative branch, constitutional issues, and legislative practice in Congress.", "prerequisite": "Completion of Tier I Writing Requirement", "restrictions": "Open to juniors or seniors in the James Madison College or approval of college.", "alias": "MC 373, MC 374"}, "MC375": {"name": " Contemporary Developments in American Politics", "semester": "Spring of every year", "credits": " 4", "description": "Contemporary developments related to persistent issues of American governance. Normative, empirical, and historical inquiry into topics such as the role of popular opinion, policy capacities and democratic and deliberative practice. Examination of case studies. Selected policy problems.", "prerequisite": "Completion of Tier I Writing Requirement", "restrictions": "Open to juniors or seniors in the James Madison College or approval of college."}, "MC376": {"name": " Modern Political Thought in the Muslim World", "semester": "Fall of every year", "credits": " 4", "description": "Major intellectual transformations in the Muslim world from 19th century to the present. Important internal and external influences.", "restrictions": "Open to undergraduate students in the James Madison College or approval of college."}, "MC377": {"name": " Culture, Politics and Post-Colonialism", "semester": "Spring of every year", "credits": " 4", "description": "International politics and power. Relations of colonialism and post-colonialism. Contemporary repercussions. History, literature, culture, and political theory.", "prerequisite": "(MC 221 or MC 271 or MC 231 or MC 281) and Completion of Tier I Writing Requirement"}, "MC378": {"name": " Law and Social Groups", "semester": "Spring of odd years", "credits": " 4", "description": "Relationship between fundamental law and the activity of social groups in the American context. Selected Supreme Court, Appellate and State Supreme Court cases examined for their impact on the free exercise and equal protection of social groups.", "prerequisite": "Completion of Tier I Writing Requirement", "restrictions": "Open to juniors or seniors in the James Madison College or approval of college."}, "MC380": {"name": " Social Policy", "semester": "Fall of every year", "credits": " 4", "description": "Application of social theory and methods to analysis of contemporary U.S. social policy. Competing explanations, current debates. Civil rights, education, employment, family, immigration, poverty, social welfare.", "prerequisite": "((MC 280 or MC 281) or completion of Tier I writing requirement) and ((EC 201 or concurrently) or (EC 251H or concurrently)) and ((EC 202 or concurrently) or (EC 252H or concurrently))"}, "MC381": {"name": " American Politics and Equality", "semester": "Spring of every year", "credits": " 4", "description": "Controversies over equality in American thought, politics, constitutional practice, and public policy. Case studies.", "prerequisite": "Completion of Tier I writing requirement.", "restrictions": "Open to juniors or seniors in the James Madison College or approval of college."}, "MC382": {"name": " Social Movements", "semester": "Fall of even years", "credits": " 4", "description": "Theories and case studies of social movements in comparative perspective. Origins, development, membership, organizational dynamics, social control, political effects.", "prerequisite": "Completion of Tier I Writing Requirement", "restrictions": "Open to juniors or seniors in the James Madison College or approval of college."}, "MC383": {"name": " African American Politics", "semester": "Fall of every year", "credits": " 4", "description": "Contemporary African American politics. National and local politics, alternative political strategies and public policies. Advancement of African-American community.", "prerequisite": "Completion of Tier I Writing Requirement", "restrictions": "Not open to freshmen."}, "MC384": {"name": " Metropolitan Society", "semester": "Fall of every year", "credits": " 4", "description": "Restructuring of urban and metropolitan society and social relations in 20th century America. Contemporary patterns of social life, relations, and politics in post-industrial metropolis.", "prerequisite": "(MC 280 or MC 281) and ((EC 201 or concurrently) or (EC 251H or concurrently)) and ((EC 202 or concurrently) or (EC 252H or concurrently)) and Completion of Tier I Writing Requirement"}, "MC385": {"name": " Comparative Race and Ethnic Relations", "semester": "Spring of even years", "credits": " 4", "description": "Advanced theories, cross national comparisons, and case studies of race and ethnic relations. Intergroup competition, conflict, dominance, accommodation, assimilation, and creolization. Prejudice, stereotypes, racism, ideologies, and political and economic processes.", "prerequisite": "(MC 220 or MC 281 or MC 230) and Completion of Tier I Writing Requirement", "restrictions": "Approval of college."}, "MC386": {"name": " Women and Power in Comparative Perspective", "semester": "Fall of every year", "credits": " 4", "description": "Application of feminist theory to questions of gender and power in different economic and political systems and geographic areas.", "prerequisite": "Completion of Tier I Writing Requirement", "restrictions": "Open to juniors or seniors in the James Madison College."}, "MC387": {"name": " Jews and Anti-Semitism", "semester": "Spring of every year", "credits": " 4", "description": "Comparative history and sociology of modern Jewish experiences. Anti-Semitism and intergroup relations; the Holocaust and responses to the Holocaust; assimilation and pluralism in the U.S.", "prerequisite": "Completion of Tier I Writing Requirement", "restrictions": "Open to juniors or seniors in the James Madison College."}, "MC388": {"name": " Sexual Politics: Historical and Contemporary Perspectives", "semester": "Fall of every year", "credits": " 4", "description": "Sexuality and gender in nineteenth and twentieth century history and politics. Social change, social movements, and sex roles.", "prerequisite": "Completion of Tier I Writing Requirement", "restrictions": "Open to students in the James Madison College or approval of college."}, "MC389": {"name": " Religious Politics in U.S. Society: Left, Right, and Other", "semester": "Spring of odd years", "credits": " 4", "description": "Role of religion in politics and society, especially the role religion plays in political mobilization, and the nature of political diversity within U.S. religious traditions.", "prerequisite": "((MC 280 or SOC 100 or SOC 488) or approval of college) and completion of Tier I writing requirement"}, "MC390": {"name": " Advanced Topics in Public Affairs", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": " 4", "description": "Issues in international relations, political theory and constitutional democracy, social relations and policy, and comparative cultures and politics.", "prerequisite": "Completion of Tier I Writing Requirement", "restrictions": "Open to juniors or seniors in the James Madison College or approval of college."}, "MC391": {"name": " Selected Topics in Public Affairs", "semester": "Spring of even years", "credits": "Variable from 3 to 4", "description": "Contemporary issues in public affairs.", "prerequisite": "Completion of Tier I Writing Requirement"}, "MC395": {"name": " Cultural Dimensions of Public Affairs", "semester": "Fall of every year, Spring of every year", "credits": " 4", "description": "Multiple interrelations between culture and public affairs in American and/or cross-cultural contexts. Uses literature, film, criticism, and history to illuminate issues of conflict, power, and social structure in a variety of historical and geographical contexts.", "prerequisite": "(MC 112 and MC 202) and completion of Tier I writing requirement"}, "MC399": {"name": " Advanced Independent Study", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 4", "description": "Advanced individual reading and research under faculty direction.", "prerequisite": "Completion of Tier I Writing Requirement", "restrictions": "Open to juniors or seniors. Approval of college."}, "MC400": {"name": " Field Experience", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 3 to 9", "description": "Practical internship experience with a public, private, or non-profit organization engaged in making, influencing, implementing, or analyzing policy relevant to college program.", "restrictions": "Open to juniors or seniors in the James Madison College."}, "MC401": {"name": " Field Experience: Analysis and Interpretation", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": " 3", "description": "Analysis and interpretation of field experience, sponsoring organization, or related policy issues under faculty direction.", "prerequisite": "Completion of Tier I Writing Requirement", "restrictions": "Open to juniors or seniors in the James Madison College."}, "MC410": {"name": " Research in Public Affairs", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 4", "description": "Faculty supervised undergraduate research in public and international affairs.", "restrictions": "Open to undergraduate students in the James Madison College. Approval of college."}, "MC411": {"name": " Advanced Collaborative Study in Public Affairs", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 4", "description": "Faculty supervised undergraduate research in public and international affairs.", "restrictions": "Open to students in the James Madison College. Approval of college; application required. A student may earn a maximum of 0 credits N/A"}, "MC412": {"name": " Public Affairs in Practice", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 4", "description": "Faculty or practitioner in residence course that enables students to learn from experienced professionals in the field of public and international affairs.", "restrictions": "Open to students in the James Madison College. Approval of college."}, "MC430": {"name": " Applied International Development", "semester": "Fall of odd years", "credits": " 4", "description": "Comprehensive, interdisciplinary and applied approach to international development policy and practice. Examination of key thematic areas as well as case studies", "prerequisite": "Completion of Tier I Writing Requirement", "restrictions": "Not open to freshmen."}, "MC441": {"name": " Islam and World Politics", "semester": "Spring of even years", "credits": " 4", "description": "Manifestations of political Islam within key Muslim countries such as Turkey, Egypt, Saudi Arabia, Iran, and Pakistan. Use of political Islam by states and groups as an instrument to advance their international goals.", "prerequisite": "Completion of Tier I Writing Requirement", "alias": "MC 420"}, "MC445": {"name": " Biodiversity Conservation Policy and Practice", "semester": "Spring of even years", "credits": " 3", "description": "Social, economic, and policy considerations. Approaches to conserve biodiversity.", "prerequisite": "Completion of Tier I Writing Requirement"}, "MC446": {"name": " International Energy Policy (W)", "semester": "Spring of every year", "credits": " 3", "description": "Analysis of theories and dilemmas within international energy policy, which could include energy security and geopolitics, energy governance institutions, energy poverty, sustainable energy and battery storage, global oil markets, 'fracking', and international dam building.", "prerequisite": "Completion of Tier I Writing Requirement", "restrictions": "Open to students in the James Madison College or in the Science, Technology, Environment and Public Policy Minor."}, "MC450": {"name": " International Environmental Law and Policy", "semester": "Spring of every year", "credits": " 3", "description": "Overview of concepts, actors, norms, laws, and institutions related to international environmental policy. Case studies on current global environmental issues."}, "MC459": {"name": " Science, Technology, Environment and Public Policy Capstone", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Selected topics in science, technology, environment and public policy (STEPPS). Analysis of key issues and problems. Case studies.", "prerequisite": "(FW 181 or approval of college) and completion of Tier I writing requirement"}, "MC469": {"name": " Applied Public Policy Research Seminar", "semester": "Spring of every year", "credits": " 3", "description": "Research on a public policy issue organized to develop a policy proposal collectively designed by all students in the class.", "prerequisite": "MC 295", "restrictions": "Open to juniors or seniors in the James Madison College."}, "MC481": {"name": " Global Issues in Fisheries and Wildlife", "semester": "Spring of even years", "credits": " 3", "description": "Global issues and their impacts on implications for the management of fisheries and wildlife resources.", "prerequisite": "Completion of Tier I Writing Requirement", "restrictions": "Open to juniors or seniors or graduate students."}, "MC482": {"name": " Gender and Violent Conflict", "semester": "Spring of every year", "credits": " 4", "description": "Gender consequences of a range of violent conflicts and their resolution. Theoretical contours and policy implications of gendered conflict within and between states. Contemporary case studies.", "prerequisite": "((MC 220 or MC 270 or MC 280 or ANP 220 or WS 201 or SOC 216 or MC 231) or approval of college) and completion of Tier I writing requirement", "restrictions": "Open to juniors or seniors."}, "MC490H": {"name": " Honors Independent Study", "semester": "Fall of every year, Spring of every year", "credits": " 4", "description": "Topic related to student's field.", "restrictions": "Open to juniors or seniors. Approval of college.", "alias": "MC 499H"}, "MC492": {"name": " Senior Seminar in International Relations (W)", "semester": "Fall of every year, Spring of every year", "credits": " 5", "description": "Major issues and theories of international relations.", "prerequisite": "Completion of Tier I Writing Requirement", "restrictions": "Open to seniors in the International Relations Major. Approval of college."}, "MC493": {"name": " Senior Seminar in Comparative Cultures and Politics (W)", "semester": "Fall of every year, Spring of every year", "credits": " 5", "description": "Advanced study of selected issues in the study of comparative cultures and politics.", "prerequisite": "Completion of Tier I Writing Requirement", "restrictions": "Open to seniors or approval of college."}, "MC495H": {"name": " Senior Honors Thesis", "semester": "Fall of every year, Spring of every year", "credits": " 4", "description": "Academic year-long thesis; topic related to student's field.", "restrictions": "Open to seniors in the James Madison College. Approval of college."}, "MC497": {"name": " Senior Seminar in Political Theory and Constitutional Democracy (W)", "semester": "Fall of every year, Spring of every year", "credits": " 5", "description": "Selected problems in political theory and constitutional democracy. Relationship between theory and politics. Analysis of key thinkers. Case studies.", "prerequisite": "(MC 371) and completion of Tier I writing requirement", "restrictions": "Open to seniors in the James Madison College or approval of college.", "alias": "MC 495"}, "MC498": {"name": " Senior Seminar in Social Relations (W)", "semester": "Fall of every year, Spring of every year", "credits": " 5", "description": "American social relations and policy. Theoretical issues. Analysis of key thinkers. Case studies.", "prerequisite": "(MC 380) and completion of Tier I writing requirement", "restrictions": "Open to seniors in the James Madison College or approval of college."}}}