{"code": "MGT", "name": "Management", "courses": {"MGT293": {"name": " Cooperative Education for Business Students", "semester": "Fall of every year, Spring of every year", "credits": " 1", "description": "Integration of pre-professional educational employment experiences in industry and government with knowledge and processes taught in the student's academic program. Educational employment assignment approved by the Department of Supply Chain Management.", "restrictions": "Approval of department.", "alias": "MSC 293"}, "MGT315": {"name": " Managing Human Resources and Organizational Behavior", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": " 3", "description": "Formulation and administration of human resource policies in the business enterprise. Personnel planning, job analysis and evaluation, staffing. Compensation and labor relations. Employee safety. Training, development, and performance appraisal. Issues of diversity and ethics.", "restrictions": "Open to juniors or seniors in the Accounting major or in the Finance Major or in the Marketing Major or in the Supply Chain Management Major or in the Business - Admitted major or in the Human Resource Management Major or in the Management Major and not open to students in the School of Hospitality Business.", "alias": "MGT 310"}, "MGT325": {"name": " Management Skills and Processes", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": " 3", "description": "Managerial skills and processes in goal-directed institutions.", "restrictions": "Open to juniors or seniors and not open to students in the Accounting major or in the Finance Major or in the Marketing Major or in the Supply Chain Management Major or in the Business - Admitted major or in the Business-Preference major or in the Human Resource Management Major or in the Management Major.", "alias": "MGT 302"}, "MGT352": {"name": " Entrepreneurship: New Venture Process", "semester": "Spring of every year", "credits": " 3", "description": "Becoming an entrepreneur. Developing successful business ideas. Moving from an idea to an entrepreneurial firm. Managing and growing an entrepreneurial firm.", "prerequisite": "ACC 202 or ACC 230", "restrictions": "Open to juniors or seniors in the Eli Broad College of Business and The Eli Broad Graduate School of Management or in the Retail Management Minor and not open to students in the School of Hospitality Business."}, "MGT371": {"name": " Retail Planning and Buying", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Role of a retail buyer in consumer products/fashion industries. Market and trend research, target customer needs, assortment planning, strategic buying, international sourcing, merchandise planning and control, and product development.", "restrictions": "Open to students in the Retail Management Minor or approval of department."}, "MGT393": {"name": " Introduction to International Business", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 3", "description": "Introduction to the context of international business delivered on-site in foreign settings. Fundamental concepts and principles of globalization such as multinational corporations, foreign markets and economies, internal and external market transactions, international law, cultural influences, and multinational business strategies.", "restrictions": "Open to students in the Eli Broad College of Business and The Eli Broad Graduate School of Management or in the School of Hospitality Business."}, "MGT409": {"name": " Business Policy and Strategic Management", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": " 3", "description": "Techniques for building and maintaining consistent and effective policy and strategy. Major functions within a firm. Strategic integration, ethics, and international competition.", "prerequisite": "MKT 300 and SCM 303 and FI 311", "restrictions": "Open to seniors in the Eli Broad College of Business and The Eli Broad Graduate School of Management and not open to undergraduate students in the School of Hospitality Business."}, "MGT411": {"name": " Organizational Staffing", "semester": "Spring of every year", "credits": " 3", "description": "Job and organizational analysis. Personnel planning, recruitment, selection and placement. Employment interviewing and testing. Validation of selection procedures, equal opportunity employer (EEO) guidelines, and affirmative action. Issues and diversity of ethics.", "prerequisite": "(MGT 315 or concurrently) or (MGT 325 or concurrently)", "restrictions": "Open to juniors or seniors in the Eli Broad College of Business and The Eli Broad Graduate School of Management or in the Retail Management Minor or in the Sports Business Management Minor and not open to students in the School of Hospitality Business."}, "MGT412": {"name": " Compensation and Reward Systems", "semester": "Fall of every year", "credits": " 3", "description": "Designing compensation systems. Job evaluation, internal and external equity. Pay-for-performance plans and financial incentives. Wage and salary surveys. Benefits administration. Diversity and ethical considerations.", "prerequisite": "(MGT 315 or concurrently) or (MGT 325 or concurrently)", "restrictions": "Open to juniors or seniors in the Eli Broad College of Business and The Eli Broad Graduate School of Management or in the Retail Management Minor or in the Sports Business Management Minor and not open to students in the School of Hospitality Business."}, "MGT413": {"name": " Personnel Training and Development", "semester": "Fall of every year", "credits": " 3", "description": "Designing and implementing training and development programs. Career stages and career planning. Needs analysis. Experimental design and program evaluation. Learning theories. Issues and diversity of ethics.", "prerequisite": "(MGT 315 or concurrently) or (MGT 325 or concurrently)", "restrictions": "Open to juniors or seniors in the Eli Broad College of Business and The Eli Broad Graduate School of Management or in the Retail Management Minor and not open to students in the School of Hospitality Business."}, "MGT414": {"name": " Diversity in the Workplace", "semester": "Spring of every year", "credits": " 3", "description": "Problems experienced by racial, ethnic, physically disabled, and other minorities in work organizations. Awareness training for managers. Ethical issues.", "prerequisite": "(MGT 315 or concurrently) or (MGT 325 or concurrently)", "restrictions": "Open to juniors or seniors in the Eli Broad College of Business and The Eli Broad Graduate School of Management or in the Retail Management Minor or in the Sports Business Management Minor and not open to students in the Hospitality Business Major."}, "MGT418": {"name": " Labor-Management Relations", "semester": "Spring of every year", "credits": " 3", "description": "Contextual framework of employment relations in union and non-union settings; history and labor law; environmental influences and employer and organized labor strategies; collective bargaining process including negotiations; grievance administration and arbitration; public sector employment relations.", "prerequisite": "(MGT 315 or concurrently) or (MGT 325 or concurrently)", "restrictions": "Open to juniors or seniors in the Accounting major or in the Finance Major or in the Marketing Major or in the Supply Chain Management Major or in the Business - Admitted major or in the Human Resource Management Major or in the Management Major or in the Retail Management Minor or in the Sports Business Management Minor and not open to students in the School of Hospitality Business."}, "MGT460": {"name": " Capstone for Management Majors (W)", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Topics in management and organizational behavior.", "prerequisite": "(MGT 315 or concurrently) or (MGT 325 or concurrently)", "restrictions": "Open to seniors in the Human Resource Management Major or in the Management Major or in the Retail Management Minor or in the Sports Business Management Minor."}, "MGT474": {"name": " Negotiations", "semester": "Fall of every year, Spring of every year", "credits": " 2", "description": "Strategic negotiation, negotiation preparation, buyer-supplier relationship assessment, international negotiations, and negotiation simulation.", "restrictions": "Open to juniors or seniors in the Supply Chain Management Major or approval of department.", "alias": "SCM 474"}, "MGT475": {"name": " Negotiation and Conflict Management", "semester": "Fall of every year", "credits": " 3", "description": "Negotiation and bargaining to manage people and interpersonal relations. Developmental processes, stages, and types of conflict. Conflict management and resolution.", "restrictions": "Open to juniors or seniors in the Eli Broad College of Business and The Eli Broad Graduate School of Management and not open to students in the School of Hospitality Business or approval of department."}, "MGT476": {"name": " Globalization and International Management", "semester": "Spring of every year", "credits": " 3", "description": "International management issues, including national culture, leadership, decision making, team performance, communication, negotiations, structure, and personal career implications of international management.", "prerequisite": "MGT 315 or concurrently", "restrictions": "Open to juniors or seniors in the Eli Broad College of Business and The Eli Broad Graduate School of Management and not open to students in the School of Hospitality Business or approval of department."}, "MGT479": {"name": " Sports Business Management", "semester": "Fall of every year", "credits": " 3", "description": "Introduction to current sports industry landscape and impact of business on decision-making in sports. Focus on trends in intercollegiate athletics and professional sports including careers, governance, organizational structure, revenue and sports entertainment.", "restrictions": "Open to juniors or seniors in the Sports Business Management Minor or approval of department."}, "MGT490": {"name": " Independent Study", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 3", "description": "Supervised program of independent library research designed to supplement classroom study.", "restrictions": "Open to seniors. Approval of department."}, "MGT491": {"name": " Special Topics in Management", "semester": "Spring of even years", "credits": " 3", "description": "Topics in management such as advanced organizational behavior, managing labor relations, organizational development, organizational theory and design, strategic leadership and decision making.", "prerequisite": "(MGT 315 or concurrently) or (MGT 325 or concurrently)", "restrictions": "Open to juniors or seniors in the Eli Broad College of Business and The Eli Broad Graduate School of Management or in the Retail Management Minor or in the Sports Business Management Minor and not open to students in the School of Hospitality Business."}, "MGT493A": {"name": " Sports Business: Internship", "semester": "Spring of every year, Summer of every year", "credits": " 3", "description": "Supervised, professional work or internship experience in the field of sports business with intercollegiate athletics or professional sports associations, firms, leagues, organizations, teams or sports business and entertainment companies.", "prerequisite": "MGT 479", "restrictions": "Open to juniors or seniors in the Sports Business Management Minor or approval of department.", "alias": "MGT 493", "exclude": "MGT 493B"}, "MGT493B": {"name": " Sports Business: Fieldwork Seminar", "semester": "Spring of every year", "credits": " 3", "description": "Leadership in day-to-day operations, decision making, strategic planning alongside industry leader in sports business. Hands-on projects in intercollegiate athletics, professional sports or applicable associations, firms or leagues. Rotational exposure to unit(s) and/or executive(s) within organization. Behind the scenes experience and knowledge of industry through real-time projects and solution-focused problem solving.", "prerequisite": "MGT 479", "restrictions": "Open to juniors or seniors in the Sports Business Management Minor or approval of department.", "exclude": "MGT 493A"}, "MGT801": {"name": " Analyzing your Organization", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 2", "description": "Analysis of the student's organization focusing on issues related to the management of people, group processes, and organizational design. Review of various aspects of their organizations' processes related to the management of people and suggest a plan for improving the effectiveness of those processes. Issues include motivation, diversity, leadership, group performance, and culture.", "prerequisite": "MGT 810 or MGT 824", "restrictions": "Open to master's students in the Eli Broad College of Business and The Eli Broad Graduate School of Management and not open to MBA students in the Eli Broad College of Business and The Eli Broad Graduate School of Management.", "exclude": "PIM 801"}, "MGT802": {"name": " Strategic Analysis", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": " 1", "description": "Supervised analysis of the student's employing organization, focusing on interviewing the CEO or visible leader. Assessing the correspondence between the leader's vision and concepts presented in the program.", "prerequisite": "MGT 856", "restrictions": "Open to master's students in the Department of Management.", "exclude": "PIM 804"}, "MGT804": {"name": " International Management", "semester": "Fall of every year, Spring of every year", "credits": "Variable from 1 to 3", "description": "Management challenges and roles in a multinational business. Strategic planning in global firms, managing people in international organizations, leadership, and the future of international management.", "prerequisite": "MBA 824 or (MGT 810 or MGT 824 or approval of department)", "restrictions": "Open to graduate students in the Eli Broad College of Business and The Eli Broad Graduate School of Management or approval of department."}, "MGT805": {"name": " Special Topics in Management", "semester": "Fall of every year", "credits": "Variable from 1 to 3", "description": "Selected topics in current and emerging issues in management.", "restrictions": "Open to graduate students in the Eli Broad College of Business and The Eli Broad Graduate School of Management or approval of department."}, "MGT810": {"name": " Human Resource Management for General Managers", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 3", "description": "Human resource management functions performed by all managers. Design, administration, and evaluation of human resource activities. Needs assessment, program implementation and evaluation, information management and decision support, and international human resource management.", "restrictions": "Open to master's students in the Eli Broad College of Business and The Eli Broad Graduate School of Management or approval of department."}, "MGT811": {"name": " Fundamentals of Human Resource Staffing", "semester": "Spring of every year", "credits": "Variable from 1 to 3", "description": "Fundamentals of human resource staffing. Legal issues; measurement, reliability, and validity; job analysis; performance assessment; and recruitment.", "prerequisite": "MGT 810 or concurrently", "restrictions": "Open to master's students in the Eli Broad College of Business and The Eli Broad Graduate School of Management or approval of department."}, "MGT812": {"name": " Advanced Topics in Human Resource Staffing", "semester": "Spring of every year", "credits": "Variable from 1 to 3", "description": "Initial assessment methods such as letters of recommendations and weighted application blanks. Substantive assessment methods such as cognitive ability, personality, integrity, and situational judgment tests. Structured interviews and assessment centers. Selection decision making.", "prerequisite": "MGT 811 or concurrently", "restrictions": "Open to master's students in the Eli Broad College of Business and The Eli Broad Graduate School of Management or approval of department."}, "MGT814": {"name": " Managing Diversity in the Workplace", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 3", "description": "Problems experienced by racial, ethnic, physically disabled, and other minorities in work organizations. Awareness training for managers.", "prerequisite": "MGT 810 or concurrently", "restrictions": "Open to master's students in the Eli Broad College of Business and The Eli Broad Graduate School of Management."}, "MGT817": {"name": " Managing the Learning Organization", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 3", "description": "Assessing knowledge, skills, and abilities within the organization. Matching future employee skill needs with appropriate learning strategies. Linking employee knowledge, skills, and abilities with overall organizational strategies.", "prerequisite": "MGT 810 or concurrently", "restrictions": "Open to master's students in the Eli Broad College of Business and The Eli Broad Graduate School of Management."}, "MGT818": {"name": " Talent Management and Development", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 3", "description": "The role of managing human resources to realize organizational goals and mission. Employee recruitment and development, performance management, succession planning, and retention strategies. Career management and leadership development.", "restrictions": "Open to master's students in the Eli Broad College of Business and The Eli Broad Graduate School of Management or approval of department."}, "MGT822": {"name": " Developing Reward and Compensation Systems", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 3", "description": "Application of compensation principles to organizational objectives. Strategic use of compensation systems for attracting, motivating, and retaining employees. Managerial aspects of paying employees at all organizational levels.", "prerequisite": "MGT 810 or concurrently", "restrictions": "Open to master's students in the Eli Broad College of Business and The Eli Broad Graduate School of Management and open to MBA students in the Eli Broad College of Business and The Eli Broad Graduate School of Management or approval of department."}, "MGT824": {"name": " Developing Managerial Skills", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 3", "description": "The management of people, group processes, and organizational design. Theories and research are applied to developing managerial skills in motivation and leadership, with an understanding of diversity, organizational culture and structure.", "restrictions": "Open to master's students in the Eli Broad College of Business and The Eli Broad Graduate School of Management and not open to MBA students in the Eli Broad College of Business and The Eli Broad Graduate School of Management or approval of department.", "alias": "MGT 806", "exclude": "MBA 824"}, "MGT832": {"name": " Foundations of Negotiation", "semester": "Fall of every year", "credits": "Variable from 1 to 3", "description": "Fundamentals of effective negotiations through readings, simulations, videos, and discussions. Planning for negotiation, integrative and distributive negotiation strategies, power and influence, ethics and interpersonal communication. Experience in negotiating through simulations and follow-up discussions.", "prerequisite": "MBA 824 or MGT 824", "restrictions": "Open to master's students in the Eli Broad College of Business and The Eli Broad Graduate School of Management or approval of department."}, "MGT833": {"name": " Complex Negotiations and Dispute Resolution Systems", "semester": "Fall of every year", "credits": "Variable from 1 to 3", "description": "Managing complex negotiations, such as mediated conflicts, coalitions, multiparty negotiations, cross-cultural negotiations, and dispute resolution system design. Unique challenges in complex negotiations and strategies to meet bargainers' interests in these negotiations.", "prerequisite": "MGT 832", "restrictions": "Open to master's students in the Eli Broad College of Business and The Eli Broad Graduate School of Management or approval of department."}, "MGT840": {"name": " Leadership and Team Management", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 3", "description": "Development of leadership abilities through readings and laboratory application.", "prerequisite": "MBA 808 or (MGT 824 or approval of department)", "restrictions": "Open to master's students in the Eli Broad College of Business and The Eli Broad Graduate School of Management or approval of department."}, "MGT842": {"name": " Leading A Strategy Change", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 3", "description": "Issues related to role of leadership in the change process. Emphasis on the need for and execution of a change in strategy.", "restrictions": "Open to master''s students in the Eli Broad College of Business and The Eli Broad Graduate School of Management or approval of department."}, "MGT850": {"name": " Competitive and Business Strategy", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 3", "description": "Concepts and methods that integrate previous training in functional areas of management. Total firm perspective and ways top managers create and sustain competitive advantage in today's challenging global marketplace.", "restrictions": "Open to master's students in the Eli Broad College of Business and The Eli Broad Graduate School of Management and not open to MBA students in the Eli Broad College of Business and The Eli Broad Graduate School of Management.", "exclude": "MBA 850"}, "MGT854": {"name": " Global Strategy", "semester": "Fall of every year", "credits": "Variable from 1 to 3", "description": "The course is designed to provide an overview of the basic building blocks of the strategic management process in a global setting; provide a framework for understanding how multinational companies manage and leverage competitive advantage across international markets.", "prerequisite": "MGT 850 or MGT 858 or approval of department", "restrictions": "Open to master's students in the Eli Broad College of Business and The Eli Broad Graduate School of Management and not open to MBA students in the Eli Broad College of Business and The Eli Broad Graduate School of Management."}, "MGT856": {"name": " Corporate Strategy", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 3", "description": "Management of multi-business firms, conglomerates and business groups. Mergers and acquisitions, firm scope, strategic alliances, corporate governance and strategic leadership.", "prerequisite": "MBA 850 or MGT 850", "restrictions": "Open to master's students in the Eli Broad College of Business and The Eli Broad Graduate School of Management."}, "MGT863": {"name": " Negotiations", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 2", "description": "Strategic negotiations, negotiation preparation, buyer-supplier relationship assessment, international negotiations, and negotiation simulation.", "restrictions": "Open to master's students in the Eli Broad College of Business and The Eli Broad Graduate School of Management and not open to students in the Master of Business Administration in Business Administration."}, "MGT872": {"name": " Developing Competitive Strategy", "semester": "Fall of every year", "credits": "Variable from 1 to 3", "description": "Strategy development and execution as a process. Identification of issues that both impede and improve the likelihood of successful strategies.", "prerequisite": "MBA 850 or MGT 850", "restrictions": "Open to MBA students."}, "MGT873": {"name": " Strategic Decision Making", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 3", "description": "Process of strategic decision-making, identify issues that impede and improve decision success, examine a range of contextual factors that influence the decision process.", "prerequisite": "MBA 850 or MGT 850 or MGT 858", "restrictions": "Open to master's students in the Eli Broad College of Business and The Eli Broad Graduate School of Management."}, "MGT875": {"name": " Change Management", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 3", "description": "Role and process of organizational change management. Types of change, identifying need for change, and change management process.", "restrictions": "Open to master's students in the Department of Management or in the Department of Supply Chain Management."}, "MGT879": {"name": " Strategic Management Consulting Projects", "semester": "Spring of every year", "credits": " 3", "description": "Team-based, project-oriented course in which students work with a company to analyze a strategic issue facing the company. Development of a consulting engagement from project definition through a final report and recommendations.", "prerequisite": "MBA 850", "restrictions": "Open to MBA students."}, "MGT881": {"name": " Creating an Ethical Organization", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 2", "description": "Review factors that enhance and diminish ethical behavior in an organization, including the ethical dimensions of decision making, the nature of business ethics and the difference between ethical and legal behavior.", "restrictions": "Open to master's students in the Eli Broad College of Business and The Eli Broad Graduate School of Management and not open to MBA students in the Eli Broad College of Business and The Eli Broad Graduate School of Management."}, "MGT888": {"name": " Communication Strategies for Business", "semester": "Spring of every year", "credits": "Variable from 1 to 3", "description": "Professional communication skills, from basic business writing techniques to cutting-edge digital and social-media strategies.", "restrictions": "Open to graduate students in the Eli Broad College of Business and The Eli Broad Graduate School of Management. Approval of department."}, "MGT890": {"name": " Independent Study", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 3", "description": "Faculty-supervised independent study.", "restrictions": "Open to graduate students in the Eli Broad College of Business and The Eli Broad Graduate School of Management or approval of department."}, "MGT906": {"name": " Organizational Research Methods", "semester": "Fall of every year", "credits": " 3", "description": "Methods for scientific research in the areas of organizational behavior, personnel, and organizational theory. Theory building, hypothesis formation and testing, reliability theory, construct validity, external validity, research design.", "restrictions": "Open to doctoral students in the Eli Broad College of Business and The Eli Broad Graduate School of Management or approval of department."}, "MGT907": {"name": " Seminar in Organizational Behavior", "semester": "Fall of odd years", "credits": " 3", "description": "Directed readings on the behavior of individuals within organizations. Theory and empirical research on perception, decision-making, work motivation, work attitudes, leadership and group dynamics.", "restrictions": "Open to doctoral students in the Eli Broad College of Business and The Eli Broad Graduate School of Management or approval of department."}, "MGT908": {"name": " Seminar in Strategy Process", "semester": "Spring of even years", "credits": " 3", "description": "Strategy development as a process that drives the parallel issues of formulation and implementation. Survey of theory and research in this area.", "restrictions": "Open to doctoral students in the Eli Broad College of Business and The Eli Broad Graduate School of Management or approval of department."}, "MGT909": {"name": " Seminar in Human Resource Management", "semester": "Fall of even years", "credits": " 3", "description": "Classic and current empirical research. Job analysis, personnel selection, training, and incentive systems.", "restrictions": "Open to doctoral students in the Eli Broad College of Business and The Eli Broad Graduate School of Management or approval of department."}, "MGT910": {"name": " Seminar in Strategic Management", "semester": "Spring of odd years", "credits": " 3", "description": "Review of recent research literature. Topics include developments in strategic types, identification of strategic groups, strategy formulation, implementation, and decision making.", "restrictions": "Open to doctoral students in the Eli Broad College of Business and The Eli Broad Graduate School of Management or approval of department."}, "MGT912": {"name": " Special Topics Research Seminar", "semester": "On Demand", "credits": " 3", "description": "Research in timely and specialized topics in organizational behavior, organization theory, human research management, organizational policy and strategy.", "restrictions": "Open to doctoral students in the Eli Broad College of Business and The Eli Broad Graduate School of Management."}, "MGT914": {"name": " Advanced Organizational Research Methods", "semester": "Spring of every year", "credits": " 3", "description": "Methods for empirically testing scientific theories in organizational contexts.", "prerequisite": "MGT 906"}, "MGT999": {"name": " Doctoral Dissertation Research", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 24", "description": "Doctoral dissertation research.", "restrictions": "Open to doctoral students."}}}