{"code": "MI", "name": "Media and Information", "courses": {"MI101": {"name": " Understanding Media and Information", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": " 3", "description": "Critique and analysis of media including television, radio, film, handhelds, video games, social media and the Internet. Media history, effects and ethics. Technology, business and social developments affecting the media in the information society.", "alias": "TC 100, TC 110, TC 101"}, "MI201": {"name": " Media and Information Technologies and Industries", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": " 3", "description": "Operational principles and applications of media and information technologies and services. Technological, business, and policy developments transforming media and information industries. Local, national and global players in the media and information sector.", "prerequisite": "(MI 101 or concurrently) or (CSE 231 or concurrently)", "alias": "TC 201"}, "MI211": {"name": " Documentary History and Theory", "semester": "Fall of every year", "credits": " 3", "description": "Documentary history and theory form its origins to the present.", "restrictions": "Open to students in the School of Journalism or in the Department of Media and Information or in the Department of Writing, Rhetoric and American Cultures or in the Documentary Studies Specialization or in the Film Studies major."}, "MI220": {"name": " Methods for Understanding Users", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Basics of user research methods, such as interviews, surveys, content analysis, and focus groups. Methods to generate design ideas, solve design problems, and communicate the results."}, "MI227": {"name": " Concept Design for Games, Film, and TV", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Introduction to theories and techniques for generating concept art and design for games, films, TV, and animations.", "prerequisite": "CAS 116", "restrictions": "Open to students in the Department of Media and Information or in the Game Design and Development Minor or in the Fiction Filmmaking Minor."}, "MI230": {"name": " Game Design", "semester": "Spring of every year", "credits": " 3", "description": "Analyze, critique, and design of non-digital and digital games. Overview of game industry.", "prerequisite": "CAS 117", "restrictions": "Open to students in the Department of Media and Information or in the Department of Computer Science and Engineering or in the Game Design and Development Minor or in the Information and Communication Technology for Development Minor.", "alias": "TC 346, MI 346"}, "MI231": {"name": " Game and Interactive Media Development", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Brainstorming, planning, implementing, and troubleshooting applications and interfaces for games and interactive media. Basic principles of programming for interactivity.", "prerequisite": "(CAS 117) or (CAS 204 and CAS 208)", "restrictions": "Open to students in the Department of Media and Information or in the Design Specialization.", "alias": "TC 241, TC 331, MI 331"}, "MI239": {"name": " Digital Footprints: Privacy and Online Behavior", "semester": "Spring of every year", "credits": " 3", "description": "Exploration of digitization and capture of personal information. Issues of privacy, anonymity, and ownership. Technologies involved in capturing personal information.", "prerequisite": "Completion of Tier I Writing Requirement", "restrictions": "Open to undergraduate students."}, "MI241": {"name": " Filmmaking I", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": " 3", "description": "Process of creating a film product. Basic camera operation, sound capture, the editing process and producing a final product.", "prerequisite": "CAS 112", "restrictions": "Open to students in the Department of Media and Information.", "exclude": "CAS 201 or CAS 202"}, "MI247": {"name": " Three-Dimensional Graphics and Design", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": " 3", "description": "Principles of 3D computer graphics applied in cinema, games, illustration, design and sculpture. Use of 3D software to create and manipulate synthetic objects, materials, lights, and cameras.", "prerequisite": "(CAS 116) or (STA 110 and STA 113) or (CAS 205 or CAS 206 or CAS 207)", "restrictions": "Open to students in the Department of Media and Information or in the Game Design and Development Minor or in the Computer Science Major or in the Graphic Design Major or in the Bachelor of Fine Arts in Studio Art or in the Studio Art Major.", "alias": "TC 247"}, "MI250": {"name": " Introduction to Applied Programming", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Creation of software that responds to user input. Introduces variables, control structures, problem decomposition, finding and using existing libraries/APIs, producing user visible output, testing, creating documentation, and using version control."}, "MI291": {"name": " Special Topics", "semester": "Fall of every year, Spring of every year", "credits": "Variable from 1 to 4", "description": "Contemporary issues in media and communication technology.", "restrictions": "A student may earn a maximum of 16 credits in MI 291 and MI 491.", "alias": "TC 291"}, "MI301": {"name": " Bringing Media to Market", "semester": "Spring of every year, Summer of every year", "credits": " 3", "description": "Process of bringing media to market across multiple delivery platforms including broadcast, cable, satellite, Internet and mobile devices. Organization of creative industries, distribution methods, pricing and business models. Creation and repurposing of content. Practical and theoretical models of the behavior of media and information consumers.", "prerequisite": "(MI 201 or concurrently) or CAS 114 or BUS 190", "alias": "TC 356, TC 381, TC 301"}, "MI302": {"name": " Networks, Markets and Society", "semester": "Fall of every year", "credits": " 3", "description": "Theories and methods for understanding dynamic systems in which information and communication technology (ICT) and society evolve interdependently over time. Explores how ICTs shape human experience, and how politics, commercial interests and culture shape how ICTs are designed.", "prerequisite": "MI 201 or concurrently"}, "MI305": {"name": " Media and Information Policy", "semester": "Fall of every year", "credits": " 3", "description": "National, international and local policies and private agreements governing traditional, new and emerging media, including radio, television, film, games, social media, mobile communications and the Internet.", "prerequisite": "MI 201 or concurrently", "alias": "TC 200, TC 210"}, "MI311": {"name": " Introduction to Documentary Production", "semester": "Spring of every year", "credits": " 3", "description": "Introduction to documentary production using accessible and affordable digital technology.", "prerequisite": "MI 211", "restrictions": "Open to students in the Documentary Production Minor.", "alias": "TC 233"}, "MI320": {"name": " Reasoning with Data", "semester": "Spring of every year", "credits": " 3", "description": "Explore and summarize structured data using simple statistics such as means, standard deviations, contingency tables, and hypothesis tests, and use this data to evaluate arguments and draw conclusions about technology performance and human behavior.", "prerequisite": "MI 220 and MI 250"}, "MI327": {"name": " Advanced Concept Design for Games, Film, and TV", "semester": "Spring of every year", "credits": " 3", "description": "Advanced topics in generating concept art and design for games, films, and animations.", "prerequisite": "MI 227", "restrictions": "Open to students in the Department of Media and Information or in the Game Design and Development Minor or in the Fiction Filmmaking Minor."}, "MI335": {"name": " Film Directing", "semester": "Fall of every year", "credits": " 3", "description": "Concepts and techniques for directing in styles most associated with the art of film. Studies of innovative film directors. Skills of film directing, including script and shot breakdown. Directing actors and crew. Directing on location.", "prerequisite": "(FLM 230 or concurrently) and (CAS 112 or concurrently)", "restrictions": "Open to undergraduate students in the Fiction Filmmaking Minor.", "alias": "ENG 335"}, "MI337": {"name": " Compositing and Special Effects", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Conceptual and technical use of animation and compositing software for television, cinema, interactive media, and live performance.", "prerequisite": "{(CAS 112) and (CAS 111 or CAS 116)} or THR 219 or (CAS 201 and CAS 202) or (CAS 205 or CAS 206 or CAS 207)", "restrictions": "Open to students in the Department of Media and Information or in the Department of Theatre.", "alias": "TC 437, TC 337", "exclude": "THR 337"}, "MI341": {"name": " Filmmaking II", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": " 3", "description": "Film style planning, techniques, and aesthetic principles for cinema and television production.", "prerequisite": "MI 241", "restrictions": "Open to students in the Department of Media and Information or in the Documentary Production Minor or in the Fiction Filmmaking Minor.", "alias": "TC 341"}, "MI342": {"name": " Multi Camera Production for Television", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": " 3", "description": "Conceptualizing, designing, planning, producing, directing and evaluating multi-camera video programs.", "prerequisite": "(MI 241) or (CAS 112 and CAS 201 and CAS 202)", "restrictions": "Open to students in the Department of Media and Information or in the Documentary Production Minor or in the Fiction Filmmaking Minor.", "alias": "TC 342"}, "MI343": {"name": " Audio Production", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": " 3", "description": "Basic audio production techniques. In-depth audio and radio industry analysis. Media writing.", "prerequisite": "(MI 241) or (CAS 112 and CAS 201 and CAS 202)", "restrictions": "Open to students in the Department of Media and Information or in the Documentary Production Minor or in the Fiction Filmmaking Minor.", "alias": "TC 343"}, "MI344": {"name": " Sound Design for Cinema, Television, and Games", "semester": "Spring of every year, Summer of every year", "credits": " 3", "description": "Principles, technology, and techniques of sound design for media projects, including film, games, television, animation, and web.", "prerequisite": "(MI 241) or (CAS 112 and CAS 201 and CAS 202)", "restrictions": "Open to students in the Department of Media and Information or in the Documentary Production Minor or in the Fiction Filmmaking Minor."}, "MI347": {"name": " Advanced Three-Dimensional Computer Animation", "semester": "Spring of every year", "credits": " 3", "description": "How aesthetic skill, technical competency, and engaging performance are woven together to create compelling animation using 3D computer graphics. Use of industry standard software to create, manipulate and render synthetic characters and their environments.", "prerequisite": "MI 247", "restrictions": "Open to students in the Department of Media and Information or in the Game Design and Development Specialization.", "alias": "TC 347"}, "MI349": {"name": " Web Design and Development", "semester": "Fall of every year, Summer of every year", "credits": " 3", "description": "Preproduction, design and development of web sites, services, and applications that employ primarily web browser technologies.", "prerequisite": "(MI 220 or MI 231 or CSE 231) or (CAS 204 and CAS 205)", "restrictions": "Open to students in the Department of Media and Information or in the Department of Computer Science and Engineering or in the Design Specialization or in the Information and Communication Technology for Development Minor.", "alias": "TC 349"}, "MI350": {"name": " Evaluating Human-Centered Technology", "semester": "Spring of every year", "credits": " 3", "description": "How to form context-specific inquiry based on user needs and goals, assess fundamental usability problems, conduct lab-based summative evaluation methods, summarize their evaluation results into reports and design suggestions.", "prerequisite": "MI 220 and MI 250"}, "MI351": {"name": " Producing For Cinema and Television", "semester": "Spring of every year", "credits": " 3", "description": "Conceptualizing, designing, planning, and developing projects for cinema and television.", "prerequisite": "(MI 241) or (CAS 112 and CAS 201 and CAS 202)", "restrictions": "Open to students in the Department of Media and Information or in the Documentary Production Minor or in the Fiction Filmmaking Minor.", "alias": "TC 351"}, "MI355": {"name": " Media and Information Research", "semester": "Spring of every year", "credits": " 3", "description": "Applied media and information research methods, practices, techniques and ethics. Data analytics, visualization and online research methods.", "alias": "ADV 340, ADV 355, TC 376, TC 355"}, "MI360": {"name": " Media and Information Management", "semester": "Fall of every year", "credits": " 3", "description": "Basic principles of managing and financing media and information companies, media projects, and information applications.", "prerequisite": "MI 201 or concurrently"}, "MI361": {"name": " IT Network Management and Security", "semester": "Spring of every year", "credits": " 3", "description": "Structure, design, and management of data networks with a focus on business settings. Examination of information technology security issues specifically in the context of data networks and new, digital media and ITs.", "prerequisite": "MI 201 or CSE 231", "alias": "TC 361"}, "MI377": {"name": " Advanced 3D Modeling", "semester": "Fall of every year", "credits": " 3", "description": "Learn advanced techniques in 3D modeling and texturing for games, movies, television, and motion graphics.", "prerequisite": "MI 247", "restrictions": "Open to students in the Department of Media and Information."}, "MI401": {"name": " Topics in Media, Information and Society (W)", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": " 3", "description": "Cultural, technological, and design evolution of media and information. Conventional and emerging theories of media processes and effects. Critical examination of empirical research concerning social impacts of media, information technologies, and the Internet.", "prerequisite": "(MI 101) and completion of Tier I writing requirement", "alias": "TC 239, TC 339, TC 375, TC 401"}, "MI411": {"name": " Collaborative Documentary Design and Production (W)", "semester": "Spring of every year", "credits": " 3", "description": "Design and development of documentaries in a team setting using video and audio, still photography, web design, and print media. Participation in a production cycle including idea generation, research, design, production, and distribution.", "prerequisite": "Completion of Tier I Writing Requirement", "restrictions": "Open to students in the Documentary Production Minor.", "alias": "TC 411"}, "MI419": {"name": " Projection Design for Live Performance", "semester": "Spring of every year", "credits": " 3", "description": "Creating projection performance media through script, technology advancements, and production analysis. Practical application through digital rendering, video production and software exploration.", "prerequisite": "(THR 219) or (THR 337 or MI 337 or MI 341)"}, "MI420": {"name": " Interactive Prototyping", "semester": "Fall of every year", "credits": " 3", "description": "Creation of iterative and diverse prototypes of computer-based technologies that satisfy user needs. Low-fidelity prototypes that can be used for design feedback and medium-fidelity working prototypes that can be used to assess interactivity and social goals.", "prerequisite": "MI 220 and MI 250"}, "MI431": {"name": " Advanced Game Development", "semester": "Fall of every year", "credits": " 3", "description": "Advanced concepts in planning, implementing, and troubleshooting applications and interfaces for games and interactive media.", "prerequisite": "MI 231 or CSE 232", "restrictions": "Open to students in the Department of Media and Information or in the Department of Computer Science and Engineering or in the Game Design and Development Minor.", "alias": "MI 333"}, "MI435A": {"name": " Creating the Fiction Film I", "semester": "Fall of every year", "credits": " 3", "description": "Creation of a short film, including scripting, conceptualization and planning, shooting, and rough editing.", "prerequisite": "FLM 335", "restrictions": "Open to undergraduate students in the Fiction Filmmaking Minor or approval of department.", "alias": "ENG 435A"}, "MI435B": {"name": " Creating the Fiction Film II (W)", "semester": "Spring of every year", "credits": " 3", "description": "Finishing a short film, including fine editing, color correction, sound design, and foley work. Developing web promotion, marketing strategies, and distribution.", "prerequisite": "(FLM 435A or approval of department) and Completion of Tier I Writing Requirement", "restrictions": "Open to undergraduate students in the Fiction Filmmaking Minor or approval of department.", "alias": "ENG 435B"}, "MI440": {"name": " Advanced Video Editing", "semester": "Spring of every year", "credits": " 3", "description": "Advanced principles, technology and techniques of video editing.", "prerequisite": "MI 341", "restrictions": "Open to students in the Department of Media and Information or in the Documentary Production Minor or in the Fiction Filmmaking Minor.", "alias": "MI 352"}, "MI441": {"name": " Advanced Lighting and Camera Techniques", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Advanced techniques for manipulation of light and image characteristics in film and television settings.", "prerequisite": "MI 341", "restrictions": "Open to students in the Department of Media and Information or in the Documentary Production Minor or in the Fiction Filmmaking Minor.", "alias": "TC 348, MI 348"}, "MI442": {"name": " Design of Cinema and Television Projects (W)", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": " 3", "description": "Develop TV, video and film projects in a group setting. Practice a full production cycle including idea development, budgeting, pitching, teaser, trailer, production, postproduction, distribution and evaluation. Production case studies, advertising, ethics and worldwide media and job trends.", "prerequisite": "(MI 341) and Completion of Tier I Writing Requirement", "restrictions": "Open to juniors or seniors or graduate students in the Department of Media and Information or in the Documentary Production Minor or in the Fiction Filmmaking Minor.", "alias": "TC 442"}, "MI443": {"name": " Audio Industry Design and Management (W)", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": " 3", "description": "Advanced audio production specializing in multi-channel techniques. Industry focus on all aspects of the audio field.", "prerequisite": "(MI 343) and Completion of Tier I Writing Requirement", "restrictions": "Open to juniors or seniors or graduate students in the Department of Media and Information.", "alias": "TC 443"}, "MI444": {"name": " Information Technology Project Management", "semester": "Spring of every year", "credits": " 3", "description": "Practical training and experiences in design, testing, and launch of new information technologies and systems.", "prerequisite": "ITM 311", "restrictions": "Open to students in the Information Technology Minor."}, "MI445": {"name": " Game Design and Development I", "semester": "Fall of every year", "credits": " 3", "description": "Design, architecture, and creation concepts related to the development of interactive digital games.", "prerequisite": "MI 231 or CSE 331 or CSE 335 or STA 360", "restrictions": "Open to students in the Game Design and Development Minor and open to graduate students in the Department of Media and Information.", "alias": "TC 445"}, "MI447": {"name": " Graphics and Animation Portfolio (W)", "semester": "Fall of every year", "credits": " 3", "description": "Development of a portfolio of advanced three-dimensional models, animation, concept design, and technical art to focus skills on a specific profession or industry.", "prerequisite": "(MI 327 or MI 347 or MI 377) and Completion of Tier I Writing Requirement", "restrictions": "Open to seniors or graduate students in the Department of Media and Information.", "alias": "TC 447"}, "MI449": {"name": " Advanced Web Development and Database Management", "semester": "Spring of every year", "credits": " 3", "description": "Learn and apply server-side web technologies and database integration with client-side web technologies, to design, development, and deploy modern web sites, services, and applications.", "prerequisite": "MI 349", "restrictions": "Open to students in the Department of Media and Information or in the Department of Computer Science and Engineering.", "alias": "TC 449, TC 359, MI 359"}, "MI450": {"name": " Creating Human-Centered Technology (W)", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Entire human-centered design process, including assessing needs, forming ideas, designing a solution, building prototypes, evaluating the effectiveness of those solutions, and iterating to improve the solutions. Creation of a portfolio piece to illustrate capabilities.", "prerequisite": "(MI 320 and MI 350 and MI 420 or approval of department) and Completion of Tier I Writing Requirement", "alias": "TC 450"}, "MI452": {"name": " Media Entrepreneurship and Business Strategies", "semester": "Fall of every year", "credits": " 3", "description": "Entrepreneurship and business strategy options, with their attendant risks and opportunities, available to media firms in an industry that is being dynamically transformed by new information and communication technologies.", "prerequisite": "(MI 301) and completion of Tier I writing requirement", "alias": "TC 452"}, "MI455": {"name": " Game Design and Development II", "semester": "Spring of every year", "credits": " 3", "description": "Advanced design, architecture, and creation concepts related to the development of real-time interaction 3D design for gaming, simulation, and immersive virtual environments.", "prerequisite": "MI 445", "restrictions": "Open to students in the Game Design and Development Minor and open to graduate students in the Department of Media and Information.", "alias": "TC 455"}, "MI462": {"name": " Social Media and Social Computing", "semester": "Fall of every year", "credits": " 3", "description": "Social and technological perspectives on how people collaborate using social media and other information and communication technologies. Experience with using multiple collaboration platforms and analysis of differences between enabling technologies.", "prerequisite": "(MI 349 or MI 361 or approval of department) and Completion of Tier I Writing Requirement", "restrictions": "Open to juniors or seniors or graduate students.", "alias": "TC 462B, TC 462"}, "MI472": {"name": " Digital Business and Commerce", "semester": "Spring of every year", "credits": " 3", "description": "Technologies, business models, and organizational and social implications of electronic commerce. Strategies for designing, managing and marketing in digital commerce contexts.", "prerequisite": "((MI 349 or MI 361) or approval of department) and completion of Tier I writing requirement", "restrictions": "Open to juniors or seniors or graduate students.", "alias": "TC 462C, TC 472"}, "MI480": {"name": " Information and Communication Technologies and Development", "semester": "Fall of every year", "credits": " 3", "description": "Role of information and communications technologies (ICT) in low income countries and in disadvantaged areas in middle and high income countries. Theories and case studies that link ICT and social, political, economic and environmental change.", "prerequisite": "Completion of Tier I Writing Requirement", "alias": "TC 480"}, "MI482": {"name": " Building Virtual Worlds", "semester": "Spring of every year", "credits": " 3", "description": "Theoretical and practical approaches to the planning, design, and development of virtual worlds for games and simulations.", "prerequisite": "(MI 230) or MI 445", "restrictions": "Open to students in the Department of Media and Information or in the Game Design and Development Minor."}, "MI484": {"name": " Building Innovative Interfaces", "semester": "Fall of every year", "credits": " 3", "description": "Designing, implementing and evaluating new interaction devices using mobile and sensor technologies.", "prerequisite": "MI 231 or MI 250 or CSE 320 or CSE 331 or CSE 335", "restrictions": "Open to students in the Department of Media and Information or in the Department of Computer Science and Engineering or in the Game Design and Development Minor."}, "MI488": {"name": " Information and Communication Technology Development Project (W)", "semester": "Spring of every year, Summer of every year", "credits": "Variable from 3 to 6", "description": "Challenges and opportunities of implementing an information and communication technology in a developing country or underprivileged region of the United States. Hands-on experience conducting field work on location.", "prerequisite": "Completion of Tier I Writing Requirement", "alias": "TC 488"}, "MI490": {"name": " Independent Study", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 7", "description": "Directed study under faculty supervision.", "restrictions": "Open to undergraduate students in the Department of Media and Information. Approval of department; application required.", "alias": "TC 490"}, "MI491": {"name": " Special Topics", "semester": "Fall of every year, Spring of every year", "credits": "Variable from 1 to 4", "description": "Contemporary issues in media and communication technology.", "restrictions": "Open to juniors or seniors or graduate students in the Department of Media and Information. A student may earn a maximum of 16 credits MI291 and MI491.", "alias": "TC 491"}, "MI493": {"name": " Internship", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 7", "description": "Supervised professional experience in a media or information institution, business or facility.", "restrictions": "Open to undergraduate students in the Department of Media and Information. Approval of department; application required.", "alias": "TC 493"}, "MI497": {"name": " Game Design Studio", "semester": "Fall of every year", "credits": " 3", "description": "Conceptualization, design documentation, planning, prototyping, and distribution of games.", "prerequisite": "MI 455", "restrictions": "Open to students in the Game Design and Development Specialization and open to graduate students in the Department of Media and Information.", "alias": "TC 497"}, "MI498": {"name": " Collaborative Game Design (W)", "semester": "Spring of every year", "credits": " 3", "description": "Design and development of comprehensive digital games in a team setting working with a client. Participation in a design cycle including specification, design, prototyping, implementation, testing, and documentation. Issues of professionalism, ethics, and communication.", "prerequisite": "(MI 497 or MI 482 or MI 447) and completion of Tier I writing requirement", "restrictions": "Open to students in the Department of Media and Information or in the Game Design and Development Minor.", "alias": "TC 498"}, "MI803": {"name": " Introduction to Quantitative Research Methods", "semester": "Fall of every year, Summer of every year", "credits": " 3", "description": "Introduction to quantitative social science research methods and applied analyses for understanding research reports and developing graduate level research projects.", "alias": "ADV 875, COM 800, JRN 817, TC 802"}, "MI820": {"name": " Theories of Media and Information", "semester": "Fall of every year", "credits": " 3", "description": "Classic and contemporary theories of communication and information with special emphases on applications to current and emerging media, and information and communication technologies viewed from a socio-technical perspective.", "restrictions": "Open to graduate students in the College of Communication Arts and Sciences or approval of department.", "alias": "TC 820"}, "MI830": {"name": " Foundations of Serious Games", "semester": "Spring of every year", "credits": " 3", "description": "Rationales, principles, processes, and pedagogies for serious game design. Applications of serious game genres and simulations. Funding and distribution.", "restrictions": "Open to students in the Media and Information Major or in the Serious Game Design and Research Certificate or in the Educational Technology Major or in the Educational Technology Graduate Certificate or approval of department.", "alias": "TC 830"}, "MI831": {"name": " Theories of Games and Interaction Design", "semester": "Fall of every year", "credits": " 3", "description": "Theories of interaction in games and other mediated contexts including communication, learning, health, global and local development, and social justice to inform the design of social systems, games and other interactive media products.", "restrictions": "Open to students in the Media and Information Major or in the Serious Game Design and Research Certificate or in the Educational Technology Major or in the Educational Technology Graduate Certificate or approval of department.", "alias": "TC 831"}, "MI839": {"name": " Game and Film Design Studio I", "semester": "Fall of every year", "credits": " 3", "description": "Design principles for the creation of transmedia (games, film, websites, etc.). Design and development studio course focused on the creation of fictional storytelling projects across media projects.", "restrictions": "Open to graduate students in the College of Communication Arts and Sciences or approval of department.", "alias": "TC 839"}, "MI841": {"name": " Understanding Users", "semester": "Fall of every year", "credits": " 3", "description": "Methods of user-centered research to support game, media and interaction design. Iterative cycles of user and product conceptualization.", "restrictions": "Open to students in the College of Communication Arts and Sciences or in the Media and Information Major or in the Serious Game Design and Research Certificate or in the Educational Technology Major or in the Educational Technology Graduate Certificate or approval of department.", "alias": "TC 841"}, "MI844": {"name": " Interaction Design", "semester": "Spring of every year", "credits": " 3", "description": "Design of user interactions in information and media systems. Prototyping and presentation tools. Example topics include information architecture, task analysis, use cases, wire frames, scenarios.", "restrictions": "Open to graduate students in the College of Communication Arts and Sciences or approval of department.", "alias": "TC 844"}, "MI845": {"name": " Interactive Usability and Accessibility: Design and Evaluation", "semester": "Spring of every year", "credits": " 3", "description": "Principles and theories of usability and accessibility in interactive media, social and mobile computing, virtual environments and information appliances. Approaches to design and evaluation.", "restrictions": "Open to graduate students in the College of Communication Arts and Sciences or approval of department.", "alias": "TC 845"}, "MI846": {"name": " Game and Film Design Studio II", "semester": "Spring of every year", "credits": " 3", "description": "Design principles for the creation of transmedia (games, film, websites, etc.). Design and development studio course focused on the creation of fictional storytelling projects across media projects.", "restrictions": "Open to graduate students in the College of Communication Arts and Sciences or approval of department."}, "MI850": {"name": " Media and Information Policy", "semester": "Spring of every year", "credits": " 3", "description": "Discusses major public and private media and information policies, including Internet governance, and their relevance and implications for businesses, professionals in the field, and users of advanced communications. Applies concepts and data from media and information studies, management, technology, law, and political science.", "restrictions": "Open to graduate students in the College of Communication Arts and Sciences or approval of department.", "alias": "TC 810, TC 850"}, "MI851": {"name": " Understanding and Managing Social Media", "semester": "Spring of every year", "credits": " 3", "description": "Overview of social media applications and services, social media history, social media affordances, effects on individuals, organizations, and society, and best practices for the management and study of social media.", "restrictions": "Open to graduate students in the College of Communication Arts and Sciences or approval of department.", "alias": "TC 851"}, "MI852": {"name": " Media and Information Economics", "semester": "Fall of every year", "credits": " 3", "description": "Economic dynamics of the digital economy and its implications for businesses and managers. Emphasis on traditional and new media industries, including Internet-based media, mobile communications, social media, and information industries.", "restrictions": "Open to graduate students in the College of Communication Arts and Sciences or approval of department.", "alias": "TC 852"}, "MI861": {"name": " Media and Information Technologies in Organizations", "semester": "Fall of every year", "credits": " 3", "description": "Applications of media and information technologies in business settings. Implications for management of information technologies derived from an examination of effects of media and information technologies from a socio-technical perspective.", "restrictions": "Open to graduate students in the College of Communication Arts and Sciences or approval of department.", "alias": "TC 861"}, "MI862": {"name": " Managing Digital Enterprises", "semester": "Spring of every year", "credits": " 3", "description": "History and current status of e-commerce, e-commerce strategies and approaches, and new directions in e-commerce. Challenges of developing and marketing an online commerce site.", "restrictions": "Open to graduate students in the College of Communication Arts and Sciences or approval of department.", "alias": "TC 862"}, "MI875": {"name": " Information and Communication Technology and Development", "semester": "Spring of every year", "credits": " 3", "description": "Information and communication technology in developing areas, cases studies, design and implementation, and critical evaluation of the role of ICTs in development.", "restrictions": "Open to graduate students in the College of Communication Arts and Sciences or approval of department.", "alias": "TC 875"}, "MI877": {"name": " Global Media and Communications", "semester": "Fall of even years", "credits": " 3", "description": "Comparative and international perspectives on approaches to traditional and new media and their transformations by increased global connectivity. Addresses broadcasting, cable TV, satellite, fixed networks, mobile communications, and the Internet. Political economy of media, economic, institutional and content issues. Interactions and media flows among countries. International governance bodies.", "restrictions": "Open to graduate students in the College of Communication Arts and Sciences or approval of department.", "alias": "TC 877"}, "MI890": {"name": " Independent Study", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 6", "description": "Individualized study under faculty supervision.", "restrictions": "Open to graduate students in the Department of Media and Information. Approval of department; application required.", "alias": "TC 890"}, "MI891": {"name": " Special Topics in Media and Information", "semester": "Fall of every year, Spring of every year", "credits": "Variable from 1 to 3", "description": "Contemporary topics; varied.", "restrictions": "Open to graduate students in the College of Communication Arts and Sciences or approval of department.", "alias": "TC 891"}, "MI893": {"name": " Media and Information Internship", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 6", "description": "Internships in media and information industries.", "restrictions": "Open to graduate students in the College of Communication Arts and Sciences or approval of department.", "alias": "TC 893"}, "MI898": {"name": " Master's Project", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 6", "description": "Plan B individual project or poster demonstrating master's level professional competence.", "restrictions": "Open to master's students in the Department of Media and Information. Approval of department; application required.", "alias": "TC 843, TC 898"}, "MI899": {"name": " Master's Thesis Research", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 6", "description": "Master's thesis research.", "restrictions": "Open to graduate students in the Department of Media and Information. Approval of department; application required.", "alias": "TC 899"}, "MI900": {"name": " Theory Building in Media and Information Studies", "semester": "Fall of every year", "credits": " 3", "description": "Concepts and issues relating explanation, scientific inquiry, theory building and applications to interdisciplinary studies in media and information."}, "MI912": {"name": " Information Technology Transactional Perspectives", "semester": "Spring of even years", "credits": " 3", "description": "Multiple perspectives on relationships between organizations and information technology. Information processing, communications and management strategy approaches. Economic perspectives.", "restrictions": "Open to doctoral students."}, "MI916": {"name": " Qualitative Research Methods", "semester": "Spring of every year", "credits": " 3", "description": "Qualitative research in mass and specialized communication systems. Topics include documentary, bibliographic, case study and participant observation methods.", "restrictions": "Open to doctoral students in the College of Communication Arts and Sciences."}, "MI921": {"name": " Theories of Media and Information", "semester": "Fall of every year", "credits": " 3", "description": "Overview of the relations between information theory, communication theory, and media theory, and an understanding of how these theories have evolved over time and which competing approaches coexist.", "restrictions": "Open to doctoral students in the College of Communication Arts and Sciences or approval of college.", "alias": "ADV 921"}, "MI960": {"name": " Media and Technology", "semester": "Spring of every year", "credits": " 3", "description": "Theoretical frameworks concerning media and communication processes, and their interactions with technology. Social, organizational, critical, and economic perspectives.", "restrictions": "Open to doctoral students in the Communication Major or in the Media and Information Studies Major or approval of department.", "alias": "TC 960"}, "MI975": {"name": " Introductory Methods", "semester": "Fall of every year", "credits": " 3", "description": "A survey of qualitative and quantitative research design including validity and reliability, hypothesis formation, sampling, ethics, survey, experimental, ethnographic, observational and mixed methods.", "restrictions": "Open to doctoral students."}, "MI985": {"name": " Advanced Quantitative Analysis for Media", "semester": "Spring of every year", "credits": " 3", "description": "Multivariate research methods for media and information studies research.", "prerequisite": "ADV 975"}, "MI990": {"name": " Independent Study", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 3", "description": "Independent research under faculty direction.", "restrictions": "Open to doctoral students in the College of Communication Arts and Sciences or approval of college."}, "MI991": {"name": " Ways of Knowing", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Ways humans acquire, convey, organize and shape knowledge and information, and are shaped and influenced by it. Neurological, psychological linguistic, philosophical, cultural, and logical dimensions of human knowledge.", "restrictions": "Open to doctoral students in the College of Communication Arts and Sciences or approval of college."}, "MI992": {"name": " Doctoral Seminar", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Topics on theoretical and research issues in communication and mass media.", "restrictions": "Open to doctoral students in the College of Communication Arts and Sciences or approval of college."}, "MI993": {"name": " Research Practicum in Information and Media", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 3", "description": "Directed research collaboration with a faculty member or a team of students/faculty.", "restrictions": "Open to doctoral students in the College of Communication Arts and Sciences or approval of college."}}}