{"code": "MKT", "name": "Marketing", "courses": {"MKT250": {"name": " Business Communication: Oral and Written Skills", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": " 3", "description": "Communication skills including use of digital media, delivery mechanics, persuasive speaking, and preparation of executive briefs, memos, email messages.", "prerequisite": "Completion of Tier I Writing Requirement", "restrictions": "Open to undergraduate students in the Business - Admitted major.", "alias": "MGT 250"}, "MKT300": {"name": " Managerial Marketing", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": " 3", "description": "Analysis and strategic integration of buyer behavior, segmentation, positioning, demand analysis, information, pricing, promotion, channels, product policies, and ethics in consumer, reseller, industrial, and service markets.", "restrictions": "Open to sophomores or juniors or seniors in the Accounting major or in the Business - Admitted major or in the Finance Major or in the Human Resource Management Major or in the Management Major or in the Supply Chain Management Major or in the Marketing Major.", "alias": "MSC 300", "exclude": "MKT 327"}, "MKT302": {"name": " Consumer Behavior", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": " 3", "description": "Application of consumer behavior principles to customer satisfaction, market planning, and marketing mix decisions. Ethical, diversity, and international issues.", "prerequisite": "(MKT 300 or MKT 327) and (MKT 317 or concurrently)", "restrictions": "Open to juniors or seniors in the Eli Broad College of Business and The Eli Broad Graduate School of Management or in the Food Industry Management Major.", "alias": "MSC 302"}, "MKT310": {"name": " International Business", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": " 3", "description": "International and cross-cultural study of business decisions, enterprises, markets, and institutions. Globalization of industries and firm competitiveness. International business transactions and entry strategies.", "restrictions": "Open to juniors or seniors in the Accounting major or in the Business - Admitted major or in the Finance Major or in the Hospitality Business Major or in the Human Resource Management Major or in the Management Major or in the Supply Chain Management Major or in the Marketing Major or in the Applied Engineering Sciences Major.", "alias": "MSC 310"}, "MKT313": {"name": " Consultative Selling", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": " 3", "description": "Role of the sales organization and nature of customer and channel relationships. Buying behavior and sales processes. Fundamentals of personal selling. Experiential project that challenges students to assimilate and apply key concepts.", "restrictions": "Open to sophomores or juniors or seniors in the Eli Broad College of Business and The Eli Broad Graduate School of Management or in the College of Communication Arts and Sciences or in the Applied Engineering Sciences Major.", "alias": "MSC 313"}, "MKT317": {"name": " Market Analytics", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": " 3", "description": "Descriptive and predictive market analytics. Applications of analytics to real-world business decisions. Assessment and manipulation of large datasets. Application of statistical techniques to convert data into useable information. Communication of findings in a meaningful way.", "prerequisite": "STT 200 or STT 201 or STT 315 or STT 351", "restrictions": "Open to sophomores or juniors or seniors in the Accounting major or in the Business - Admitted major or in the Finance Major or in the Human Resource Management Major or in the Management Major or in the Supply Chain Management Major or in the Marketing Major or in the Applied Engineering Sciences Major.", "alias": "MSC 317"}, "MKT319": {"name": " Customer and Market Insights", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Research methods designed to obtain information for marketing decisions. Research design, data collection, and interpretation of information to aid in making managerial decisions.", "prerequisite": "(MKT 300 or MKT 327) and (MKT 317 or concurrently)", "restrictions": "Open to juniors or seniors in the Eli Broad College of Business and The Eli Broad Graduate School of Management.", "alias": "MSC 319"}, "MKT327": {"name": " Introduction to Marketing", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": " 3", "description": "Buyer behavior, segmentation, positioning, demand analysis, information, pricing, promotion, channels, product policies, and ethics in consumer, reseller, industrial, and service markets.", "restrictions": "Open to juniors or seniors and not open to students in the Accounting major or in the Business - Admitted major or in the Business-Preference major or in the Finance Major or in the Hospitality Business Major or in the Human Resource Management Major or in the Management Major or in the Marketing Major or in the Supply Chain Management Major.", "alias": "MSC 327", "exclude": "MKT 300"}, "MKT351": {"name": " Retail Management", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": " 3", "description": "Domestic and international retailing structure, environment, and development. Managerial strategy. Locational, purchasing, organizational, personnel and promotional techniques. Retail budgeting and control. Social and ethical considerations.", "prerequisite": "MKT 300 or MKT 327", "restrictions": "Open to juniors or seniors in the Eli Broad College of Business and The Eli Broad Graduate School of Management or in the Food Industry Management major and open to students in the Food Industry Management Specialization.", "alias": "MSC 351"}, "MKT355": {"name": " Entrepreneurial Marketing", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Process of planning, starting, and positioning new businesses which link directly to customer requirements. Understanding unmet market opportunity due to competitive gaps or customer needs (realized or not) for both consumer and industrial products and services.", "prerequisite": "MKT 300 or MKT 327 or ESHP 190", "restrictions": "Open to undergraduate students in the Eli Broad College of Business and The Eli Broad Graduate School of Management or approval of department.", "alias": "MSC 355"}, "MKT360": {"name": " Advanced Sales Communication", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Need-based selling and leadership role in meeting client needs. Advanced methods of questioning, customer need analysis, negotiation, effective presentations and interpersonal communication relationships with clients. Sales role-playing presentations, business and technical writing, portfolio presentations, and case studies.", "prerequisite": "MKT 313 and (MKT 300 or MKT 327)", "restrictions": "Open to undergraduate students in the Sales Communication Specialization."}, "MKT383": {"name": " Sales Management", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Planning, implementing, and controlling the firm's personal selling function. Analysis of sales territories. Management of recruitment, selection, training, and motivation of sales personnel. Evaluation of sales performance. Diversity and ethical issues.", "prerequisite": "(MKT 300 or MKT 327) and (MKT 313 or concurrently)", "restrictions": "Open to juniors or seniors in the Eli Broad College of Business and The Eli Broad Graduate School of Management or in the Applied Engineering Sciences Major and open to juniors or seniors in the Sales Leadership Minor or approval of department.", "alias": "MSC 383"}, "MKT393": {"name": " Introduction to International Business", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 3", "description": "Introduction to the context of international business delivered on-site in foreign settings. Fundamental concepts and principles of globalization such as multinational corporations, foreign markets and economies, internal and external market transactions, international law, cultural influences, and multinational business strategies.", "restrictions": "Open to students in the Eli Broad College of Business and The Eli Broad Graduate School of Management or in the School of Hospitality Business."}, "MKT410": {"name": " Product Innovation and Management", "semester": "Fall of every year", "credits": " 3", "description": "Analytic, decision-making, and planning concepts and tools available to product managers. New product policy and development, organizational issues, and product modification and deletion.", "prerequisite": "(MKT 300 or MKT 327) and (MKT 317 or concurrently)", "restrictions": "Open to juniors or seniors in the Eli Broad College of Business and The Eli Broad Graduate School of Management.", "alias": "MSC 410"}, "MKT412": {"name": " Digital Marketing", "semester": "Spring of every year", "credits": " 3", "description": "Theoretical foundation of digital marketing. Recent tactics, applications, and trends in the online marketplace. Basics of online marketing communications, search engine marketing, social media marketing, and web analytics.", "prerequisite": "MKT 300 or MKT 327", "restrictions": "Open to juniors or seniors in the Eli Broad College of Business and The Eli Broad Graduate School of Management.", "alias": "MSC 412"}, "MKT415": {"name": " International Marketing", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Marketing decisions, strategies, and operations of the firm involved in international business. Researching global market opportunities and formulating market entry strategies. Developing and implementing the international marketing program.", "prerequisite": "(MKT 300 or MKT 327) and (MKT 310 or EC 340)", "restrictions": "Open to juniors or seniors in the Eli Broad College of Business and The Eli Broad Graduate School of Management.", "alias": "MSC 415"}, "MKT420": {"name": " New Product Design and Development", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Practical training and experiences in design and testing of new products.", "prerequisite": "(MKT 300 or MKT 327 or ESHP 190) and MKT 317", "restrictions": "Open to seniors in the Eli Broad College of Business and The Eli Broad Graduate School of Management or in the Entrepreneurship and Innovation Minor.", "alias": "MSC 420"}, "MKT430": {"name": " Key Account and Customer Relationship Management", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Development and ongoing management of mutually profitable relationships with targeted customers. Account segmentation and penetration strategies. Principles and mechanics of customer relationship management , including the use of related technology. Consultative selling approaches to major accounts and complex enterprises, including business analysis and quantifiable substantiation of value proposition.", "prerequisite": "MKT 313", "restrictions": "Open to juniors or seniors in the Eli Broad College of Business and The Eli Broad Graduate School of Management and open to juniors or seniors in the Sales Leadership Minor."}, "MKT439": {"name": " Strategic Management for Food and Agribusiness Firms (W)", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Principles and techniques for analyzing and implementing business and strategy. Approaches to identify and manage strategic problems. Application to firms in the food and agribusiness industries. Capstone project.", "prerequisite": "(FIM 220) and (ABM 130 or ABM 435 or FI 320 or ABM 303 or EC 301 or approval of department)", "restrictions": "Open to seniors."}, "MKT460": {"name": " Marketing Strategy (W)", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": " 3", "description": "Identification and analysis of managerial marketing issues. Integration of marketing concepts and theories through case analysis. Ethical and international applications.", "prerequisite": "(MKT 302 and MKT 317 and MKT 319) and completion of Tier I writing requirement", "restrictions": "Open to seniors in the Marketing major.", "alias": "MSC 460"}, "MKT490": {"name": " Independent Study", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 3", "description": "Supervised program of research-based independent study.", "alias": "MSC 490"}, "MKT490H": {"name": " Honors Independent Study", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 3", "description": "Supervised program of independent research in marketing.", "alias": "MSC 490H"}, "MKT491": {"name": " Special Topics in Marketing", "semester": "On Demand", "credits": "Variable from 1 to 3", "description": "Special topics in marketing management or marketing research of unusual scope or timeliness.", "prerequisite": "(MKT 300 or MKT 327) and (MKT 302 and MKT 319)", "restrictions": "Open to juniors or seniors in the Eli Broad College of Business and The Eli Broad Graduate School of Management or approval of department."}, "MKT805": {"name": " Marketing Management", "semester": "Spring of every year", "credits": "Variable from 2 to 3", "description": "Strategic and decision-making aspects of marketing functions. Analysis, coordination, execution of marketing programs. Development of strategies and tactics. Segmentation, marketing mix, market response modeling, and ethics in a global context.", "alias": "MSC 805"}, "MKT806": {"name": " Marketing Research for Decision Making", "semester": "Spring of every year", "credits": "Variable from 1 to 3", "description": "Collection and analysis of marketing research data for marketing decision making. Focuses on marketing research methods for data collection and introductory data analysis.", "prerequisite": "MBA 830 or approval of department", "restrictions": "Open to master's students in the Marketing Research major and open to MBA students in the Eli Broad College of Business and The Eli Broad Graduate School of Management or approval of department.", "alias": "MSC 806"}, "MKT807": {"name": " Consumer Insights", "semester": "Fall of every year", "credits": "Variable from 1 to 3", "description": "Traditional and emerging research tools that organizations use to capture the voice of the customer. Application of behavioral science research in developing deep understanding of customers that can be used in developing marketing strategies, including segmentation, positioning, branding, advertising, customer satisfaction and loyalty.", "prerequisite": "MBA 830 or MKT 805 or approval of department", "restrictions": "Open to master's students in the Marketing Research major and open to MBA students in the Eli Broad College of Business and The Eli Broad Graduate School of Management or approval of department.", "alias": "MSC 807"}, "MKT809": {"name": " Pricing, Profitability and Marketing Metrics", "semester": "Spring of every year", "credits": " 1.5", "description": "Design, management, and integration of pricing into the marketing mix and the revenue yield strategies of the firm. Analytic, empirical and simulation approaches to pricing.", "prerequisite": "MBA 830 or MKT 805", "restrictions": "Open to master's students in the Eli Broad College of Business and The Eli Broad Graduate School of Management or approval of department."}, "MKT810": {"name": " Open Innovation Management", "semester": "Fall of every year", "credits": "Variable from 1 to 3", "description": "Development of new products ideas for service firms and physical good manufacturers using voice of the customer approaches, leveraging ideas from channel partners, and from frontline employees. Fuzzy front end of the innovation process.", "prerequisite": "MKT 805 or MBA 830 or approval of department", "restrictions": "Open to master's students in the Marketing Research major and open to MBA students in the Eli Broad College of Business and The Eli Broad Graduate School of Management or approval of department.", "alias": "MSC 810"}, "MKT811": {"name": " Brand Insights", "semester": "Fall of every year", "credits": " 1.5", "description": "Brand strategy consumer and customer analysis, competitive brand analysis and brand planning.", "prerequisite": "MBA 830", "restrictions": "Open to MBA students in the Eli Broad College of Business and The Eli Broad Graduate School of Management or approval of department.", "alias": "MSC 811"}, "MKT812": {"name": " Integrated Marketing Communication", "semester": "Fall of every year", "credits": " 1.5", "description": "Concepts, frameworks, and leading-edge practices of integrated marketing communications (IMC), including traditional and digital media. Selection of appropriate media for the target audience and developing effective marketing communication campaigns that enhance the value of the brand.", "prerequisite": "MBA 830 or MKT 805", "restrictions": "Open to MBA students in the Eli Broad College of Business and The Eli Broad Graduate School of Management or approval of department."}, "MKT816": {"name": " Marketing Analysis", "semester": "Spring of every year", "credits": "Variable from 1 to 3", "description": "Analysis of marketing data from a variety of sources for decision making. Use of statistical software to analyze marketing data. Scanner data, data mining, and web site metrics and analytics.", "prerequisite": "MKT 806", "restrictions": "Open to master's students in the Marketing Research major and open to MBA students in the Eli Broad College of Business and The Eli Broad Graduate School of Management or approval of department."}, "MKT817": {"name": " Business Development and Sales Management", "semester": "Fall of every year", "credits": "Variable from 1 to 3", "description": "Managing the sales operation of the firm. Planning, implementing, and controlling the personal selling function. Analysis of sales territories. Management of recruitment, selection, training, and motivation of sales personnel. Evaluation of sales performance.", "prerequisite": "MBA 830 or MKT 805 or approval of department", "restrictions": "Open to master's students in the Marketing Research major and open to MBA students in the Eli Broad College of Business and The Eli Broad Graduate School of Management or approval of department."}, "MKT819": {"name": " Predictive Analytics", "semester": "Fall of every year, Spring of every year", "credits": "Variable from 1 to 3", "description": "Advanced quantitative methods for marketing research. Focuses on marketing research for understanding and predicting sales and related marketing variables. Includes multiple regression, logistic regression, time series, and neural network modeling. Emphasis on applications of these techniques using statistical analysis software.", "prerequisite": "MKT 816", "restrictions": "Open to students in the Master of Business Administration in Business Administration or in the Marketing Research major or approval of department."}, "MKT820": {"name": " New Product Development and Portfolio Management", "semester": "Fall of every year", "credits": "Variable from 1 to 3", "description": "New product development processes for service firms and physical good manufacturers. Execution of the product development stages and gates with a focus on concept testing, assessing project risks, and business case development.", "prerequisite": "MKT 810", "restrictions": "Open to master's students in the Marketing Research major and open to MBA students in the Eli Broad College of Business and The Eli Broad Graduate School of Management or approval of department."}, "MKT821": {"name": " Brand Strategy", "semester": "Fall of every year", "credits": " 1.5", "description": "Brand strategy analysis, planning and development.", "prerequisite": "MKT 811", "restrictions": "Open to MBA students in the Eli Broad College of Business and The Eli Broad Graduate School of Management or approval of department."}, "MKT822": {"name": " Applications in Integrated Marketing Communication", "semester": "Fall of every year", "credits": " 1.5", "description": "Applications and experiential learning in integrated marketing communications. Developing and delivering effective and efficient integrated marketing communication strategies and tactics that enhance the value of the brand in a global environment.", "prerequisite": "MKT 812", "restrictions": "Open to MBA students in the Eli Broad College of Business and The Eli Broad Graduate School of Management or approval of department."}, "MKT823": {"name": " Applications in Predictive Analytics", "semester": "Fall of every year", "credits": "Variable from 1 to 3", "description": "Advanced quantitative methods for marketing research. Focuses on marketing research methods for enhancing predictive models in marketing research. Includes multivariate statistical methods such as factor analysis, cluster analysis, multidimensional scaling, conjoint analysis, and other approaches. Emphasis on applications of these techniques using statistical analysis software.", "prerequisite": "MKT 819", "restrictions": "Open to MBA students in the Eli Broad College of Business and The Eli Broad Graduate School of Management or in the Marketing Research major or approval of department."}, "MKT829": {"name": " Digital Marketing", "semester": "Spring of every year, Summer of every year", "credits": "Variable from 1 to 3", "description": "Fundamentals of online marketplace. Analysis of online consumer behavior and corporate digital marketing strategy, including online advertisement, search engine marketing, and social media strategy. Introduction to web analytic tools, online advertising platforms and social media analysis tools.", "prerequisite": "MBA 820 or MKT 805", "restrictions": "Open to graduate students in the Eli Broad College of Business and The Eli Broad Graduate School of Management.", "exclude": "MKT 412"}, "MKT830": {"name": " Seminar in Social Marketing", "semester": "Spring of every year", "credits": " 3", "description": "In-depth reading and critical thinking about theories and principles in social marketing. Application of theory and empirical research to evaluating and planning social marketing programs."}, "MKT839": {"name": " Experiential Learning in Digital Marketing", "semester": "Spring of every year", "credits": "Variable from 1 to 3", "description": "Classroom and field experience in digital marketing with a focus on the development, assessment, and optimization of paid search campaigns. Problem recognition, strategy development, deployment, assessment, revision, client report.", "prerequisite": "MBA 820 or approval of department", "restrictions": "Open to MBA students or approval of department."}, "MKT842": {"name": " International Marketing", "semester": "Fall of every year", "credits": "Variable from 1 to 3", "description": "Influence of culture, time and distance on marketing decisions. How macro-environmental knowledge influences micro-environment decision-making.", "restrictions": "Open to master's students in the Eli Broad College of Business and The Eli Broad Graduate School of Management and not open to MBA students in the Eli Broad College of Business and The Eli Broad Graduate School of Management or approval of department."}, "MKT843": {"name": " International Marketing Research", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 3", "description": "International research from various elements of the marketing research process. Globalization, the research planning process (business problem and research objectives identification), research design. International qualitative/quantitative approaches, analysis, reporting/storytelling, and assessment of various global regions.", "restrictions": "Open to master's students in the Marketing Research major or approval of department."}, "MKT852": {"name": " Global Value Chains", "semester": "Fall of every year", "credits": "Variable from 1 to 3", "description": "Business decision-making related to global supply chains.", "restrictions": "Open to students in the Eli Broad College of Business and The Eli Broad Graduate School of Management and not open to MBA students in the Eli Broad College of Business and The Eli Broad Graduate School of Management or approval of department."}, "MKT854": {"name": " Database Marketing: Analysis for Profitability", "semester": "Spring of every year", "credits": "Variable from 1 to 3", "description": "Profits from marketing databases, strategic issues in database marketing, customer lifetime value, database marketing tools and statistics, customer management, and using databases in managing the marketing mix.", "prerequisite": "MKT 823 or approval of department", "restrictions": "Open to master's students in the Master of Business Administration in Business Administration or in the Marketing Research major."}, "MKT856": {"name": " Consulting Practicum in Marketing", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 6", "description": "Classroom and field experience on business consulting; defining scope of work, engagement management, and preparing deliverables.", "restrictions": "Open to master's students in the Marketing Research major and open to MBA students in the Eli Broad College of Business and The Eli Broad Graduate School of Management or approval of department.", "alias": "MSC 856"}, "MKT859": {"name": " Venture Management Practicum", "semester": "Spring of every year", "credits": " 3", "description": "Application of the principles and tools of market assessment, venture development, and management in venture start up, or venture growth situations. Applications to for profit and not-for-profit or public organizations.", "restrictions": "Open to graduate students in the Eli Broad College of Business and The Eli Broad Graduate School of Management and open to graduate students in the Department of Fisheries and Wildlife.", "alias": "MSC 859"}, "MKT860": {"name": " Understanding and Assessing the Global Business Environment", "semester": "Fall of every year", "credits": "Variable from 1 to 3", "description": "Fundamentals of the international business environment and their impact on a global organization’s operations.", "restrictions": "Open to graduate students in the Eli Broad College of Business and The Eli Broad Graduate School of Management."}, "MKT861": {"name": " Marketing Research Strategy and Analysis", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 6", "description": "Various topics in marketing research", "prerequisite": "(MKT 805 or concurrently) or (MBA 820 or concurrently)", "restrictions": "Open to graduate students in the Eli Broad College of Business and The Eli Broad Graduate School of Management or approval of department.", "alias": "MSC 861"}, "MKT862": {"name": " Global Marketing", "semester": "Fall of every year, Spring of every year", "credits": "Variable from 1 to 3", "description": "Marketing strategies for global market expansion, global marketing planning and marketing program execution.", "prerequisite": "MBA 830 or MKT 805 or approval of department", "restrictions": "Open to graduate students in the Eli Broad College of Business and The Eli Broad Graduate School of Management or approval of department."}, "MKT864": {"name": " Data Mining for Marketing", "semester": "Spring of every year", "credits": "Variable from 1 to 3", "description": "Statistical and computer-based techniques for exploring and understanding very large data arrays in large-scale marketing research projects. Understanding how advanced computer technology, large databases, and statistical methods such as predictive and classification models work together to generate new insights into marketing strategy issues. Emphasis on applications of using statistical analysis software.", "prerequisite": "MKT 854 or approval of department", "restrictions": "Open to students in the Master of Business Administration in Business Administration or in the Marketing Research major or approval of department."}, "MKT865": {"name": " Emerging Topics in Business", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 3", "description": "Perspectives on new and emerging issues of business administration. Topics vary.", "restrictions": "Open to graduate students in the Eli Broad College of Business and The Eli Broad Graduate School of Management or approval of department.", "alias": "MSC 865"}, "MKT867": {"name": " Sampling and Research Design", "semester": "Fall of every year, Spring of every year", "credits": "Variable from 1 to 3", "description": "Experimental design, survey/questionnaire design,sampling, and data collection in marketing.", "restrictions": "Open to master's students in the Marketing Research major or approval of department."}, "MKT870": {"name": " Global Business Strategy", "semester": "Fall of every year", "credits": " 1.5", "description": "Strategic issues in the management of the firm in the global environment. Competitive strategy development and implementation within and across functional areas.", "restrictions": "Open to graduate students in the Eli Broad College of Business and The Eli Broad Graduate School of Management."}, "MKT871": {"name": " New Product and Service Research", "semester": "Fall of every year", "credits": "Variable from 1 to 3", "description": "Innovation and new product development. Explicit focus on techniques for researching new product concepts and driving innovation.", "restrictions": "Open to master's students in the Marketing Research major or approval of department."}, "MKT872": {"name": " Experiential Learning in Global Marketing Management", "semester": "Fall of every year, Spring of every year", "credits": " 1.5", "description": "Classroom and field experience on global marketing planning and export marketing management, management of the marketing programs in global markets, defining the scope of work, and preparing deliverables.", "prerequisite": "MKT 862", "restrictions": "Open to MBA students in the Eli Broad College of Business and The Eli Broad Graduate School of Management or approval of department."}, "MKT890": {"name": " Independent Study", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 3", "description": "Faculty supervised independent study", "restrictions": "Open to master's students in the Eli Broad College of Business and The Eli Broad Graduate School of Management or in the Marketing Research major or approval of department.", "alias": "MSC 890"}, "MKT891": {"name": " Special Topics in Marketing", "semester": "Fall of every year, Spring of every year", "credits": "Variable from 1 to 6", "description": "Special topics in marketing.", "restrictions": "Open to graduate students in the Marketing Research major or approval of department."}, "MKT902": {"name": " Pro-seminar in Marketing", "semester": "Fall of every year", "credits": "Variable from 1 to 3", "description": "Presentation of research, evaluation of research, and professional research standards.", "restrictions": "Open to doctoral students in the Eli Broad College of Business and The Eli Broad Graduate School of Management.", "alias": "MSC 902"}, "MKT905": {"name": " Research Design in Marketing", "semester": "Fall of odd years", "credits": " 3", "description": "Research concepts and scientific methods for the study of marketing. Formulation of hypotheses, concepts of measurement, and quantitative methods.", "prerequisite": "MGT 906 and MGT 914", "restrictions": "Open to doctoral students in the Department of Marketing.", "alias": "MSC 905"}, "MKT907": {"name": " Statistical Models in Marketing", "semester": "Fall of every year", "credits": " 3", "description": "Advanced statistical methods in marketing. Structural equations modeling, agent based models, and panel design methods. Sources and uses of secondary data.", "restrictions": "Open to doctoral students in the Eli Broad College of Business and The Eli Broad Graduate School of Management and open to doctoral students in the College of Communication Arts and Sciences or approval of department; application required.", "alias": "MSC 907"}, "MKT908": {"name": " Marketing Analytic Decision Models", "semester": "Fall of every year", "credits": " 3", "description": "Applications of marketing decision models in new product development, pricing, distribution, advertising, and sales promotion.", "restrictions": "Open to doctoral students in the Eli Broad College of Business and The Eli Broad Graduate School of Management or approval of department; application required.", "alias": "MSC 908"}, "MKT910": {"name": " Marketing Theory and Critical Analysis", "semester": "Fall of every year", "credits": " 3", "description": "Marketing thought in the evolution of marketing. Special emphasis on philosophy of science. Critical examination of historical concepts and theories in marketing.", "restrictions": "Open to doctoral students in the Eli Broad College of Business and The Eli Broad Graduate School of Management or approval of department; application required.", "alias": "MSC 910"}, "MKT911": {"name": " Seminar in Marketing Strategy", "semester": "Fall of odd years", "credits": " 3", "description": "Strategic marketing and planning. How marketing concepts, tools, and processes can be used to help an organization develop a sustainable competitive advantage through the creation of superior customer value.", "restrictions": "Open to doctoral students in the Eli Broad College of Business and The Eli Broad Graduate School of Management or approval of department; application required.", "alias": "MSC 911"}, "MKT912": {"name": " Seminar in Buyer Behavior", "semester": "Spring of even years", "credits": " 3", "description": "Organizational and consumer behavior and their relationship to marketing strategy. Attitudes, information processing, decision making, and attribution theory. Methodological tools appropriate for analyzing buyer behavior such as conjoint analysis.", "restrictions": "Open to doctoral students in the Eli Broad College of Business and The Eli Broad Graduate School of Management or approval of department; application required.", "alias": "MSC 912"}, "MKT913": {"name": " Seminar in Marketing Relationships", "semester": "Spring of even years", "credits": " 3", "description": "Interorganizational issues in marketing. Theoretical perspectives on marketing strategy issues from a micro competitive perspective. Integration of existing theories.", "prerequisite": "MKT 908 and MKT 911", "restrictions": "Open to doctoral students in the Eli Broad College of Business and The Eli Broad Graduate School of Management or approval of department.", "alias": "MSC 913"}, "MKT940": {"name": " International Business Theory and Literature", "semester": "Fall of even years", "credits": " 3", "description": "Theories explaining international business phenomena. Varying perspectives on international business activities, concepts, and frameworks. Survey of the extensive literature in the field.", "restrictions": "Open to doctoral students in the Eli Broad College of Business and The Eli Broad Graduate School of Management or approval of department; application required.", "alias": "MSC 940"}, "MKT990": {"name": " Independent Study", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 6", "description": "Intensive reading and research on topic of mutual interest to PhD student and faculty collaborator.", "restrictions": "Open to doctoral students. Approval of department; application required.", "alias": "MSC 990"}, "MKT995": {"name": " Directed Research Paper", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": " 1", "description": "Production of research paper under the direction of a senior faculty member.", "restrictions": "Open to doctoral students in the Department of Marketing. Approval of department; application required.", "alias": "MSC 995"}, "MKT999": {"name": " Doctoral Dissertation Research", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 9", "description": "Doctoral dissertation research.", "alias": "MSC 999"}}}