{"code": "MMG", "name": "Microbiology and Molecular Genetics", "courses": {"MMG141": {"name": " Introductory Human Genetics", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Inheritance of human traits. Impact of genetic technology on society. Ethical and legal issues. Risks and benefits of genetic technology.", "restrictions": "Not open to students in the Biochemistry and Molecular Biology major or in the Biological Science Major or in the Biomedical Laboratory Science Major or in the Clinical Laboratory Sciences Major or in the Environmental Biology/Microbiology Major or in the Environmental Biology/Plant Biology Major or in the Environmental Biology/Zoology Major or in the Genomics and Molecular Genetics Major or in the Human Biology Major or in the Microbiology Major or in the Neuroscience Major or in the Physiology Major or in the Plant Biology Major or in the Zoology Major and not open to students in the Lyman Briggs Biochemistry and Molecular Biology Coordinate Major or in the Lyman Briggs Biological Science-Interdepartmental Coordinate Major or in the Lyman Briggs Biomedical Laboratory Science Coordinate Major or in the Lyman Briggs Environmental Biology/Plant Biology Coordinate Major or in the Lyman Briggs Environmental/Biology/Microbiology Coordinate Major or in the Lyman Briggs Environmental Biology/Zoology Coordinate Major or in the Lyman Briggs Genomics and Molecular Genetics Coordinate Major or in the Lyman Briggs Human Biology Coordinate Major or in the Lyman Briggs Neuroscience Major or in the Lyman Briggs Microbiology Coordinate Major.", "alias": "ZOL 141", "exclude": "IBIO 341"}, "MMG161": {"name": " Cell and Molecular Biology", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": " 3", "description": "Macromolecular synthesis. Energy metabolism. Molecular aspects of development. Molecular genetics.", "prerequisite": "(CEM 141 or concurrently) or (CEM 151 or concurrently) or (LB 171 or concurrently) or (CEM 181H or concurrently)", "alias": "BS 111, BS 149H", "exclude": "BS 181H or LB 145"}, "MMG171": {"name": " Cell and Molecular Biology Laboratory", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": " 2", "description": "Principles and applications of common techniques used in cell and molecular biology.", "prerequisite": "(BS 161 or concurrently) or (BS 181H or concurrently)", "alias": "BS 111L, BS 159H", "exclude": "BS 191H or LB 145"}, "MMG181H": {"name": " Honors Cell and Molecular Biology", "semester": "Spring of every year", "credits": " 3", "description": "Physicochemical and molecular organization of cells as the unifying framework for genetics, evolution, and the social relevance of biology.", "prerequisite": "(CEM 141 or concurrently) or (CEM 151 or concurrently) or (CEM 181H or concurrently) or (LB 171 or concurrently)", "alias": "BS 149H, BS 111", "exclude": "LB 145"}, "MMG191H": {"name": " Honors Cell and Molecular Biology Laboratory", "semester": "Spring of every year", "credits": " 2", "description": "Basic techniques of cellular and molecular biology including experimental design and hypothesis formulation; biochemistry, molecular biology and genetics.", "prerequisite": "BS 181H or concurrently", "alias": "BS 159H", "exclude": "LB 145"}, "MMG201": {"name": " Fundamentals of Microbiology", "semester": "Spring of every year", "credits": " 3", "description": "Microbial structure, function, growth, control, and diversity. Role of microbes in health, industry, and the environment.", "alias": "MMG 105, MMG 205"}, "MMG301": {"name": " Introductory Microbiology", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Fundamentals of microbiology, including microbial structure and function, nutrition and growth, death and control. Importance and applications of major microbial groups.", "prerequisite": "(BS 161 or LB 145 or BS 181H) and ((CEM 251 or concurrently) or (CEM 351 or concurrently) or (CEM 143 or concurrently))", "alias": "MIC 301"}, "MMG302": {"name": " Introductory Laboratory for General and Allied Health Microbiology", "semester": "Spring of every year", "credits": " 1", "description": "Methodology of microbiology. Microscopy, staining, aseptic technique, media, quantification, diagnostics, and laboratory safety.", "prerequisite": "(MMG 201 or concurrently) or (MMG 301 or concurrently)", "alias": "MIC 302"}, "MMG365": {"name": " Medical Microbiology", "semester": "Spring of every year", "credits": " 3", "description": "Laboratory diagnosis, disease and epidemiology of the most common bacterial, viral, fungal and parasitic pathogens and concepts in infectious disease control, prevention and treatment.", "prerequisite": "(BS 161 and CEM 141) and (MMG 201 or MMG 301)", "exclude": "MMG 463"}, "MMG365L": {"name": " Medical Microbiology Laboratory", "semester": "Spring of every year", "credits": " 1", "description": "Practical experience in safely and accurately performing standard clinical microbiology tests to diagnose disease-causing microbes.", "prerequisite": "(MMG 365 or concurrently) and (MMG 201 or MMG 301)", "exclude": "MMG 464"}, "MMG400": {"name": " Introduction to Bioinformatics", "semester": "Fall of even years", "credits": " 3", "description": "Managing and analyzing biological data with bioinformatic tools, basic programming, and statistics.", "prerequisite": "(STT 200 or STT 201 or STT 231 or STT 421) and (PLB 203 or MMG 201 or BMB 200 or BS 161)"}, "MMG404": {"name": " Human Genetics", "semester": "Fall of every year", "credits": " 3", "description": "Inheritance of human traits. Medical, molecular, physiological and forensic applications. Biochemical, clinical, and molecular genetics of human disease. Prenatal, pre-symptomatic, and clinical diagnosis. Ethical, legal and social considerations.", "prerequisite": "IBIO 341", "alias": "ZOL 344, ZOL 404"}, "MMG408": {"name": " Advanced Microbiology Laboratory (W)", "semester": "Fall of every year", "credits": " 3", "description": "Microbiological techniques and procedures to study physiology and genetics of bacteria and bacteriophages. Collection and critical assessment of quantitative data and written communication of results.", "prerequisite": "(MMG 302 and (MMG 431 or concurrently)) and completion of Tier I writing requirement", "restrictions": "Open to students in the Department of Microbiology and Molecular Genetics or in the Genetics Major or in the Environmental Biology/Microbiology Major or in the Microbiology Major.", "alias": "MPH 408"}, "MMG409": {"name": " Eukaryotic Cell Biology", "semester": "Spring of every year", "credits": " 3", "description": "Structure and function of nucleated cells. Emphasis on the molecular mechanisms that underlie cell processes.", "prerequisite": "(BS 161 or LB 145 or BS 181H) and ((BMB 401 or concurrently) or (BMB 462 or concurrently))", "alias": "MIC 403, MPH 403"}, "MMG410": {"name": " Bioinformatics and Computational Biology", "semester": "Spring of every year", "credits": " 3", "description": "Computational approaches in modern biology with a focus on applications in genomics, systems biology, evolution, and structural biology.", "prerequisite": "{(CMSE 201 and LB 144 and LB 145) or (CMSE 201 and BS 161 and BS 162) or (CMSE 201 and BS 181H and BS 182H)} and (STT 200 or STT 201 or STT 231 or STT 421 or STT 351 or ECE 280)", "exclude": "CSE 415"}, "MMG411": {"name": " Computational Medicine", "semester": "Fall of odd years", "credits": " 3", "description": "Computational approaches in biology with a focus on medicine.", "prerequisite": "(CMSE 201 and LB 144 and LB 145) or (CMSE 201 and BS 161 and BS 162) or (CMSE 201 and BS 181H and BS 182H)"}, "MMG413": {"name": " Virology", "semester": "Spring of every year", "credits": " 3", "description": "Viruses and modern molecular biology. Viral replication and gene expression of the major classes of viruses. Virus-cell interactions and viral diseases.", "prerequisite": "(BMB 462 or concurrently) or BMB 401"}, "MMG421": {"name": " Prokaryotic Cell Physiology", "semester": "Fall of every year", "credits": " 3", "description": "Prokaryotic cell structure and function. Growth and replication. Macromolecular synthesis and control.", "prerequisite": "(MMG 301 and (BMB 461 or concurrently)) or (MMG 301 and (BMB 401 or concurrently))", "alias": "MIC 401, MPH 401"}, "MMG425": {"name": " Microbial Ecology", "semester": "Spring of every year", "credits": " 3", "description": "Microbial population and community interactions. Microbial activities in natural systems, including associations with plants or animals.", "alias": "MPH 425"}, "MMG431": {"name": " Microbial Genetics", "semester": "Fall of every year", "credits": " 3", "description": "Genetics of bacteria, their viruses, plasmids, and transposons. Emphasis on genetic principles.", "prerequisite": "(BMB 461 or concurrently) or (BMB 401 or concurrently)", "alias": "MIC 401, MPH 401"}, "MMG433": {"name": " Microbial Genomics", "semester": "Spring of every year", "credits": " 3", "description": "Structure of microbial genomes and implications for growth and evolution of bacteria and fungi. Computer analysis of genome sequence databases. Applications to gene expression and phylogenetic analysis.", "prerequisite": "(MMG 431)"}, "MMG434": {"name": " Laboratory in Genomics and Molecular Genetics (W)", "semester": "Spring of every year", "credits": " 4", "description": "Genomics and molecular genetic techniques using microbes. Collection and critical assessment of quantitative data and written communication of results.", "prerequisite": "(MMG 301 and (MMG 433 or concurrently)) and completion of Tier I writing requirement", "restrictions": "Open to students in the Genomics and Molecular Genetics Major or in the Lyman Briggs Genomics and Molecular Genetics Coordinate Major."}, "MMG435": {"name": " Geomicrobiology", "semester": "Spring of every year", "credits": " 4", "description": "Geological and microbiological perspectives on microbial activities in diverse environmental settings, including geological change mediated by microorganisms, microbial evolution driven by geologically diverse habitats.", "restrictions": "Open to juniors or seniors or graduate students in the College of Natural Science or in the Lyman Briggs College."}, "MMG440": {"name": " Food Microbiology", "semester": "Fall of every year", "credits": " 3", "description": "Major groups of microorganisms of importance to the food industry. Ecological, physiological, and public health aspects.", "prerequisite": "(MMG 201 or MMG 301) and completion of Tier I writing requirement.", "restrictions": "Not open to freshmen."}, "MMG441": {"name": " Food Microbiology Laboratory", "semester": "Fall of every year", "credits": " 2", "description": "Methods for studying major groups of microorganisms important to the food industry. Isolation, enumeration, characterization, identification, and use of microorganisms.", "prerequisite": "(FSC 440 or concurrently) and completion of Tier I writing requirement", "alias": "MPH 441"}, "MMG445": {"name": " Microbial Biotechnology (W)", "semester": "Fall of every year, Summer of every year", "credits": " 3", "description": "Applications of microbial products and processes in areas such as biopharmaceuticals, bioremediation, biocatalysis and other green chemistries.", "prerequisite": "(MMG 301 or BMB 461 or BMB 401) and completion of Tier I writing requirement", "alias": "MIC 445"}, "MMG451": {"name": " Immunology", "semester": "Fall of every year", "credits": " 3", "description": "Structure and function of molecules involved in immune responses. Quantification of immune responses and cellular participants. Immunologic abnormalities. Immunotherapy. Experimental approaches to dissection of immune functions.", "prerequisite": "(BS 161 or LB 145 or BS 181H) and ((BMB 401 or concurrently) or (BMB 461 or concurrently))", "exclude": "BLD 434"}, "MMG461": {"name": " Molecular Pathogenesis", "semester": "Spring of even years", "credits": " 3", "description": "Molecular basis of microbial virulence. Nature of determinants and their role in overcoming host defense mechanisms.", "prerequisite": "(MMG 301)", "alias": "MPH 461"}, "MMG465": {"name": " Advanced Medical Microbiology", "semester": "Fall of every year", "credits": " 3", "description": "Advanced laboratory diagnosis, epidemiology, and prevention of infectious diseases using an anatomical system specimen approach to study a comprehensive set of human pathogens and microbiota.", "prerequisite": "MMG 365", "exclude": "MMG 463"}, "MMG465L": {"name": " Advanced Medical Microbiology Laboratory", "semester": "Fall of every year", "credits": " 2", "description": "Practical experience in safely and accurately performing standard clinical microbiology tests to process clinical specimens, identify pathogens and perform and interpret susceptibility testing.", "prerequisite": "MMG 365L and (MMG 465 or concurrently)", "exclude": "MMG 464"}, "MMG490": {"name": " Special Problems in Microbiology", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 3", "description": "Library research or tutorial instruction in advanced laboratory techniques.", "restrictions": "Approval of department."}, "MMG491": {"name": " Current Topics in Microbiology and Molecular Genetics", "semester": "Spring of every year", "credits": " 3", "description": "Capstone experience for microbiology majors. Presentation and discussion of journal articles. Writing of position papers. Topics such as microbial physiology, ecology, genetics, molecular biology, virology, immunology, or pathogenesis.", "restrictions": "Open to seniors in the Lyman Briggs College or in the Department of Microbiology and Molecular Genetics or in the Lyman Briggs Genomics and Molecular Genetics Coordinate Major.", "alias": "MIC 491"}, "MMG492": {"name": " Undergraduate Research Seminar", "semester": "Spring of every year", "credits": " 1", "description": "Presentation and group discussion of undergraduate research results.", "prerequisite": "MMG 499 or MMG 499H", "restrictions": "Open to students in the Department of Microbiology and Molecular Genetics or in the Lyman Briggs Genomics and Molecular Genetics Coordinate Major.", "alias": "MIC 492"}, "MMG499": {"name": " Undergraduate Research", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 3", "description": "Participation in a laboratory research project.", "restrictions": "Open to students in the Department of Microbiology and Molecular Genetics or in the Lyman Briggs Environmental/Biology/Microbiology Coordinate Major or in the Lyman Briggs Genomics and Molecular Genetics Coordinate Major or in the Lyman Briggs Microbiology Coordinate Major.", "alias": "MIC 499"}, "MMG499H": {"name": " Honors Research", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 3", "description": "Research project with thesis and oral report. A portion of Microbiology or Genomics and Molecular Genetics capstone experience.", "restrictions": "Open to students in the Department of Microbiology and Molecular Genetics or in the Lyman Briggs Environmental/Biology/Microbiology Coordinate Major or in the Lyman Briggs Genomics and Molecular Genetics Coordinate Major or in the Lyman Briggs Microbiology Coordinate Major.", "alias": "MIC 499H"}, "MMG522": {"name": " Medical Microbiology and Immunology", "semester": "Spring of every year", "credits": " 5", "description": "Basic principles of microbiology (bacteriology, virology, mycology and parasitology) and immunology and their relation to disease in humans.", "restrictions": "Open to graduate-professional students in the College of Osteopathic Medicine or in the College of Human Medicine."}, "MMG531": {"name": " Medical Immunology", "semester": "Fall of every year", "credits": " 2", "description": "Basic principles of immunology. Overview of concepts and terminology in relation to human disease defenses.", "restrictions": "Open to graduate-professional students in the College of Osteopathic Medicine."}, "MMG532": {"name": " Medical Microbiology", "semester": "Fall of every year", "credits": " 2", "description": "Basic principles of microbiology including bacteriology, virology, mycology, and parasitology and their relationship to disease in humans.", "restrictions": "Open to graduate-professional students in the College of Osteopathic Medicine."}, "MMG539": {"name": " Principles of Cell Biology and Pathophysiology", "semester": "Fall of every year", "credits": " 4", "description": "Modern concepts of human cell biology as a basis for understanding integration of structure (histology) and function (physiology) in health and disease (pathology). Introduction to adaptive growth response, cell injury, inflammation, hemodynamic disorders, and tissue repair.", "restrictions": "Open to graduate-professional students in the College of Osteopathic Medicine."}, "MMG559": {"name": " Veterinary Microbiology and Immunology", "semester": "Fall of every year", "credits": " 4", "description": "Medically important properties of veterinary pathogens. Principles of positive and negative host response.", "restrictions": "Open to graduate-professional students in the College of Veterinary Medicine.", "alias": "MMG 561, MMG 567, MMG 569"}, "MMG563": {"name": " Veterinary Pathogenic Microbiology: Bacteria and Fungi", "semester": "Fall of every year", "credits": " 3", "description": "Etiology, pathogenesis, transmission, pathogenicity, host response, therapy, and control of bacterial and fungal diseases of animals.", "restrictions": "Open to graduate-professional students in the College of Veterinary Medicine.", "alias": "MMG 567"}, "MMG565": {"name": " Veterinary Pathogenic Microbiology: Viruses", "semester": "Spring of every year", "credits": " 2", "description": "Etiology, pathogenesis, pathogenicity, transmission, diagnosis, host response, therapy, and control of selected viral diseases of animals.", "restrictions": "Open to graduate-professional students in the College of Veterinary Medicine.", "alias": "MMG 569"}, "MMG571": {"name": " Veterinary Pathogenic Microbiology: Parasites", "semester": "Spring of every year", "credits": " 3", "description": "Etiology, pathogenesis, transmission, pathogenicity, diagnosis, host response, therapy, and control of selected parasitic diseases of animals.", "restrictions": "Open to graduate-professional students in the College of Veterinary Medicine.", "alias": "MMG 569"}, "MMG660": {"name": " Veterinary Clinical Bacteriology Clerkship", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": " 3", "description": "Guided clinical bacteriology experience."}, "MMG662": {"name": " Clinical Veterinary Virology Clerkship", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": " 3", "description": "Guided clinical virology experience."}, "MMG664": {"name": " Veterinary Clinical Parasitology Clerkship", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": " 3", "description": "Guided clinical parasitology experience."}, "MMG690": {"name": " Veterinary Microbiology Clerkship", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 6", "description": "Laboratory-based investigation of microbiological problems pertinent to veterinary medicine.", "alias": "MPH 690"}, "MMG801": {"name": " Integrative Microbial Biology", "semester": "Fall of every year", "credits": " 4", "description": "Structural, metabolic, phylogenetic, and genomic diversity of microbes and microbial communities. Microbial ecology, evolution, and behavior. Regulation of gene expression. Microbial interactions with other microbes, animals, or plants", "exclude": "MMG 821 or MMG 829 or MMG 841 or MMG 827"}, "MMG803": {"name": " Topics in Integrative Microbial Biology", "semester": "Fall of every year, Spring of every year", "credits": " 2", "description": "In-depth study of a particular topic from integrative microbial biology.", "prerequisite": "MMG 801 or concurrently"}, "MMG810": {"name": " Theories and Practices in Bioinformatics", "semester": "Fall of even years", "credits": " 3", "description": "Theories and algorithms behind bioinformatics tools. Basic tool development by writing scripts in the Python programming language for data analysis."}, "MMG813": {"name": " Molecular Virology", "semester": "Spring of even years", "credits": " 3", "description": "Molecular nature and biochemistry of replication of animal viruses. Current advances, research concepts, and the role of viruses in molecular biology research.", "restrictions": "Open only to graduate students in the Colleges of Human Medicine, Osteopathic Medicine, Veterinary Medicine, Natural Science, and Agriculture and Natural Resources.", "alias": "MPH 813"}, "MMG825": {"name": " Cell Structure and Function", "semester": "Spring of every year", "credits": " 3", "description": "Molecular basis of structure and function. Cell properties", "alias": "BCH 825"}, "MMG833": {"name": " Microbial Genetics", "semester": "Fall of every year", "credits": " 3", "description": "Gene structure and function. Genetic regulation at classical and molecular levels in prokaryotes and lower eukaryotes.", "restrictions": "Open only to graduate students in the Colleges of Human Medicine, Osteopathic Medicine, Veterinary Medicine, Natural Science, and Agriculture and Natural Resources.", "alias": "MPH 833"}, "MMG835": {"name": " Eukaryotic Molecular Genetics", "semester": "Spring of every year", "credits": " 3", "description": "Gene structure and function in animals, plants, and fungi. Basic aspects of modern human genetics and the genetic basis for disease. Molecular genetic analyses. Eukaryotic modeling systems.", "restrictions": "Open only to graduate students in the colleges of Agriculture and Natural Resources, Engineering, Human Medicine, Natural Science, Osteopathic Medicine, and Veterinary Medicine."}, "MMG845": {"name": " Multi-disciplinary Research Methods for the Study of Evolution", "semester": "Spring of every year", "credits": " 3", "description": "Techniques for engaging in multi-disciplinary research collaborations, including biology, computer science, and engineering. Students engage in group projects to answer fundamental questions about the dynamics of actively evolving systems including both natural and computational. Multi-disciplinary teams will learn to overcome discipline-specific language and conceptual issues. Experimental design, statistical analysis, data visualization, and paper and grant writing for multi-disciplinary audiences."}, "MMG851": {"name": " Immunology", "semester": "Fall of odd years", "credits": " 3", "description": "Functional aspects of immune responses; synthesis, structure, and function of effector molecules; cell-cell interactions; current advances and research techniques.", "restrictions": "Open only to graduate students in the Colleges of Human Medicine, Osteopathic Medicine, Veterinary Medicine, Natural Science, and Agriculture and Natural Resources.", "alias": "MPH 851"}, "MMG855": {"name": " Molecular Evolution: Principles and Techniques", "semester": "Fall of odd years", "credits": " 3", "description": "Current techniques used to characterize and compare genes and genomes. Genetic variation, assays of variation. Data analysis and computer use to conduct a phylogenetic analysis to compare organisms and infer relationships.", "alias": "ZOL 855"}, "MMG861": {"name": " Advanced Microbial Pathogenesis", "semester": "Spring of odd years", "credits": " 3", "description": "Molecular basis of microbial virulence. Virulence factors of microorganisms and the relationship of these factors to disease; host-pathogen interactions."}, "MMG890": {"name": " Special Problems in Microbiology", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 6", "description": "Individualized laboratory or library research.", "restrictions": "Open to master's students in the Department of Microbiology and Molecular Genetics.", "alias": "MIC 890"}, "MMG892": {"name": " Seminar", "semester": "Fall of every year, Spring of every year", "credits": " 1", "description": "Student review and presentation of selected topics in microbiology and public health.", "restrictions": "Open only to graduate students in the College of Agriculture and Natural Resources or College of Engineering or College of Human Medicine or College of Natural Science or College of Osteopathic Medicine or College of Veterinary Medicine.", "alias": "MPH 892"}, "MMG899": {"name": " Master's Thesis Research", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 12", "description": "Master's thesis research.", "restrictions": "Open only to graduate students in the Department of Microbiology and Molecular Genetics.", "alias": "MPH 899"}, "MMG991": {"name": " Topics in Microbiology", "semester": "Fall of every year, Spring of every year", "credits": "Variable from 1 to 3", "description": "Topics are selected from traditional subdisciplines such as bacteriology, virology, cell biology, and immunology or from transecting subdisciplines such as microbial genetics, physiology, molecular biology and ecology.", "alias": "MPH 991"}, "MMG999": {"name": " Doctoral Dissertation Research (Interim Change)", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 24", "description": "Doctoral dissertation research.", "restrictions": "Open to graduate students in the Genetics Major or in the Microbiology and Molecular Genetics Major."}}}