{"code": "MS", "name": "Military Science", "courses": {"MS110": {"name": " Army Leadership and Officer Development", "semester": "Fall of every year", "credits": "Variable from 1 to 2", "description": "Duties and responsibilities of the Army officer and noncommissioned officer. Organizational structure of the Army, Army Reserve, and National Guard. The Army's role in joint operations. Introduction to Army values, leadership, customs, and traditions.", "alias": "MS 101, MS 101A"}, "MS120": {"name": " Introduction to Army Leadership and Problem Solving", "semester": "Spring of every year", "credits": "Variable from 1 to 2", "description": "Fundamentals of basic Army leadership. Military problem solving process. Military briefing and writing skills. Goal setting and time management. Introduction to the Army's developmental counseling program."}, "MS210": {"name": " Values and Ethics of Army Leaders", "semester": "Fall of every year", "credits": "Variable from 2 to 3", "description": "Application of military case studies. Critical dilemmas in combat situations and the ethical decisions Army leaders make to ensure mission success. Understanding how to improve Army organizations and soldier performance. Introduction to the Army's leadership development program, battle drills, land navigation, and combat decision making.", "alias": "MS 201, MS 201A"}, "MS220": {"name": " Army Doctrine and Team Development", "semester": "Spring of every year", "credits": "Variable from 2 to 3", "description": "Application of Army doctrine to field-based leadership decisions. Army values, teamwork, and warrior ethos in relationship to the law of land warfare and philosophy of military service. Investigation of leading and following using case studies and exercises in small units up to squad-level.", "alias": "MS 202A, MS 202B"}, "MS310": {"name": " Leading and Problem Solving in Army Units", "semester": "Fall of every year", "credits": "Variable from 3 to 4", "description": "Planning and executing military activities in small Army units. Recognizing and analyzing problems in challenging situations. Implementing the skills required to communicate decisions and supervise subordinates. Applying fundamentals of map reading and land navigation.", "alias": "MS 301"}, "MS320": {"name": " Army Small Unit Tactics and Leadership", "semester": "Spring of every year", "credits": "Variable from 3 to 4", "description": "Fundamentals of military tactics and battle drills. Applying troop leading procedures to military tactical operations. Implementing tactical skills and making decisions to lead small Army units on the battlefield. Integrate terrain analysis into military planning and operations.", "alias": "MS 302"}, "MS410": {"name": " Adaptive Army Leadership", "semester": "Fall of every year", "credits": "Variable from 3 to 4", "description": "Application of military case studies. Skills and attributes military leaders use to make decisions in combat situations. Practical exercises in problem solving and crisis counseling. Fundamentals of Army Training Management, the military justice system, and the law of land warfare.", "alias": "MS 401"}, "MS420": {"name": " Army Leadership in a Complex World", "semester": "Spring of every year", "credits": "Variable from 3 to 4", "description": "Application of military case studies to the principles of the law of land warfare, and rules of engagement in the face of international terrorism. Importance of ethics in military leadership. Integration of the media into military operations. Evaluation of interaction with non-governmental organizations, civilians, and host nation support on the battlefield.", "alias": "MS 402"}, "MS490": {"name": " Independent Study in Military Science", "semester": "Fall of every year, Spring of every year", "credits": "Variable from 1 to 4", "description": "Individual research in areas related to military science.", "restrictions": "Open to juniors or seniors. Approval of department."}}}