{"code": "MSE", "name": "Materials Science and Engineering", "courses": {"MSE200": {"name": " Materials and Society", "semester": "Fall of every year", "credits": " 2", "description": "Material capabilities, limitations, and their utilization in the service and advancement of society. Role of materials in our day-to-day lives. Resource and environmental concerns including current material-related issues."}, "MSE250": {"name": " Materials Science and Engineering", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": " 3", "description": "Structure of metals, ceramics and polymers. Phase diagrams, thermomechanical treatments, physical and mechanical properties, diffusion, microstructure studies, environmental effects.", "prerequisite": "CEM 141 or CEM 151 or LB 171", "alias": "MSM 250"}, "MSE260": {"name": " Electronic, Magnetic, Thermal, and Optical Properties of Materials", "semester": "Spring of every year", "credits": " 3", "description": "Processing, structures, and properties of ceramics, polymers, and composites. Electrical, thermal, magnetic and optical properties of materials. Materials selection and design.", "prerequisite": "(MSE 250) and ((PHY 184 or concurrently) or (PHY 184B or concurrently) or (PHY 294H or concurrently) or (LB 274 or concurrently))", "alias": "MSE 350"}, "MSE310": {"name": " Phase Equilibria in Materials", "semester": "Fall of every year", "credits": " 3", "description": "Enthalpy. Entropy. Free energy. Phase changes in metal, ceramic, and polymer materials systems. Application to alloying, phase diagram determination, and electrochemistry.", "prerequisite": "(MSE 250) and ((MTH 234 or concurrently) or (MTH 254H or concurrently) or (LB 220 or concurrently))", "restrictions": "Open to juniors or seniors in the Materials Science and Engineering Major or in the Materials Science and Engineering Minor.", "alias": "MSE 351"}, "MSE320": {"name": " Mechanical Properties of Materials", "semester": "Fall of every year", "credits": " 3", "description": "Mechanical behavior of metals, ceramics, and polymers. Three-dimensional stress-states. Stress, strain, and compliance tensors. Test methods. Elastic, viscoelastic, and plastic deformation. Fracture, fatigue, and creep.", "prerequisite": "(ME 222 or concurrently) and MSE 250", "restrictions": "Open to juniors or seniors in the Materials Science and Engineering Major or in the Materials Science and Engineering Minor.", "alias": "MSE 355"}, "MSE331": {"name": " Materials Characterization Methods I", "semester": "Fall of every year", "credits": " 2", "description": "Thermal analysis, microindentation techniques, quantitative optical microscopy, effects of alloying on creep deformation, slip systems in ionic crystals, viscoelastic of solids, and polymer rheology.", "prerequisite": "MSE 310 or concurrently", "restrictions": "Open to juniors or seniors in the Materials Science and Engineering Major.", "alias": "MSE 375"}, "MSE360": {"name": " Fundamentals of Microstructural Design", "semester": "Spring of every year", "credits": " 3", "description": "Fick’s laws of diffusion. Models of solid state diffusion. Arrhenius plots. Use of non-equilibrium energy storage from solidification, phase changes, and deformation to predict and control microstructural changes and stability during processing in metal, ceramic, and polymer systems.", "prerequisite": "ME 201 or MSE 310 or CHE 321 or PHY 215", "restrictions": "Open to juniors or seniors in the Department of Chemical Engineering and Materials Science or in the Materials Science and Engineering Minor.", "alias": "MSE 352"}, "MSE370": {"name": " Synthesis and Processing of Materials", "semester": "Spring of every year", "credits": " 3", "description": "Chemical and physical processing of materials. Powder synthesis and processing, consolidation, casting, microdevice fabrication and surface treatments, corrosion mitigation", "prerequisite": "(ME 201 or PHY 215 or MSE 310 or CHE 321) and MSE 250", "restrictions": "Open to juniors or seniors in the Department of Chemical Engineering and Materials Science or in the Materials Science and Engineering Minor.", "alias": "MSE 365, MSE 380"}, "MSE381": {"name": " Materials Characterization Methods II", "semester": "Spring of every year", "credits": " 2", "description": "Characterization of materials by electron microscopy, X-ray diffraction and fluorescence spectroscopy. Fractography, surface analysis, dynamic mechanical analysis, electrical and thermal property measurements.", "prerequisite": "(MSE 260 or concurrently) and (MSE 360 or concurrently) and (MSE 370 or concurrently)", "restrictions": "Open to juniors or seniors in the Materials Science and Engineering Major."}, "MSE410": {"name": " Materials Foundations for Energy Applications", "semester": "Fall of every year", "credits": " 3", "description": "Survey of materials that enable new energy generation, storage, and distribution technologies; thermoelectric materials, electrochemistry of batteries, semiconductors for solar cells, radiation tolerant materials, processing of biobased fuels, greenhouse gas mitigation approaches", "restrictions": "Open to seniors in the Department of Chemical Engineering and Materials Science or in the Materials Science and Engineering Minor or approval of department."}, "MSE425": {"name": " Biomaterials and Biocompatibility", "semester": "Fall of every year", "credits": " 3", "description": "Materials science of human implants. Design requirements imposed by the human body, and need for bodily protection.", "prerequisite": "MSE 250", "restrictions": "Open to juniors or seniors in the College of Engineering.", "alias": "BME 424, MSE 324"}, "MSE426": {"name": " Introduction to Composite Materials", "semester": "Spring of every year", "credits": " 3", "description": "Constituents and interfacial bonding. Manufacturing techniques. Microstructure and micromechanics. Theory of anisotropy. Classical laminate theory. Material characterization. Failure and damage. Composite structure design.", "prerequisite": "ME 222", "restrictions": "Open to juniors or seniors in the College of Engineering.", "alias": "MSM 444"}, "MSE460": {"name": " Electronic Structure and Bonding in Materials and Devices", "semester": "Spring of every year", "credits": " 3", "description": "Relationship between quantum mechanics and material properties. Free electron theory. Energy bands, semiconductors. Dielectrics and ferroelectrics. Dia-, para-, ferro-, and antiferro-magnetism. Superconductivity. Thermal properties.", "prerequisite": "MSE 260", "restrictions": "Open to seniors or juniors in the Department of Chemical Engineering and Materials Science or in the Materials Science and Engineering Minor."}, "MSE465": {"name": " Design and Application of Engineering Materials", "semester": "Spring of every year", "credits": " 3", "description": "Fundamental principles of strengthening", "prerequisite": "MSE 250", "restrictions": "Open to seniors or graduate students in the College of Engineering or in the Materials Science and Engineering Major or in the Materials Science and Engineering Minor.", "alias": "MSM 465"}, "MSE466": {"name": " Design and Failure Analysis (W)", "semester": "Spring of every year", "credits": " 3", "description": "Modes and causes of failure in mechanical components and role of design. Non-destructive evaluation. Legal and economic aspects of materials failure. Student projects.", "prerequisite": "(MSE 320 and MSE 331 and MSE 381) and completion of Tier I writing requirement", "restrictions": "Open to seniors in the Materials Science and Engineering Major.", "alias": "MSM 466"}, "MSE474": {"name": " Ceramic and Refractory Materials", "semester": "Fall of every year", "credits": " 3", "description": "Ceramic and glassy materials. High temperature processes. Mechanical and physical properties of technical ceramics.", "prerequisite": "MSE 260", "restrictions": "Open to seniors in the Materials Science and Engineering Major or in the Materials Science and Engineering Minor.", "alias": "MSM 454, MSE 454"}, "MSE476": {"name": " Physical Metallurgy of Ferrous and Aluminum Alloys", "semester": "Fall of every year", "credits": " 3", "description": "Heat treatment and properties of ferrous and aluminum alloys. Casting and solidification. Effects of alloying elements, high strength low alloy steels, hardenability, and case hardening. Joining of materials, such as welding.", "prerequisite": "MSE 250", "restrictions": "Open to seniors in the Materials Science and Engineering Major or in the Materials Science and Engineering Minor.", "alias": "MSM 476"}, "MSE477": {"name": " Manufacturing Processes", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Fundamentals of manufacturing processes such as casting, heat treating, particulate processing, forming, machining, joining, and surface processing. Selection of manufacturing processes based on design and materials.", "prerequisite": "ME 222 and MSE 250", "restrictions": "Open to students in the Applied Engineering Sciences Major or in the Materials Science and Engineering Major or in the Mechanical Engineering Major.", "alias": "MSM 481"}, "MSE481": {"name": " Spectroscopic and Diffraction Analysis of Materials", "semester": "Spring of every year", "credits": " 3", "description": "General properties, generation, and detection of x-rays interaction with solids. Crystallography, reciprocal space, diffraction analysis, and techniques. Single crystal methods. Stereographic projection. X-ray microanalysis.", "prerequisite": "PHY 184 or PHY 184B or PHY 234B or PHY 294H or LB 274", "restrictions": "Open to juniors or seniors in the Materials Science and Engineering Major or in the Materials Science and Engineering Minor.", "alias": "MSE 451, MSM 451"}, "MSE490": {"name": " Independent Study", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 3", "description": "Individualized reading and research.", "restrictions": "Open to seniors. Approval of department.", "alias": "MSM 490"}, "MSE491": {"name": " Selected Topics", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 3", "description": "Topics of current interest in materials science or engineering.", "restrictions": "Open to students in the Department of Chemical Engineering and Materials Science or in the College of Engineering.", "alias": "MSM 491"}, "MSE499": {"name": " Senior Research and Design Project (W)", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 2 to 4", "description": "Design and analysis to solve materials and/or mechanics related problem. Preparation of written report, oral presentation, and defense of the project.", "prerequisite": "Completion of Tier I writing requirement.", "restrictions": "Open to students in the Department of Chemical Engineering and Materials Science or in the Materials Science and Engineering Major. Approval of department.", "alias": "MSM 499"}, "MSE801": {"name": " Foundations of Materials Science and Engineering", "semester": "Summer of every year", "credits": " 3", "description": "Structure-Property-Processing-Performance interrelationship of metals, ceramics and polymers. Phase diagrams, thermomechanical treatments, physical and mechanical properties, processing, diffusion, microstructure studies, environmental effects."}, "MSE802": {"name": " Research Methods", "semester": "Fall of every year", "credits": " 1", "description": "Skills required for graduate research. Critically reviewing the literature, defining a fundamental research problem, effective oral and written technical presentations.", "restrictions": "Open to graduate students in the Department of Chemical Engineering and Materials Science."}, "MSE810": {"name": " Materials for Energy Applications", "semester": "Fall of every year", "credits": " 3", "description": "Enabling science and technology for new energy generation materials, storage, and distribution technologies; thermoelectric materials, electrochemistry of batteries, semiconductors for solar cells, radiation tolerant materials, processing of biobased fuels, greenhouse gas mitigation approaches", "restrictions": "Open to graduate students in the Department of Chemical Engineering and Materials Science.", "exclude": "MSE 410"}, "MSE851": {"name": " Thermodynamics of Solids", "semester": "Fall of every year", "credits": " 3", "description": "Use of Jacobians. Thermodynamic functions. Thermodynamics of solid-solid phase transformation. Thermoelastic solids, rubber elasticity, and stressed solids. Surfaces and interfaces, point defects in solids. Thermodynamics of solids under high pressure.", "alias": "MSM 851"}, "MSE855": {"name": " Advanced Rate Theory and Diffusion", "semester": "Spring of every year", "credits": " 3", "description": "Review of Fick's Laws. Atomistic aspects of diffusion. Defects in solids. Probabilistic basis of random walk. Green's function solutions.", "alias": "MSM 855"}, "MSE860": {"name": " Advanced Theory of Solids", "semester": "Spring of every year", "credits": " 3", "description": "Quantum mechanics. Free electron theory. Energy bands, semiconductors. Dielectrics and ferroelectrics. Dia-, para-, ferro-, and antiferro-magnetism. Superconductivity. Thermal properties.", "alias": "MSE 865, MSM 865"}, "MSE862": {"name": " Dislocation Theory", "semester": "Fall of every year", "credits": " 3", "description": "Advanced theory of dislocations and other crystal defects in metals, ceramics, aggregates and ordered compounds. Elasticity theory of straight dislocations, dislocation strain energy, mobility, obstacle interactions, reactions, and core effects.", "alias": "MSM 862"}, "MSE870": {"name": " Electron Microscopy in Materials Science", "semester": "Fall of every year", "credits": " 3", "description": "Theory of electron diffraction. Electromagnetic lenses. Image formation in transmission electron microscopy. Defect analysis and diffraction contrast.", "restrictions": "Open to graduate students in the Materials Science and Engineering major or approval of department.", "alias": "MSM 870"}, "MSE871": {"name": " Material Surfaces and Interfaces", "semester": "Fall of odd years", "credits": " 3", "description": "Physical and chemical nature of solid surfaces and their interaction with gases, liquids, and other solids. Characterization of surfaces and solid-solid interfaces. Relation of surface and interfacial structure to engineering phenomena.", "restrictions": "Open only to graduate students in the Department of Chemical Engineering and Materials Science or Department of Chemistry or School of Packaging.", "alias": "MSM 871"}, "MSE875": {"name": " Engineering Ceramics", "semester": "Fall of odd years", "credits": " 3", "description": "Physical properties of engineering ceramics. Transport properties of ceramics, especially in ferrites and garnets. Optical ceramic materials.", "alias": "MSM 875"}, "MSE876": {"name": " Advanced Polymeric Materials", "semester": "Fall of even years", "credits": " 3", "description": "Advanced topics in polymer structure and properties. Thermoplastics, thermosets, polyblends and elastomers. Processing techniques. Deformation and mechanical properties. Thermal, optical and chemical properties. Composites.", "alias": "MSM 876"}, "MSE880": {"name": " Computational Materials Science", "semester": "Spring of every year", "credits": " 3", "description": "Modeling methods and computational techniques for predicting materials properties. Multi-scale simulation in different material classes. Techniques include density functional theory, molecular statics and dynamics, discrete dislocation dynamics, continuum crystal plasticity.", "restrictions": "Open to graduate students in the College of Engineering."}, "MSE881": {"name": " Advanced Spectroscopy and Diffraction Analysis of Materials", "semester": "Spring of every year", "credits": " 3", "description": "Physical basis for properties, generation, and detection of x-ray interaction with solids. Crystallography, reciprocal space, diffraction analysis, and techniques. Single crystal methods. Stereographic projection. X-ray microanalysis.", "restrictions": "Open to graduate students in the College of Engineering.", "alias": "MSE 841", "exclude": "MSE 481"}, "MSE890": {"name": " Independent Study", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 3", "description": "Individualized reading and research of student's interest.", "restrictions": "Approval of department.", "alias": "MSM 890"}, "MSE891": {"name": " Selected Topics", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 3", "description": "Special topics of current importance in materials science or engineering.", "restrictions": "Approval of department.", "alias": "MSM 891"}, "MSE892": {"name": " Seminar", "semester": "Fall of every year, Spring of every year", "credits": " 1", "description": "Presentations of detailed studies of specialized aspects of chemical engineering and materials science.", "restrictions": "Open to master's students in the Chemical Engineering Major or in the Materials Science and Engineering Major."}, "MSE899": {"name": " Master's Thesis Research", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 8", "description": "Master's thesis research.", "alias": "MSM 899"}, "MSE974B": {"name": " High Temperature Deformation and Processing", "semester": "Spring of even years", "credits": " 3", "description": "Theoretical and design principles applied to the control of creep, superplasticity, cavitation, recrystallization, and texture changes. Metallic, alloy, intermetallic, ceramic, and composite systems.", "alias": "MSM 980B, MSM 974B"}, "MSE990": {"name": " Independent Study", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 3", "description": "Individualized reading and research.", "alias": "MSM 990"}, "MSE991": {"name": " Selected Topics", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 3", "description": "Special advanced topics in materials science and engineering, and mechanics.", "restrictions": "Approval of department.", "alias": "MSM 991"}, "MSE992": {"name": " Seminar", "semester": "Fall of every year, Spring of every year", "credits": " 1", "description": "Presentations of detailed studies of specialized aspects of chemical engineering and materials science.", "restrictions": "Open to doctoral students in the Chemical Engineering Major or in the Materials Science and Engineering Major."}, "MSE999": {"name": " Doctoral Dissertation Research", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 24", "description": "Doctoral dissertation research.", "restrictions": "Open to graduate students in the Department of Chemical Engineering and Materials Science.", "alias": "MSM 999"}}}