{"code": "PDC", "name": "Planning, Design and Construction", "courses": {"PDC120": {"name": " Introductory Digital Graphic Communications (Interim Change)", "semester": "Spring of every year, Summer of every year", "credits": " 2", "description": "Basic and fundamental communications to present digital renderings in various forms using digital software."}, "PDC403": {"name": " Introduction to Domicology: Sustainable Built Environment", "semester": "Spring of every year", "credits": " 3", "description": "The lifecycle of structures. Causes and impacts of structural abandonment, and sustainable tools, policies, and practices to address it", "prerequisite": "Completion of Tier I Writing Requirement", "restrictions": "Open to juniors or seniors or graduate students."}, "PDC420": {"name": " Advanced Digital Graphic Communications", "semester": "Spring of every year, Summer of every year", "credits": " 3", "description": "Advanced skills for digital graphic communications. Digital rendering using advanced graphic software programs.", "prerequisite": "PDC 120 or approval of school", "restrictions": "Open to juniors or seniors or graduate students."}, "PDC460": {"name": " Green Roofs and Walls", "semester": "Fall of every year", "credits": " 2", "description": "Green roof and wall design and installation practices including plant species and substrates. Environmental impact, ecosystem services, integration with other environmental practices. Influence of economics, public policy, and industry organizations on the implementation of green roofs on a wide scale. Multidisciplinary nature of planning and implementation of successful green roof and wall projects.", "prerequisite": "HRT 203 or FW 101 or GEO 206 or PDC 120 or EGR 100", "restrictions": "Open to juniors or seniors or graduate students."}, "PDC491": {"name": " Special Topics in Planning, Design and Construction", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 4", "description": "Selected topics that integrate content across construction management, interior design, landscape architecture and urban and regional planning."}, "PDC493": {"name": " Internship in Planning, Design and Construction", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 4", "description": "Supervised professional experience in agencies or businesses related to the student's major field of study.", "restrictions": "Open to juniors or seniors in the School of Planning, Design and Construction. Approval of school; application required."}, "PDC803": {"name": " Advanced Domicology: Sustainable Built Environment (Interim New)", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": " 3", "description": "Advanced study of the lifecycle of structures. Causes and impacts of structural abandonment, and sustainable tools, policies, and practices to address it. Faculty-guided/student-led research and outreach on a selected Domicology topic.", "restrictions": "Open to graduate students or lifelong graduate students."}, "PDC853": {"name": " Real Estate Finance and Commercial Development (Interim New)", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": " 3", "description": "Essential real estate finance concepts, tools and performance metrics to build complete project pro formas. Commercial, mixed-use development team projects.", "restrictions": "Open to graduate students or lifelong graduate students."}, "PDC858": {"name": " Land Use Planning & Housing (Interim New)", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": " 3", "description": "Relationship between housing, society, and the economy. Land use planning tools and process. Impact of land use planning on housing development. Housing design, development process, and performance metrics.", "restrictions": "Open to graduate students or lifelong graduate students."}, "PDC859": {"name": " Construction Management and Real Estate Case Studies (Interim New)", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": " 3", "description": "Construction management concepts and practices related to real estate development projects, followed by a series of real estate development case studies covering multiple types of projects.", "restrictions": "Open to graduate students or lifelong graduate students."}, "PDC878": {"name": " Redevelopment and the Climate Resilient City (Interim New)", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": " 3", "description": "Connection between federal, state and local policies in the practice of urban resilient redevelopment. Best practice techniques for land redevelopment and climate change adaptation for planning, design and construction professionals.", "restrictions": "Open to graduate students or lifelong graduate students.", "exclude": "UP 488"}, "PDC901": {"name": " Integrated Approach to Sustainable Planning, Design and Construction", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Integrated approach to planning, design, and construction for development of sustainable built environment.", "restrictions": "Open to graduate students in the School of Planning, Design and Construction."}, "PDC990": {"name": " Special Problems in Planning, Design, and Construction", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 6", "description": "Individual study in construction management and related Built Environment areas.", "restrictions": "Open only to graduate students in the School of Planning, Design, and Construction. Approval of department."}, "PDC992": {"name": " Advanced Research Methods in Planning, Design and Construction", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Current areas and topics of research in planning, design, and construction. Analysis of existing research, and development of preliminary proposal."}, "PDC999": {"name": " Doctoral Dissertation Research", "semester": "Fall of every year, Spring of every year, Summer of even years", "credits": "Variable from 1 to 24", "description": "Doctoral dissertation research.", "restrictions": "Open to doctoral students in the School of Planning, Design and Construction."}}}