{"code": "PHL", "name": "Philosophy", "courses": {"PHL101": {"name": " Introduction to Philosophy", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Theories of knowledge, values, and reality. Topics such as objectivity, relativism and cultural diversity, moral responsibility, aesthetic values, the self, existence of God, free will, minds and machines.", "alias": "PHL 200"}, "PHL130": {"name": " Logic and Reasoning", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Deductive and inductive reasoning. Topics such as rational argumentation, fallacies, definition, meaning, truth and evidence. Techniques for critical reading and thinking.", "exclude": "PHL 330"}, "PHL210": {"name": " Ancient Greek Philosophy", "semester": "Fall of every year", "credits": " 3", "description": "Philosophical problems of existence, knowledge, and action as addressed in selected readings from the Presocratics, Plato, Aristotle, and Hellenistic philosophers."}, "PHL211": {"name": " Modern Philosophy", "semester": "Spring of every year", "credits": " 3", "description": "Philosophy from the Renaissance through the nineteenth century, including selections from Descartes, Spinoza, Locke, Leibniz, Berkeley, Hume, Kant, Nietzsche, and other prominent figures."}, "PHL212": {"name": " Latin American Philosophy", "semester": "Fall of odd years, Spring of even years", "credits": " 3", "description": "A survey of historic and contemporary philosophical traditions from Latin America."}, "PHL213": {"name": " Africana Philosophy", "semester": "Fall of odd years, Spring of even years", "credits": " 3", "description": "A survey of historic and contemporary philosophical traditions from Africa and African diasporas."}, "PHL214": {"name": " Indigenous Philosophy", "semester": "Fall of even years, Spring of odd years", "credits": " 3", "description": "A survey of historic and contemporary philosophical traditions from Indigenous peoples globally."}, "PHL220": {"name": " Existentialism", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": " 3", "description": "Husserl, Jaspers, Kierkegaard, Marcel, Nietzsche, Sartre, and de Beauvoir. Topics such as hope, anxiety, bad faith, subjectivity, freedom, social being, phenomenological method.", "alias": "PHL 320"}, "PHL247": {"name": " Aesthetics", "semester": "Fall of every year", "credits": " 3", "description": "Aesthetic theories, philosophies of art, the role of art and aesthetics in culture and society. Discussion of major positions within the history of aesthetics, and contemporary problems and figures such as Plato, Kant, Hegel, Nietzsche, Heidegger, Gadamer, Adorno, Langer, and Danto.", "alias": "PHL 347"}, "PHL260": {"name": " Philosophy of Religion", "semester": "Fall of every year", "credits": " 3", "description": "Key concepts, themes, and questions in the philosophy of religion."}, "PHL291": {"name": " Special Topics in Introductory Philosophy", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 3 to 4", "description": "Special topics supplementing regular course offerings."}, "PHL315": {"name": " African Philosophy", "semester": "Spring of every year", "credits": " 3", "description": "Debates about the nature of philosophy in Africa and specific controversies about knowledge, rationality, metaphysics, morality, and politics. African philosophy in a global context.", "alias": "PHL 351"}, "PHL330": {"name": " Formal Reasoning", "semester": "Fall of every year, Spring of every year", "credits": " 4", "description": "Formal methods in deductive reasoning. Logic of connectives and quantifiers including identity, functions, and descriptions.", "exclude": "PHL 432"}, "PHL340": {"name": " Ethics", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Inquiry through the writings of some important theorists, their critics and their contemporary followers. Aristotle, Hume, Kant, Mill, Sidgwick."}, "PHL342": {"name": " Environmental Ethics", "semester": "Fall of every year", "credits": " 3", "description": "Ethical perspectives on humanity's use of and relationship to nonhuman animals, the land, future humans, and the ecosystem itself."}, "PHL344": {"name": " Ethical Issues in Health Care", "semester": "Fall of every year, Spring of every year", "credits": " 4", "description": "Termination of treatment, truth-telling, informed consent, human experimentation, reproductive issues, allocation of scarce resources, justice and the health care system.", "restrictions": "Not open to freshmen or sophomores."}, "PHL345": {"name": " Business Ethics", "semester": "Fall of every year", "credits": " 4", "description": "Ethical dimensions of the relationships between a business and employees, consumers, other businesses, society, government, and the law.", "restrictions": "Not open to freshmen or sophomores."}, "PHL350": {"name": " Introduction to Social and Political Philosophy", "semester": "Fall of every year", "credits": " 3", "description": "History of social and political philosophy; problems such as obligation, power, oppression, freedom, equality, and community."}, "PHL353": {"name": " Core Themes in Peace and Justice Studies", "semester": "Fall of every year", "credits": " 3", "description": "Core themes in peace and justice studies, including concepts of violence, conflict and reconciliation as informed by problems of inequality, power, and recognition. Institutional and practical approaches to nonviolence."}, "PHL354": {"name": " Philosophy of Law", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Legal concepts such as punishment, responsibility, rights and duties, and judicial decisions. Legal theories such as natural law, positivism and realism."}, "PHL355": {"name": " Philosophy of Technology (W)", "semester": "Spring of every year", "credits": " 4", "description": "Examination of the desirability of technology, its social forms, and its alternatives. Conventional productivist, ecological progressive, and radical humanist outlooks.", "prerequisite": "(LB 133) or completion of Tier I writing requirement", "restrictions": "Open to students in the Department of Philosophy or in the Lyman Briggs College or in the Science, Technology, Environment and Public Policy Specialization.", "alias": "LBS 355"}, "PHL356": {"name": " Philosophical Aspects of Feminism", "semester": "Fall of every year, Spring of every year", "credits": " 4", "description": "Conceptual and normative issues in feminist theory. Topics such as sexism, oppression, coercion, control, power, equality, personhood, respect and self-respect, rape, separatism, community, intimacy, and autonomy."}, "PHL357": {"name": " Philosophy of Karl Marx", "semester": "Spring of every year", "credits": " 3", "description": "Marx's philosophical thought and its bearing on science, religion, art and politics."}, "PHL358": {"name": " Philosophy, Gender, and Global Development", "semester": "Summer of every year", "credits": " 3", "description": "Gender and development in a global context from a feminist and philosophical perspective. Gender, oppression and embodiment. Diversity, the politics of difference, and women’s identity. Multiculturalism, postcolonialism and transculturalism. Feminism, international development, and global justice.", "restrictions": "Not open to freshmen."}, "PHL361": {"name": " Knowledge and Reality", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Introduction to the main problems in epistemology and metaphysics. Topics vary and may include"}, "PHL380": {"name": " Nature of Science", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Conflicting views about science and values. Such topics as scientific methodology; the objectivity and value neutrality of science; the presuppositions, goals, and limits of science; and science and decision making."}, "PHL391": {"name": " Special Topics in Intermediate Philosophy", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 3 to 4", "description": "Special topics supplementing regular course offerings."}, "PHL410": {"name": " Socrates and Plato Seminar", "semester": "Fall of odd years", "credits": " 4", "description": "A selection of themes (ontology, epistemology, method, ethics) from Plato’s Socratic and constructive dialogues. Variable by term in content.", "prerequisite": "PHL 210 or approval of department"}, "PHL411": {"name": " Aristotle Seminar", "semester": "Spring of every year", "credits": " 4", "description": "Aristotle's major works and his major contributions to the metaphysics, psychology, ethics, the arts, and politics. Variable by term in content.", "prerequisite": "PHL 210 or approval of department"}, "PHL413": {"name": " Seminar in Early Modern Philosophy", "semester": "Fall of even years", "credits": " 4", "description": "Topics selected from among the works of 17th and 18th century philosophers, e.g., Descartes, Spinoza, Locke, Leibniz, Berkeley, and Hume. Variable by term in content."}, "PHL415": {"name": " Kant Seminar", "semester": "Spring of odd years", "credits": " 4", "description": "A seminar in Immanuel Kant’s critical philosophy in metaphysics, epistemology, ethics, political philosophy, aesthetics, or other areas. Variable by term in content."}, "PHL416": {"name": " Hegel Seminar", "semester": "Spring of even years", "credits": " 4", "description": "Hegel's dialectic and its bearing on both the history of philosophy and issues about science, politics, art and religion."}, "PHL417": {"name": " Seminar in 19th Century Philosophy", "semester": "Fall of odd years", "credits": " 4", "description": "Selections from Post-Hegelian German philosophy, Mill and Utilitarianism, early African-American philosophy, Nietzsche and proto-existentialism, or American Pragmatism. Variable by term in content."}, "PHL418": {"name": " Seminar in 20th Century Philosophy", "semester": "Fall of even years", "credits": " 3", "description": "Emphasis on important philosophers or movements in the analytic or continental traditions of the 20th century, extending to the present. Variable by term in content and approach."}, "PHL419": {"name": " Topics in the History of Philosophy", "semester": "On Demand", "credits": " 3", "description": "Emphasis on one of the less frequently taught themes, philosophers, and movements in the history of philosophy."}, "PHL421": {"name": " Topics in European and Continental Philosophy", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Discussion of movements, issues, or figures in Continental and European Philosophy. Variable by term in content."}, "PHL431": {"name": " Topics in Philosophy of Logic and Language", "semester": "Spring of even years", "credits": " 3", "description": "Investigation of logical concepts. Philosophical significance of twentieth-century results in logic. Related issues in the semantics and pragmatics of natural language.", "alias": "PHL 430"}, "PHL432": {"name": " Logic and its Metatheory", "semester": "Spring of odd years", "credits": " 4", "description": "Logical consequence, first-order predicate logic with identity, including functions and descriptions. Proof theory and model theory. Topics in metatheory such as completeness, compactness, and the Lowenheim-Skolem Theorems. The axiomatic method and Godel's Incompleteness Theorems.", "exclude": "PHL 330"}, "PHL440": {"name": " Central Issues in Ethics", "semester": "Spring of every year", "credits": " 4", "description": "Twentieth-century discussions of universalization, utilitarianism, nature of a moral theory, moral language, relativism, skepticism, theory and practice, weakness of will, moral education, and justification."}, "PHL442": {"name": " Ethics and Animals", "semester": "Fall of odd years", "credits": " 3", "description": "Moral standing for non-human animals, basis for human moral obligations to animals, animal's cognitive abilities. Ethics of using animals in specific ways", "restrictions": "Open to juniors or seniors or graduate students."}, "PHL444": {"name": " Philosophical Issues in Biomedicine", "semester": "Fall of even years", "credits": " 4", "description": "Philosophically puzzling features of medical research, policy, and practice. Issues in theories of knowledge, personal identity, reference and meaning."}, "PHL451": {"name": " Philosophy and the Black Experience", "semester": "Spring of odd years", "credits": " 3", "description": "Philosophical issues about race and the black experience. Nature of racism, relationship of science to race, debates about identity, public policy and race."}, "PHL452": {"name": " Ethics and Development", "semester": "Fall of every year", "credits": " 3", "description": "Ethical issues such as racism, health care disparities, war, genocide, famine, agricultural intensification, economic liberalization, democratization, gender equity, globalization, and environmental degradation."}, "PHL453": {"name": " Ethical Issues in Global Public Health", "semester": "Spring of every year", "credits": " 3", "description": "Ethical issues about public health from a global perspective. Health and illness in the context of development, poverty, technological change, resource conflicts, the distribution of power, and social violence. Values and policy issues regarding resources, environment, and the distribution and quality of health care."}, "PHL454": {"name": " Topics in Philosophy of Law", "semester": "Spring of every year", "credits": " 3", "description": "Selected topics in philosophical approaches to law such as critical race theory, constitutional theory and international law.", "prerequisite": "Completion of Tier I Writing Requirement", "restrictions": "Open to juniors or seniors in the Department of Philosophy or approval of department."}, "PHL456": {"name": " Topics in Feminist Philosophy", "semester": "Fall of odd years", "credits": " 4", "description": "Philosophical issues in a framework of feminist politics and critique. Standpoint theories, care/justice ethics, ontological status of genders/races, theories of power/domination, determinism/freedom."}, "PHL460": {"name": " Epistemology", "semester": "Fall of every year", "credits": " 3", "description": "Theories and concepts of knowledge, belief, epistemic justification, certainty, and reason."}, "PHL461": {"name": " Metaphysics", "semester": "Spring of every year", "credits": " 3", "description": "Basic concepts employed in trying to understand the nature of things. Concepts include universals, particulars, things, kinds, properties, events, persons, change, causality, chance, existence, possibility, necessity, space, and time."}, "PHL462": {"name": " Philosophy of Mind", "semester": "Fall of every year", "credits": " 3", "description": "Modern theories of the mind, other minds, and the mind's relation to the body. Theories include dualism, behaviorism, criteriology, reductive and eliminative materialism, and functionalism."}, "PHL463": {"name": " Introduction to Cognitive Science", "semester": "Fall of every year", "credits": " 3", "description": "Cognitive processing of information by animals, humans, and computers. Relevant issues in philosophy, linguistics, psychology, neurophysiology, and artificial intelligence."}, "PHL480": {"name": " Philosophy of Science", "semester": "Fall of every year", "credits": " 4", "description": "Structure of scientific theories and explanation. Causation, prediction, induction, confirmation, discovery, and scientific progress."}, "PHL486": {"name": " Biotechnology in Agriculture: Applications and Ethical Issues", "semester": "Fall of even years", "credits": " 3", "description": "Current and future roles of biotechnology in agriculture", "prerequisite": "BS 161 or PLB 105", "restrictions": "Not open to freshmen or sophomores."}, "PHL490": {"name": " Independent Study", "semester": "Fall of every year, Spring of every year", "credits": "Variable from 1 to 4", "description": "Supervised special projects arranged by an individual student and a faculty member in areas supplementing regular course offerings.", "restrictions": "Approval of department."}, "PHL491": {"name": " Special Topics in Philosophy", "semester": "Fall of every year, Spring of every year", "credits": "Variable from 3 to 4", "description": "Special topics supplementing regular course offerings, proposed by faculty on a group study basis."}, "PHL492": {"name": " Capstone for Majors (W)", "semester": "Spring of every year", "credits": " 3", "description": "Advanced, variable topic seminar for undergraduate majors. Presentations, substantial written work.", "prerequisite": "Completion of Tier I Writing Requirement", "restrictions": "Open to seniors in the Department of Philosophy or approval of department."}, "PHL493": {"name": " Philosophy Internship", "semester": "Fall of every year, Spring of every year", "credits": "Variable from 1 to 4", "description": "Supervised pre-professional field experience in such philosophy-related careers as found in legal, healthcare, legislative or non-profit settings.", "prerequisite": "(Completion of Tier I Writing Requirement) and (PHL 130 or PHL 330) and (PHL 210 or PHL 211)", "restrictions": "Open to juniors or seniors. Approval of department."}, "PHL499": {"name": " Senior Thesis (W)", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": " 3", "description": "Individual research project supervised by a faculty member that demonstrates the student's ability to do independent research and submit or present a major paper.", "prerequisite": "(PHL 130 or PHL 330 or PHL 432) and completion of Tier I writing requirement", "restrictions": "Open to seniors in the Department of Philosophy. Approval of department."}, "PHL800": {"name": " Proseminar in Philosophy", "semester": "Fall of every year", "credits": " 3", "description": "The practice of graduate and professional work in philosophy", "restrictions": "Open only to master's students in the Department of Philosophy or approval of department."}, "PHL801": {"name": " Teaching Philosophy", "semester": "Spring of every year", "credits": " 3", "description": "Theoretical and pedagogical issues in teaching philosophy", "restrictions": "Open only to doctoral students in the Department of Philosophy or approval of department."}, "PHL810": {"name": " Seminar in the History of Philosophy", "semester": "Fall of every year", "credits": "Variable from 2 to 4", "description": "Major thinkers, themes, periods, or movements in the history of philosophy.", "restrictions": "Open only to graduate students in the Philosophy major or approval of department."}, "PHL820": {"name": " Seminar in Continental Philosophy", "semester": "Fall of even years", "credits": "Variable from 2 to 4", "description": "Major figures or themes in 19th and 20th century continental philosophy.", "restrictions": "Open only to graduate students in the Philosophy major or approval of department."}, "PHL830": {"name": " Graduate Seminar in Logic and Language", "semester": "Spring of even years", "credits": " 3", "description": "Graduate-level investigation of logical concepts, the philosophical significance of results in logic and the philosophy of language over the past 150 years, and related issues in the semantics and pragmatics of natural language."}, "PHL840": {"name": " Seminar in Value Theory", "semester": "Spring of every year", "credits": "Variable from 2 to 4", "description": "Major figures, themes, or periods in ethics or aesthetics. Topics vary.", "restrictions": "Open only to graduate students in the Philosophy major or approval of department."}, "PHL850": {"name": " Seminar in Social and Political Philosophy", "semester": "Spring of even years", "credits": "Variable from 2 to 4", "description": "Major figures, themes, or periods in social and political philosophy. Topics vary.", "restrictions": "Open only to graduate students in the Philosophy major or approval of department."}, "PHL860": {"name": " Seminar in Metaphysics and Epistemology", "semester": "Fall of every year", "credits": "Variable from 2 to 4", "description": "Selected topics in metaphysics, epistemology, and philosophy of mind.", "restrictions": "Open only to graduate students in the Philosophy major or approval of department."}, "PHL867": {"name": " Nature and Practice of Cognitive Science", "semester": "Spring of every year", "credits": " 3", "description": "Survey of how different disciplines explore the cognitive processes underlying intelligent behavior.", "alias": "ZOL 867"}, "PHL870": {"name": " Seminar in Philosophy of Health Care", "semester": "Fall of every year", "credits": "Variable from 2 to 4", "description": "Ethical, political, theoretical, and methodological issues in medicine and health care.", "restrictions": "Open only to graduate students in the Philosophy major or approval of department."}, "PHL880": {"name": " Seminar in Philosophy of Science", "semester": "Spring of every year", "credits": "Variable from 2 to 4", "description": "Selected topics in the philosophy of the special sciences, in the metatheory of science, and in the social studies of science.", "restrictions": "Open only to graduate students in the Philosophy major or approval of department."}, "PHL890": {"name": " Independent Study", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 10", "description": "Special projects, directed reading, and research arranged by an individual graduate student and a faculty member in areas supplementing regular course offerings.", "restrictions": "Approval of department."}, "PHL894": {"name": " Practicum in Philosophy of Health Care", "semester": "Fall of every year, Spring of every year", "credits": "Variable from 1 to 6", "description": "Study of ethical and policy issues in hospital and governmental agency settings.", "restrictions": "Open only to graduate students in the Philosophy major or approval of department."}, "PHL897": {"name": " Seminar in Feminist Theories, Epistemologies, and Pedagogy", "semester": "Spring of odd years", "credits": " 3", "description": "Foundational knowledge, theory, epistemology, and pedagogy in women’s and gender studies from a multi-disciplinary, global perspective."}, "PHL899": {"name": " Master's Thesis Research", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 12", "description": "Directed research leading to a master's thesis in partial fulfillment of Plan A master's degree requirements.", "restrictions": "Approval of department."}, "PHL999": {"name": " Doctoral Dissertation Research", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 12", "description": "Doctoral dissertation research.", "restrictions": "Approval of department."}}}