{"code": "PHM", "name": "Pharmacology and Toxicology", "courses": {"PHM211": {"name": " Pharmacology and Toxicology in Society", "semester": "Spring of every year", "credits": " 2", "description": "Introduction for non-science or science students to the field of pharmacology and toxicology. History of pharmacology and toxicology. Present issues and future possibilities. Society and systems of drug development and delivery. Drug abuse and policies."}, "PHM321": {"name": " Common Drugs", "semester": "Spring of every year", "credits": " 3", "description": "Introduction to commonly used drugs. Emphasis on over-the-counter medications and frequently prescribed prescription drugs. Selected natural products also will be covered. How commonly used drugs affect the body to treat or cure various conditions and how the body handles drugs. Principles of appropriate drug use and consequences of misuse.", "prerequisite": "(PSL 250) or (PSL 431 and PSL 432) or PSL 310", "restrictions": "Open to juniors or seniors or approval of department."}, "PHM350": {"name": " Introductory Human Pharmacology", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": " 3", "description": "General principles of pharmacology. Central nervous system, autonomic nervous system, cardiovascular, renal, cancer, microbial, and endocrine pharmacology.", "prerequisite": "(PSL 250 or PSL 310) or (PSL 431 and PSL 432)", "restrictions": "Not open to freshmen.", "exclude": "PHM 430 or PHM 440"}, "PHM351": {"name": " Fundamentals of Drug Safety", "semester": "Spring of every year", "credits": " 2", "description": "How and why drugs are tested and monitored for safety. The roles of the FDA, USDA, and EPA to ensure drug safety.", "prerequisite": "(BS 161 and BS 162) or (LB 144 and LB 145) or (BS 181H and BS 182H)", "restrictions": "Open to juniors or seniors or approval of department."}, "PHM422": {"name": " Fundamentals of Neuropharmacology", "semester": "Spring of every year", "credits": " 2", "description": "Mechanisms and uses of action of drugs on neurons and neuron-controlled activities", "prerequisite": "NEU 301 or PSL 250 or PSL 310 or PSL 431", "restrictions": "Open to juniors or seniors or approval of department."}, "PHM430": {"name": " Human Pharmacology", "semester": "Summer of every year", "credits": " 3", "description": "General principles of pharmacology. Central nervous system and autonomic nervous system, cardiovascular, renal, cancer, microbial, and endocrine pharmacology.", "prerequisite": "(PSL 250 or PSL 310) or (PSL 431 and PSL 432)", "restrictions": "Open to master's students in the Integrative Pharmacology Major or in the Pharmacology and Toxicology Major and open to undergraduate students. Approval of department.", "exclude": "PHM 350 or PHM 440"}, "PHM431": {"name": " Pharmacology of Drug Addiction", "semester": "Fall of every year", "credits": " 3", "description": "Introduction to pharmacology and neuropharmacology. Understanding of the biological basis for drug abuse and addiction."}, "PHM440": {"name": " Principles of Drug Action", "semester": "Summer of every year", "credits": " 1", "description": "Factors influencing drug action. Absorption, distribution, and elimination. Factors controlling intensity, selectivity and nature of drug action. Mismatches of drug presence and drug action including receptor-effector coupling mechanisms and mechanisms of drug tolerance. Offered first half of semester.", "restrictions": "Not open to master's students in the Integrative Pharmacology Major or in the Pharmacology and Toxicology Major.", "exclude": "PHM 430 or PHM 350"}, "PHM450": {"name": " Introduction to Chemical Toxicology", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": " 3", "description": "Mammalian toxicology. Disposition of chemicals in the body, detoxication, elimination, and mechanisms of toxicity in major organ systems. Selected toxic agents.", "prerequisite": "(BS 161 and BS 162 and CEM 251) or (LB 144 and LB 145 and CEM 251)", "restrictions": "Not open to freshmen or sophomores."}, "PHM454": {"name": " Leadership and Teams for Scientists and Health Professionals", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Engage in self-reflection within the context of relating to others within a team setting; carry out appropriate leadership models suited to given contexts; evaluate change options as a leader in an organizational setting; and continue to grow as a lifelong learner. Not open to students who have completed PHM 854.", "restrictions": "Open to juniors or seniors or approval of department."}, "PHM461": {"name": " Tropical Medicine Pharmacology", "semester": "Fall of every year, Spring of every year", "credits": " 2", "description": "Tropical diseases, epidemiologic and clinical features, and pharmacologic treatments. Multidisciplinary and interdisciplinary approaches, especially in poverty settings.", "prerequisite": "PHM 350 or concurrently", "restrictions": "Open to juniors or seniors or master's students. Approval of department."}, "PHM480": {"name": " Special Problems", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 3", "description": "Individual work on selected research problems.", "restrictions": "Approval of department."}, "PHM483": {"name": " Chemotherapy of Infectious Diseases", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Major human bacterial, viral, and fungal infections including disease characteristic, epidemiologic and clinical features, pathology, laboratory diagnosis, case reviews, and pharmacologic treatment including drug kinetics, dynamics, drug interactions and patient considerations.", "prerequisite": "(PHM 350 or concurrently) and (PHM 461 or concurrently)", "restrictions": "Approval of department."}, "PHM487": {"name": " Current Topics in Pharmacology and Toxicology", "semester": "Fall of every year, Spring of every year", "credits": " 2", "description": "Therapeutic drugs and toxins for human or veterinary clinical medicine have generated significant attention in the non scientific news media. Reasons for societal attention, therapeutic breakthroughs, therapeutic needs, drug marketing, and drug regulatory policies."}, "PHM492": {"name": " Pharmacotherapy of Human Viral Infections", "semester": "Summer of every year", "credits": " 2", "description": "An integrated and multidisciplinary approach to human viral infections and their pharmacologic treatment.", "prerequisite": "PHM 350 or PHM 483 or approval of department"}, "PHM552": {"name": " Veterinary Pharmacology I : Principles and Neuropharmacology", "semester": "Spring of every year", "credits": " 2", "description": "Basic principles of pharmacology and mechanisms of action of drugs used to affect nervous system function.", "restrictions": "Open to graduate-professional students in the College of Veterinary Medicine.", "alias": "PHM 556"}, "PHM553": {"name": " Veterinary Pharmacology II: Systems and Infectious Diseases", "semester": "Fall of every year", "credits": " 3", "description": "Principles of pharmacology of infectious disease and specific organ systems, including mechanisms of action and adverse effects of drugs.", "restrictions": "Open to graduate-professional students in the College of Veterinary Medicine.", "alias": "PHM 556"}, "PHM557": {"name": " Veterinary Toxicology", "semester": "Fall of every year", "credits": " 2", "description": "Determinants of toxic responses, analytical toxicology, genetic toxicology, and toxin management. Diagnosis, prevention, and treatment of common toxicoses.", "restrictions": "Open to graduate-professional students in the College of Veterinary Medicine."}, "PHM563": {"name": " Medical Pharmacology", "semester": "Summer of every year", "credits": " 3", "description": "General principles of pharmacology and toxicology and selected drugs. Rational drug therapy.", "restrictions": "Open to graduate-professional students in the College of Human Medicine."}, "PHM564": {"name": " Basic Principles of Medical Pharmacology", "semester": "Fall of every year", "credits": " 2", "description": "Basic principles of pharmacology and toxicology and selected drugs.", "restrictions": "Open to graduate-professional students in the College of Osteopathic Medicine."}, "PHM590": {"name": " Case Studies in Clinical Pharmacology", "semester": "Spring of every year", "credits": " 2", "description": "Selected case studies emphasizing clinical applications of pharmacological principles. Evaluation of new drugs, drug advertising, and adverse drug reactions.", "prerequisite": "PHM 563", "restrictions": "Open to graduate-professional students in the College of Osteopathic Medicine or in the College of Human Medicine or approval of department."}, "PHM658": {"name": " Research Problems in Pharmacology or Toxicology", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 3", "description": "Selected research problems in pharmacology or toxicology.", "restrictions": "Approval of department."}, "PHM659": {"name": " Regulatory Affairs and Project Management in Clinical Research", "semester": "Fall of every year", "credits": " 3", "description": "Principles and activities involved in drug development, the regulatory process for obtaining marketing authorization, the fundamental aspects of project management including work breakdown structure, scheduling, earned value analysis, and risk management.", "restrictions": "Approval of department.", "exclude": "PHM 857 or PHM 858"}, "PHM801": {"name": " Fundamental Principles of Pharmacology and Toxicology", "semester": "Fall of every year", "credits": " 3", "description": "Pharmacology and toxicology, pharmacodynamics and drug discovery.", "restrictions": "Open to doctoral students in the College of Natural Science or in the College of Human Medicine or in the College of Osteopathic Medicine or in the College of Veterinary Medicine or approval of department."}, "PHM802": {"name": " Cellular, Molecular and Integrated Systems Pharmacology", "semester": "Spring of every year", "credits": " 3", "description": "Cellular and molecular mechanisms of drug actions on organ systems of humans and other mammals.", "prerequisite": "PHM 801", "restrictions": "Open to doctoral students or approval of department."}, "PHM803": {"name": " Chemical Disposition in Mammals", "semester": "Fall of every year", "credits": " 1", "description": "Principles of drug/toxicant absorption, distribution, metabolism, elimination, and kinetics in mammalian systems.", "restrictions": "Open to doctoral students. Approval of department.", "exclude": "PHM 801 or PHM 819"}, "PHM804": {"name": " Molecular and Developmental Neurobiology", "semester": "Fall of every year", "credits": " 3", "description": "Nervous system specific gene transcription and translation. Maturation, degeneration, plasticity, and repair in the nervous system.", "restrictions": "Open to graduate students in Neuroscience major."}, "PHM805": {"name": " Receptor Pharmacology", "semester": "Fall of every year", "credits": " 1", "description": "Fundamental principles and current theories of receptor pharmacology, drug receptor pharmacodynamics and signal transduction mechanisms.", "restrictions": "Not open to doctoral students in the Department of Pharmacology and Toxicology. Approval of department."}, "PHM809": {"name": " Drug Discover and Medicinal Chemistry", "semester": "Spring of even years", "credits": " 2", "description": "Fundamentals of pharmaceutical drug discovery including basic chemistry, drug-design principles, high throughput screening, computational modeling, and drug metabolic pathways.", "restrictions": "Open to doctoral students in the Department of Chemistry or in the Department of Pharmacology and Toxicology or approval of department."}, "PHM811": {"name": " Global Health: Pharmacology and Toxicology Perspective", "semester": "Summer of every year", "credits": " 2", "description": "General concepts of global health that are relevant to pharmacology and toxicology.", "prerequisite": "PHM 350 or concurrently or approval of department", "restrictions": "Approval of department."}, "PHM813": {"name": " Cardiovascular Pharmacology and Toxicology", "semester": "Summer of every year", "credits": " 3", "description": "Cardiovascular signal transduction and control in normal and pathophysiologic states.", "restrictions": "Open to graduate students or approval of department."}, "PHM816": {"name": " Integrative Toxicology: Mechanisms, Pathology and Regulation", "semester": "Fall of odd years", "credits": " 3", "description": "Biochemical, molecular, and physiological mechanisms of toxicology. Functional and pathological responses of major organ systems to chemical insult. Mechanisms of mutagenesis, carcinogenesis, and reproductive toxicology. Concepts in risk and safety assessment."}, "PHM817": {"name": " Neurotoxicology", "semester": "Spring of every year", "credits": " 2", "description": "Biochemical, molecular, physiological mechanisms and assessment of neurotoxicity. Factors predisposing the nervous system to selective toxicants. Pathophysiology and models of toxicant-induced neurodegenerative diseases.", "restrictions": "Open to graduate students. Approval of department."}, "PHM819": {"name": " Principles of Drug-Tissue Interactions", "semester": "Fall of every year, Summer of every year", "credits": " 2", "description": "General principles of interaction of chemicals with biological systems.", "restrictions": "Open to graduate students in the Integrative Pharmacology Major or in the Pharmacology and Toxicology Major. Approval of department.", "exclude": "PHM 801"}, "PHM822": {"name": " Academic and Research Integrity", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": " 1", "description": "Guidelines for research and academic integrity focusing on issues pertinent to biomedical graduate students and scientists."}, "PHM827": {"name": " Physiology and Pharmacology of Excitable Cells", "semester": "Fall of every year", "credits": " 4", "description": "Function of neurons and muscle at the cellular level", "restrictions": "Open to graduate students in the College of Natural Science or in the Department of Pharmacology and Toxicology or approval of department."}, "PHM828": {"name": " Concepts in Carcinogenesis", "semester": "Fall of every year", "credits": " 2", "description": "Mechanisms underlying malignant transformation of a cell. Carcinogenic potential of chemicals.", "prerequisite": "(BLD 830 or BMB 801 or approval of department) and (PHM 819 or approval of department)", "restrictions": "Open to master's students or doctoral students or lifelong graduate students. Approval of department."}, "PHM829": {"name": " Neuropharmacology", "semester": "Fall of every year", "credits": " 2", "description": "Mechanisms of action of drugs on the central nervous systems, targets, clinical use and side effects.", "prerequisite": "PHM 819", "restrictions": "Open to master's students or doctoral students or lifelong graduate students."}, "PHM830": {"name": " Experimental Design and Data Analysis", "semester": "Fall of every year, Summer of every year", "credits": " 3", "description": "Practical application of statistical principles to the design of experiments and analysis of experimental data in pharmacology, toxicology, and related biomedical sciences."}, "PHM831": {"name": " Endocrine Pharmacology and Toxicology", "semester": "Spring of every year", "credits": " 2", "description": "Physiology, pharmacology, and toxicology of the endocrine system. Endocrine diseases, pharmacological intervention, hormone therapy, endocrine disruptors, role of hormones in normal metabolism and metabolic disorders, and animal models of endocrine and metabolic disorders.", "prerequisite": "PHM 819"}, "PHM832": {"name": " Applied Integrative Pharmacology Laboratory", "semester": "Summer of every year", "credits": " 3", "description": "Research methods using virtual simulation for studying integrative physiology and pharmacology.", "prerequisite": "(PHM 813 or concurrently) and PHM 819 and PHM 830", "restrictions": "Not open to undergraduate students. Approval of department."}, "PHM833": {"name": " Gastro-Intestinal and Liver Pharmacology and Toxicology", "semester": "Spring of every year", "credits": " 2", "description": "Specific drugs and their mechanisms of action in the treatment of gastrointestinal and liver diseases. Toxic effects of drugs and other xenobiotics on the gastrointestinal tract, including the liver."}, "PHM834": {"name": " Respiratory Pharmacology", "semester": "Spring of every year", "credits": " 2", "description": "Integrative study of drugs, their mechanism of action, and their side effects in the treatment of major diseases and pathologies of the respiratory system."}, "PHM835": {"name": " Biopharmaceuticals: From Development to Manufacturing", "semester": "Fall of every year", "credits": " 3", "description": "Biopharmaceutical development and manufacturing processes for recombinant proteins, monoclonal antibodies, vaccines and cell-based therapeutics (stem cells). Emphasis on real-world case studies and group projects.", "prerequisite": "PHM 819", "restrictions": "Not open to undergraduate students."}, "PHM837": {"name": " Autonomic Pharmacology", "semester": "Spring of every year", "credits": " 1", "description": "Effects of drugs having therapeutic potential and potential for adverse side effects within the autonomic nervous system and organs controlled by this system. Comparison with drugs having therapeutic potential and potential adverse side effects on muscle function.", "prerequisite": "PHM 819"}, "PHM839": {"name": " Systems Neuroscience", "semester": "Spring of every year", "credits": " 4", "description": "Anatomy, pharmacology, and physiology of multicellular neural systems. Sensory, motor, autonomic, and chemo-regulatory systems in vertebrate brains.", "restrictions": "Open to graduate students or human medicine students or osteopathic medicine students in the College of Natural Science or in the College of Agriculture and Natural Resources or in the College of Human Medicine or in the College of Osteopathic Medicine or in the College of Social Science or in the College of Veterinary Medicine.", "alias": "ANT 839"}, "PHM840": {"name": " Safety Pharmacology", "semester": "Spring of every year", "credits": " 2", "description": "Systems study of current experimental models, risk assessment, and regulatory guidelines for evaluating drug candidates for pharmacologic effects unrelated to therapeutic effects."}, "PHM841": {"name": " Cellular and Molecular Toxicology", "semester": "Fall of every year", "credits": " 3", "description": "Mechanistic concepts and techniques of toxicology at the cellular and molecular levels. Various molecular events and cellular modifications that result from and/or are associated with chemically/environmentally induced toxicity and disease.", "restrictions": "Open to graduate students or approval of department."}, "PHM850": {"name": " Communications for Scientists", "semester": "Fall of every year, Summer of every year", "credits": " 2", "description": "Effective research and business communication, including written skills for scientific audiences.", "restrictions": "Open to master's students or lifelong graduate students in the College of Osteopathic Medicine or in the Department of Pharmacology and Toxicology or in the Integrative Pharmacology Major or in the Pharmacology and Toxicology Major."}, "PHM851": {"name": " Intellectual Property and Patent Law for Biomedical Sciences", "semester": "Fall of every year", "credits": " 2", "description": "Fundamentals of intellectual property and patent law encountered by biomedical scientists, including issues of prevention, patent prosecution, and enforcement of patents in a litigation setting."}, "PHM854": {"name": " Leadership and Team-Building for Biomedical Research", "semester": "Spring of every year", "credits": " 2", "description": "Evaluation of current leadership methods. Models of leadership. Practice of specific skills and development of a plan to increase their influence and extend learning beyond the class.", "exclude": "CMBA 804 or CMBA 805 or CMBA 806 or CMBA 832"}, "PHM855": {"name": " The Business of Biomedical Research Organizations", "semester": "Spring of every year", "credits": " 2", "description": "Theories, methods, terminology, and culture of business as used in biomedical research and development environments."}, "PHM857": {"name": " Project Management", "semester": "Summer of every year", "credits": " 2", "description": "Formal project management culture, principles, knowledge areas, and terminology. Specific tools and techniques including work breakdown structure, earned value analysis, risk management, and quality control for managing scientific research. Offered first ten weeks of semester."}, "PHM858": {"name": " Drug Development Process", "semester": "Spring of every year", "credits": " 3", "description": "Project management standards and best practices in drug development process, including clinical trials."}, "PHM870": {"name": " Research Rotation", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 4", "description": "Individual work on selected research problems.", "restrictions": "Approval of department."}, "PHM895": {"name": " Applied Project in Integrative Pharmacology", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 6", "description": "An on-site project that addresses a research, theoretical, or applied problem in whole-animal or organ level pharmacology, in cooperation with the students' employer or laboratory partner.", "prerequisite": "PHM 819 and PHM 830 and PHM 832", "restrictions": "Open to master's students in the Department of Pharmacology and Toxicology. Approval of department."}, "PHM899": {"name": " Master's Thesis Research", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 8", "description": "Master's thesis research.", "restrictions": "Open only to graduate students in the Department of Pharmacology and Toxicology. Approval of department."}, "PHM910": {"name": " Seminar", "semester": "Fall of every year, Spring of every year", "credits": " 1", "description": "Discussion of recent topics in pharmacology and toxicology by faculty or invited outside speakers. Students research reports.", "restrictions": "Open only to graduate students. Approval of department."}, "PHM980": {"name": " Problems", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 5", "description": "Limited work in selected research projects.", "restrictions": "Open to doctoral students. Approval of department."}, "PHM982": {"name": " Master of Science Capstone Literature Review", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 2", "description": "Advisor-supervised literature research and writing of a 15-20 page fully-referenced critical review paper on a relevant topic in pharmacology and toxicology.", "prerequisite": "PHM 850", "restrictions": "Open to master's students in the Integrative Pharmacology Major or in the Pharmacology and Toxicology Major. Approval of department."}, "PHM999": {"name": " Doctoral Dissertation Research", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 24", "description": "Doctoral dissertation research.", "restrictions": "Open to doctoral students in the Department of Pharmacology and Toxicology or in the Pharmacology and Toxicology-Environmental Toxicology major. Approval of department."}}}