{"code": "PLS", "name": "Political Science", "courses": {"PLS100": {"name": " Introduction to American Politics", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": " 3", "description": "The policymaking process in national government, with emphasis on political participation, the presidency, Congress, Supreme Court, bureaucracy, and civil rights and civil liberties."}, "PLS140": {"name": " Introduction to Comparative Politics", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": " 3", "description": "Comparative analysis of political systems in first, second, and third-world countries. Alternative methods for comparative cross-cultural analyses of political systems."}, "PLS160": {"name": " Introduction to International Relations", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": " 3", "description": "Dynamics of conflict and cooperation. Processes of foreign policy decision making. Major international economic issues. Basic future trends. Primary analytical approaches for studying world politics.", "exclude": "MC 220 or MC 221"}, "PLS170": {"name": " Introduction to Political Philosophy", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": " 3", "description": "Basic questions of political philosophy as considered from ancient to modern times. Primary focus on the origins, defense, and radical critiques of modern liberal democracy."}, "PLS200": {"name": " Introduction to Political Science", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": " 4", "description": "The science of politics. Theory construction, model building, empirical testing, and inductive inference. Examples from American, international and comparative politics."}, "PLS201": {"name": " Introduction to Methods of Political Analysis", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": " 4", "description": "Philosophy of social science. Principles of research design, measurement, hypothesis testing, measures of association, cross tabulations, and regression analysis."}, "PLS202": {"name": " Introduction to Data Analytics and the Social Sciences", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Approaches to data analysis in the social sciences. Computational tools for data collection and visualization across various digital sources, including text or social media."}, "PLS302": {"name": " Urban Politics", "semester": "Fall of every year", "credits": " 3", "description": "Structure and processes of American urban politics. Relationship of cities to U.S. federal system. Interstate variations. Policy focus on public education, crime, social welfare, and economic development."}, "PLS304": {"name": " Minority Politics", "semester": "Fall of every year", "credits": " 3", "description": "Minority groups and the political process in the United States. Civil rights movements, political organizations, legal decisions, political participation, and legislative politics."}, "PLS310": {"name": " Public Administration and Policy Making", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Role of public bureaucracy in the U.S. Theories of administrative behavior and the impact of hierarchy on policymaking. Relations with the president, Congress, interest groups, and the public. Administrative functions, responsiveness, and ethics."}, "PLS313": {"name": " American Public Policy", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": " 3", "description": "Political and economic concepts for evaluating the consequences of government decision making. Issues of problem identification, policy adoption, and implementation affecting program evaluation."}, "PLS320": {"name": " Judicial Politics", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Analysis of the structure and functions of judicial systems. Organization, administration, and politics of judicial bureaucracies. Roles of judges, juries, counsel, litigants, and interest groups in the adjudication process.", "restrictions": "Not open to freshmen or sophomores."}, "PLS321": {"name": " Constitutional Law", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "U.S. Supreme Court policy making and its effect on issues of current importance, including First Amendment freedoms, due process, race relations, sex discrimination, and privacy.", "restrictions": "Not open to freshmen or sophomores."}, "PLS322": {"name": " Comparative Legal Systems", "semester": "Spring of every year, Summer of every year", "credits": " 3", "description": "Cross-national study of common law and civil law systems. Judicial review and selection of judges. Models of judicial decision-making. High court-low court relations. Role of courts in society."}, "PLS324": {"name": " Congress", "semester": "Spring of every year", "credits": " 3", "description": "The design of Congress. Rules, structures, and procedures affecting policy making. Impact of regular elections on legislative behavior."}, "PLS325": {"name": " The Presidency", "semester": "Fall of every year", "credits": " 3", "description": "Role of the president in the U.S. political system. Constitutional questions, presidential selection, presidential power, interbranch relations, and presidential policy making."}, "PLS333": {"name": " Public Opinion and Political Behavior", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Role of public opinion in political systems and its impact on the political process. Group differences, political socialization, development and change of political attitudes and behavior patterns. Methods of studying public opinion."}, "PLS334": {"name": " Campaigns and Elections", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "The nominating process. Recruitment of candidates and the formation of electoral coalitions. Analysis of election results. Trends in electoral support for officeholders and parties."}, "PLS342": {"name": " Comparative Political Economy", "semester": "Spring of every year", "credits": " 3", "description": "Democratic politics and the linkages among political, social, and economic conceptions of equality in developed and developing countries.", "prerequisite": "EC 201 or EC 202"}, "PLS344": {"name": " Politics of Developing Areas", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Politics of modernization, democratic and authoritarian regimes, and class and ethnicity in developing countries."}, "PLS345": {"name": " Religion and World Politics", "semester": "Fall of every year", "credits": " 3", "description": "Comparative analysis of the role of religion in politics across world regions. Discussion of major theories and topics in relation to religion-state relations."}, "PLS346": {"name": " Middle East Politics", "semester": "Fall of every year", "credits": " 3", "description": "Political history, political institutions, political actors, and political culture in the Arab countries of North Africa and the Middle East, as well as Turkey, Israel, and Iran."}, "PLS347": {"name": " Democratic Regimes", "semester": "Spring of every year", "credits": " 3", "description": "Democratization, democratic consolidation, political institutions, and economic development in Africa, Latin America, Asia, Eastern Europe, and the Middle East."}, "PLS351": {"name": " African Politics", "semester": "Fall of every year", "credits": " 3", "description": "Political institutions and governmental processes in Sub-Saharan Africa."}, "PLS354": {"name": " Politics of Asia", "semester": "Fall of even years, Spring of even years", "credits": " 3", "description": "Political institutions, political actors, and policy-making processes in selected Asian countries."}, "PLS356": {"name": " Politics of Europe and the European Union", "semester": "Fall of every year, Summer of every year", "credits": " 3", "description": "Governmental institutions and processes, political socialization, and political culture in Western Europe and the European Union."}, "PLS357": {"name": " Politics of English Speaking Democracies", "semester": "Summer of every year", "credits": " 3", "description": "Political institutions, political actors, and political culture in Britain, Australia, or Canada."}, "PLS358": {"name": " Politics of the U.S.S.R. and Its Successor States", "semester": "Spring of every year", "credits": " 3", "description": "Political history, communist ideology, state institutions, and political processes in the Soviet Union and its successor states."}, "PLS362": {"name": " American Foreign Policy and National Security", "semester": "Spring of odd years", "credits": " 3", "description": "Theories of foreign policy making. Factors shaping foreign policy in various countries. Current and recurrent problems in foreign policy making.", "prerequisite": "(PLS 160 or concurrently) or (MC 220 or concurrently) or (MC 221 or concurrently)"}, "PLS363": {"name": " International and Domestic Political Conflict", "semester": "Fall of even years", "credits": " 3", "description": "Civil war, conflict, and conflict resolution in the international system.", "prerequisite": "(PLS 160 or concurrently) or (MC 221 or concurrently)"}, "PLS364": {"name": " Politics of the United Nations and International Organizations", "semester": "Spring of every year", "credits": " 3", "description": "History and evolution. League of Nations, United Nations. Growth and role of regional, specialized, and non-governmental organizations. Impact of new states. Politics, functions, and problems.", "exclude": "MC 322"}, "PLS371": {"name": " Classical Political Philosophy", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Examination of major themes in classical political philosophy as represented by such Greek and Roman philosophers as Plato, Aristotle, or Cicero."}, "PLS372": {"name": " Modern Political Philosophy", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Major themes of modern political philosophy as represented by such thinkers as Machiavelli, Hobbes, Rousseau, Marx, and Nietzsche."}, "PLS377": {"name": " American Political Thought", "semester": "Fall of even years", "credits": " 3", "description": "Major themes of American political thought. Topics may include the founding of the U.S., naturalism, race relations, or progressivism."}, "PLS392": {"name": " Special Topics in Political Science", "semester": "Fall of every year, Spring of every year", "credits": "Variable from 1 to 4", "description": "Issues and problems in contemporary political science.", "restrictions": "Open to juniors or seniors in the Department of Political Science or in the College of Social Science or in the Interdisciplinary Studies in Social Science Major or in the Political Science Major or in the Political Science-Prelaw Major or in the Public Policy Major or in the World Politics Major or approval of department."}, "PLS397": {"name": " Analyzing and Visualizing Data in Politics", "semester": "Spring of every year", "credits": " 3", "description": "Exploration and evaluation of political science theories or public policies through empirical analysis; approaches to data and graphical analysis in the political sciences; studies of prominent or emerging political science and policy data sources.", "prerequisite": "PLS 201 or PLS 202"}, "PLS422": {"name": " Seminar in Political Science (W)", "semester": "Fall of every year, Spring of every year", "credits": " 4", "description": "Variable topics including legislative behavior, policy analysis, political development, human rights, international conflict, foreign policy, international political economy, and constitutionalism.", "prerequisite": "(PLS 201) and completion of Tier I writing requirement"}, "PLS441": {"name": " Islam and World Politics", "semester": "Spring of even years", "credits": " 4", "description": "Manifestations of political Islam within key Muslim countries such as Turkey, Egypt, Saudi Arabia, Iran, and Pakistan. Use of political Islam by states and groups as an instrument to advance their international goals.", "prerequisite": "Completion of Tier I Writing Requirement", "alias": "MC 420"}, "PLS442": {"name": " Social Science Data Analytics Applications", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Application of computational tools for data collection and visualization to various topics in social science research.", "prerequisite": "PLS 202"}, "PLS481H": {"name": " Undergraduate Research Seminar", "semester": "Fall of every year, Spring of every year", "credits": " 4", "description": "Advanced research seminar for students in the political science program.", "prerequisite": "PLS 200 or concurrently or approval of department", "restrictions": "Approval of department."}, "PLS490H": {"name": " Honors Internship", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 3 to 6", "description": "Supervised participation in research or teaching.", "restrictions": "Approval of department."}, "PLS491H": {"name": " Senior Honors Thesis", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 3 to 6", "description": "Original research and writing under direction of a faculty member.", "prerequisite": "PLS 481H"}, "PLS494": {"name": " Field Experience in Political Science", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 12", "description": "Supervised field work in several areas of study. It may involve internships with non-profit organizations or public agencies, or participation in survey research, political campaigns, or petition drives.", "restrictions": "Approval of department."}, "PLS495": {"name": " Independent Study", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 6", "description": "Individual research and reading supervised by a faculty member.", "restrictions": "Approval of department."}, "PLS800": {"name": " Proseminar: Political Theory and Research Methods", "semester": "Fall of every year", "credits": " 3", "description": "Issues in the accumulation of knowledge about political phenomena. Approaches to the verification of hypotheses. Alternative theoretical conceptions in study of politics."}, "PLS801": {"name": " Quantitative Techniques in Public Policy and Political Science I", "semester": "Fall of every year", "credits": " 3", "description": "Foundations of research methodology. Applications of data in public policy and political science. Individual research projects.", "restrictions": "Open only to graduate students in the Department of Political Science or approval of department."}, "PLS802": {"name": " Quantitative Techniques in Public Policy and Political Science II", "semester": "Spring of every year", "credits": " 3", "description": "Linear and nonlinear models applied to public policy and political science data. Individualized research projects.", "restrictions": "Open only to graduate students in the Department of Political Science or approval of department."}, "PLS803": {"name": " Political Thought", "semester": "Fall of every year", "credits": " 3", "description": "Major political philosophers. Major themes of political philosophy. Consideration of the relationship between political philosophy and other fields of study in political science."}, "PLS809": {"name": " Proseminar in Formal Theory", "semester": "Spring of every year", "credits": " 3", "description": "Formal models in understanding politics. Topics may include game theory, spatial modeling, social choice theory, public choice theory, and dynamic modeling. Theoretical issues and research applications.", "restrictions": "Open to doctoral students in the Political Science Major or approval of department.", "alias": "PLS 880"}, "PLS811": {"name": " Proseminar in Policy Analysis", "semester": "Spring of every year", "credits": " 3", "description": "Economic and political techniques for analyzing public policies. Utility and limitations of these techniques and their use and abuse in public policy analysis.", "restrictions": "Open to graduate students."}, "PLS820": {"name": " Proseminar in American Politics", "semester": "Fall of every year", "credits": " 3", "description": "The major subfields of American politics. Political behavior within institutions and mass political behavior."}, "PLS821": {"name": " State Government and Politics", "semester": "Spring of odd years", "credits": " 3", "description": "Research literature on state government. Interstate differences. Parties, elections, governors, state legislatures, bureaucracy, interest groups, and policy outcomes."}, "PLS822": {"name": " Urban Government and Politics", "semester": "Spring of even years", "credits": " 3", "description": "Research literature on urban government. Structure, process, and policy issues. Intergovernmental relations and fiscal interdependencies."}, "PLS826": {"name": " International Development: Theory and Practice", "semester": "Spring of every year", "credits": " 3", "description": "Evolution of international development theory across disciplines. Changing conceptualizations, measurements, processes and effects of development and poverty. Ethnicity, social class, gender, and community influences on socioeconomic processes. Current issues, concerns, and strategic alternatives.", "alias": "ACR 826, RD 826"}, "PLS828": {"name": " Public Opinion and Political Behavior", "semester": "Fall of odd years", "credits": " 3", "description": "The acquisition and change of political attitudes. The relationship between political attitudes and political behavior. Methods and problems of measuring political attitudes."}, "PLS850": {"name": " Proseminar in Comparative Politics", "semester": "Spring of every year", "credits": " 3", "description": "Research literature in a subfield of comparative politics. Methods, approaches, and purposes."}, "PLS854": {"name": " Comparative Political Institutions", "semester": "Spring of every year", "credits": " 3", "description": "Political institutions from a comparative perspective. Topics may include electoral systems, political parties, presidential vs. parliamentary systems, representation, federalism, and constitutional engineering."}, "PLS857": {"name": " Parties and Elections", "semester": "Spring of even years", "credits": " 3", "description": "Origin, organization, and behavior of political parties in advanced industrial societies. Structure and transformation of party systems. Role of issues and elections in party systems. Parties in developing societies."}, "PLS860": {"name": " Proseminar in International Relations", "semester": "Fall of even years", "credits": " 3", "description": "Theoretical perspectives and analytical approaches to a subfield of international relations."}, "PLS870": {"name": " Proseminar in Political Thought", "semester": "Spring of even years", "credits": " 3", "description": "Survey of major issues or themes in political philosophy."}, "PLS871": {"name": " Classical Political Philosophy", "semester": "Fall of every year", "credits": " 3", "description": "Study of one or more major figures or thinkers in ancient or medieval political philosophy."}, "PLS872": {"name": " Modern Political Philosophy", "semester": "Spring of every year", "credits": " 3", "description": "Study of one or more major figures or thinkers in modern political philosophy."}, "PLS877": {"name": " American Political Thought", "semester": "Fall of odd years", "credits": " 3", "description": "Study of one or more major concepts or thinkers in American political thought."}, "PLS884": {"name": " Proseminar on Political Institutions and Public Choice", "semester": "Fall of every year", "credits": " 3", "description": "Theories of political institutions, with particular emphasis on the U.S. Possible topics include models of rational action in electoral, legislative, and bureaucratic institutions and problems of majority rule, collective action, and social welfare."}, "PLS900": {"name": " Research Seminar in Political Methodology", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Advanced topics in political methodology. Individual research projects."}, "PLS910": {"name": " Research Seminar in Public Policy and Public Administration", "semester": "Spring of every year", "credits": " 3", "description": "Specialized topics in public administration or public policy."}, "PLS920": {"name": " Research Seminar in American Politics", "semester": "Spring of every year", "credits": " 3", "description": "Intensive study of one subfield of American politics. Critical evaluation of the literature."}, "PLS950": {"name": " Research Seminar in Comparative Politics", "semester": "Fall of odd years", "credits": " 3", "description": "Intensive study of one subfield of comparative politics. Critical evaluation of the literature."}, "PLS960": {"name": " Research Seminar in International Politics", "semester": "Spring of every year", "credits": " 3", "description": "Intensive study of one subfield of international politics. Critical evaluation of the literature."}, "PLS970": {"name": " Research Seminar in Political Thought", "semester": "Spring of odd years", "credits": " 3", "description": "Intensive study of one subfield of political philosophy."}, "PLS980": {"name": " Research Seminar in Formal Theory", "semester": "Fall of odd years", "credits": " 3", "description": "Intensive study of one formal modeling technique used in political science research."}, "PLS990": {"name": " Topics in Professional Development", "semester": "Fall of every year, Spring of every year", "credits": "Variable from 1 to 4", "description": "Professionalization for Ph.D. students, including seminars on dissertation writing, graduate student teaching, and other aspects of professional development.", "restrictions": "Open to doctoral students in the Department of Political Science."}, "PLS993": {"name": " Readings in Political Science", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 6", "description": "Supervised reading in a subfield of political science, public administration, or public policy.", "restrictions": "Approval of department."}, "PLS999": {"name": " Doctoral Dissertation Research", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 12", "description": "Doctoral dissertation research.", "restrictions": "Open to doctoral students in the Political Science major."}}}