{"code": "PR", "name": "Public Relations", "courses": {"PR300": {"name": " Public Relations Theory and Ethics", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": " 3", "description": "Theories of public relations, persuasion, social media interaction and mass communication as they apply to public relations, audience analysis and application of social media strategies. Theories of ethics, ethical codes in public relations and the ethical challenges in this field.", "prerequisite": "ADV 260 or concurrently"}, "PR305": {"name": " Methods of Public Relations Inquiry", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": " 3", "description": "Nature and conduct of public relations inquiry. Formative research methods, data analytics and evaluative measures used for public relations campaign planning. Drawing samples, collecting and analyzing data, interpreting and reporting results.", "prerequisite": "(ADV 260 or concurrently) and (MTH 101 or MTH 102 or STT 200)"}, "PR310": {"name": " Diversity, Equity, and Inclusion in Public Relations and Advertising", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": " 3", "description": "Exploration of issues pertaining to diversity, equity and inclusion (DEI) as they impact the practice of public relations and advertising within the United States and globally. Effective cross-cultural communication practices.", "prerequisite": "ADV 260 or concurrently"}, "PR320": {"name": " Public Relations Storytelling for Digital, Video and Print", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": " 3", "description": "Theory and application of storytelling for corporate and public relations purposes in the digital environment. Examination of established and emerging digital and social media platforms. Content creation for public relations purposes in established and emerging digital and social media platforms.", "prerequisite": "PR 300 and PR 305 and PR 310", "restrictions": "Approval of department."}, "PR325": {"name": " Intermediate Social Media and Public Relations Techniques", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": " 3", "description": "Production of social media and public relations messages to achieve strategic organizational communication objectives. Techniques for measuring success. Development of public relations portfolio.", "prerequisite": "(COM 300 or STT 200 or STT 201) or (PR 300 and PR 305 and PR 310)", "restrictions": "Open to undergraduate students in the Public Relations Minor or approval of department.", "alias": "ADV 325"}, "PR335": {"name": " Advanced Social Media and Public Relations Techniques", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": " 3", "description": "Advanced production of written, social media and video public relations messages to achieve strategic organizational communication objectives. Techniques for measuring success. Refinement of public relations portfolio.", "prerequisite": "PR 300 and PR 305 and PR 310 and PR 325", "restrictions": "Approval of department."}, "PR425": {"name": " Public Relations Strategy and Ethics in a Digital World", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": " 3", "description": "Strategic planning and ethical considerations in public relations, social media and digital media.", "prerequisite": "(COM 300 or STT 200 or STT 201) or (PR 300 and PR 305 and PR 310)", "restrictions": "Open to undergraduate students in the Public Relations Minor or approval of department.", "alias": "ADV 425"}, "PR485": {"name": " Integrated Public Relations Campaigns (W)", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": " 3", "description": "Development of public relations campaigns for clients. Relationship-building, creative, social media and digital marketing communication elements.", "prerequisite": "(PR 300 and PR 305 and PR 310 and PR 320 and PR 335 and PR 325 and PR 425) and completion of Tier I writing requirement"}, "PR492": {"name": " Special Topics in Public Relations", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 8", "description": "Varied topics pertaining to the study of public relations processes. Not open to freshmen.", "restrictions": "Approval of department."}, "PR493": {"name": " Public Relations Internship", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 15", "description": "Supervised public relations experience in a professional environment, under faculty supervision.", "restrictions": "Approval of department."}, "PR494": {"name": " Public Relations Research Experience", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 15", "description": "Research experiences in various fields of emphasis in public relations under faculty supervision.", "prerequisite": "PR 300 and PR 305 and PR 310", "restrictions": "Approval of department."}}}