{"code": "RUS", "name": "Russian", "courses": {"RUS101": {"name": " Elementary Russian I", "semester": "Fall of every year", "credits": " 4", "description": "Russian language and culture. Development of skills in speaking, reading, listening, and writing."}, "RUS102": {"name": " Elementary Russian II", "semester": "Spring of every year", "credits": " 4", "description": "Further work on Russian language and culture. Further development of skills in speaking, reading, listening comprehension, and writing.", "prerequisite": "RUS 101"}, "RUS151": {"name": " Russian Language Review", "semester": "Summer of every year", "credits": " 2", "description": "Reviews and enhances the content of Russian 101 and 102 and broadens students’ knowledge of Russian culture.", "prerequisite": "RUS 102 or approval of department"}, "RUS201": {"name": " Second-Year Russian I", "semester": "Fall of every year", "credits": " 4", "description": "Intermediate-level development of Russian communication skills. Presentation and discussion of original oral and written texts on aspects of Russian life and culture.", "prerequisite": "RUS 102"}, "RUS202": {"name": " Second-Year Russian II", "semester": "Spring of every year", "credits": " 4", "description": "Further intermediate-level development of Russian communication skills. Further presentation and discussion of original oral and written texts on aspects of Russian life and culture.", "prerequisite": "RUS 201"}, "RUS231": {"name": " 19th-Century Russian Literature in Translation", "semester": "Fall of every year", "credits": " 3", "description": "Writings of authors such as Pushkin, Lermontov, Gogol, Turgenev, Dostoevsky,and Tolstoy as they examine important ethical questions and reflect social and political concerns."}, "RUS232": {"name": " 20th-Century Russian Literature in Translation", "semester": "Spring of every year", "credits": " 3", "description": "Writings of Chekhov, Bulgakov, Pasternak, Solzhenitsyn and Petrushevskaya as they examine the individual’s search for identity in twentieth-century Russian society."}, "RUS250": {"name": " Russian and Soviet Cinema", "semester": "Spring of every year", "credits": " 3", "description": "Development of Russian and Soviet cinematic styles and traditions in their historical and social contexts. Major films and directors. Introduction to film technique and analysis. Taught in English."}, "RUS290": {"name": " Independent Study", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 6", "description": "Special projects arranged by an individual student and a faculty member in areas supplementing regular course offerings."}, "RUS311": {"name": " Advanced Russian: Oral Communication", "semester": "Spring of every year, Summer of every year", "credits": " 3", "description": "Development of listening comprehension and oral communication in Russian. Expansion of vocabulary, development of fluency, and use of idiomatic expressions. Review of grammatical structures relevant for speaking.", "prerequisite": "RUS 201"}, "RUS341": {"name": " Russian Life and Culture of the 20th Century", "semester": "Summer of every year", "credits": " 3", "description": "Social, political, intellectual, and artistic life of twentieth-century Russia. Texts read in Russian.", "prerequisite": "RUS 202"}, "RUS420": {"name": " Russian Life and Culture Before World War I", "semester": "Fall of every year", "credits": " 3", "description": "Advanced Russian language course. Social and cultural developments in Russia before 1914, using primary documents and films. Themes include Russian folk belief, life under the Tsars, the place of minorities in the Russian empire, and gender issues in Russia.", "prerequisite": "RUS 202"}, "RUS421": {"name": " Russian Life and Culture in the 20th Century", "semester": "Spring of every year", "credits": " 3", "description": "Advanced Russian language course. Social and cultural developments in Russia and the Soviet Union between 1914 and 1991, using primary documents, television shows, and films. Themes include the revolutions of 1917, the rise of Stalin, the Cold War, the place of minorities in the Soviet Union, and the break-up of the Soviet Union.", "prerequisite": "RUS 202"}, "RUS440": {"name": " Contemporary Russian Life and Culture (W)", "semester": "Fall of every year", "credits": " 3", "description": "Advanced Russian language course. Social and cultural developments in Russia since the break-up of the Soviet Union. Significant internet component. Themes include Russian life today, organized crime and business, conflict in Chechnya, and Russian attitudes toward the United States.", "prerequisite": "RUS 202"}, "RUS441": {"name": " Russian Literature (W)", "semester": "Spring of every year", "credits": " 3", "description": "Advanced Russian language course. Reading and discussion of key works of Russian literature. Frequent interpretive essays.", "prerequisite": "RUS 202"}, "RUS490": {"name": " Independent Study", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 6", "description": "Special projects arranged by an individual student and a faculty member in areas supplementing regular course offerings."}, "RUS491": {"name": " Special Topics in Russian Studies", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 6", "description": "Special topics supplementing regular course offerings, proposed by faculty on a group study basis."}, "RUS493": {"name": " Overseas Internship", "semester": "Fall of every year, Spring of every year", "credits": "Variable from 1 to 12", "description": "Study of Russian language, culture, and literature at an approved site in the Russia. Exposure to Russian life and current events. Interaction with the Russian people.", "prerequisite": "RUS 102", "restrictions": "Not open to sophomores. Approval of department."}, "RUS499": {"name": " Senior Thesis Research", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 6", "description": "An individual research project supervised by a faculty member that demonstrates the student's ability to do independent research and submit or present a major paper."}}}