{"code": "SOC", "name": "Sociology", "courses": {"SOC100": {"name": " Introduction to Sociology", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": " 4", "description": "Nature of sociological inquiry. Concepts and principles of sociology. Institutional features of modern society. Structure and dynamics of social organizations."}, "SOC131": {"name": " Social Problems", "semester": "Fall of every year", "credits": " 3", "description": "The role of social movements, the legal system, public policy and opinion in the resolution of poverty, crime, racism, sexism, and ecological problems."}, "SOC161": {"name": " International Development and Change", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Global issues of development and change. Population growth, poverty, structural inequalities, environmental degradation, social conflicts, social movements. Alternative development strategies and future perspectives."}, "SOC214": {"name": " Social Inequality", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": " 3", "description": "Theories of structural social inequality. Formation and change of inequalities among social classes and class structures, gender, and race. Inequalities and their interactions in modern societies. Consequences of inequalities. Current inequality trends.", "alias": "SOC 330"}, "SOC215": {"name": " Race and Ethnicity", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": " 3", "description": "Racial and ethnic problems in contemporary society. Prejudice, discrimination, conflict, and racial and ethnic identity and segregation in western and non-western societies."}, "SOC216": {"name": " Sex, Gender, and Sexuality", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": " 3", "description": "Social structural and social psychological perspectives on gender identity, sex category, and sexuality. Issues related to gender identity and sexuality in selected societal institutions and across cultures."}, "SOC220": {"name": " Criminology", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Introduction to the socio-legal foundation of crime. Crime typology and measurement procedures. Theory and public policy. Societal responses to crime and criminals.", "restrictions": "Open to students in the Peace and Justice Studies Minor or in the Sociology Major or in the Youth and Society Minor or in the Criminal Justice Major or in the Law, Justice, and Public Policy Minor or in the Conservation and Environmental Law Enforcement Minor or approval of school."}, "SOC241": {"name": " Social Psychology", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Relationship of individuals to their social environment. Social influences on personality, attitudes and behavior.", "exclude": "PSY 235"}, "SOC252": {"name": " Introduction to Environmental Sociology", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Key concepts, theories, methods, and findings in environmental sociology."}, "SOC281": {"name": " Social Research Methods", "semester": "Fall of every year", "credits": " 4", "description": "Design and execution of social research. Ethics in research. Conceptualization, measurement, sampling, data collection, validity and reliability. Descriptive analysis. Presentation of conclusions."}, "SOC282": {"name": " Quantitative Analysis for Social Research", "semester": "Spring of every year", "credits": " 4", "description": "Experiments. Selected quantitative techniques of data analysis including regression and analysis of variance.", "prerequisite": "SOC 281"}, "SOC310": {"name": " Global Migration", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Theory and research on the causes and consequences of human migration. Sociological, social psychological, historical, and demographic perspectives."}, "SOC315": {"name": " Family and Society", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": " 3", "description": "Family development. Diversity of family form and organization in relation to personality, class, race, and gender."}, "SOC316": {"name": " Youth and Society", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": " 3", "description": "Behavioral analysis of youth. Youth subcultures. Youth at risk. Social change and youth behavior."}, "SOC319": {"name": " Introduction to Earth System Science", "semester": "Fall of every year", "credits": " 3", "description": "Systems approach to Earth as an integration of geochemical, geophysical, biological and social components. Global dynamics at a variety of spatio-temporal scales. Sustainability of the Earth system."}, "SOC322": {"name": " Sociology of Work", "semester": "Fall of every year", "credits": " 3", "description": "Social significance of work. Forces changing contemporary occupational structure. Career patterns. Occupational status and mobility. Social organization of various types of work. Gender and work. Social influence on work attitudes."}, "SOC325": {"name": " Play, Games, and Sports", "semester": "Fall of every year", "credits": " 3", "description": "How we learn about ourselves through playing, games, and participating in sports. Game development, and rule development and implementation in games and sports. Role of the media in determining appropriate behavior."}, "SOC331": {"name": " Political Sociology", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Social power theories, dynamics, and structures. The economy and the polity. Power elites and democracy. Social bases of political behavior and participation. Sociopolitical movements."}, "SOC350": {"name": " Society and Mental Health", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Social determinants of mental health and mental illness. International and cross-cultural comparison of mental health and mental illness.", "prerequisite": "Completion of Tier I Writing Requirement"}, "SOC351": {"name": " Gendered Violence and Intersections of Power (Interim Change)", "semester": "Summer of every year", "credits": " 3", "description": "Gendered violence from an intersectional perspective. Ways intersecting social statuses such as race, class, and sexuality shape gendered experiences."}, "SOC360": {"name": " Migration and Social Change (Interim New)", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Survey of contemporary theory and research on migration and social change.", "prerequisite": "Completion of Tier I Writing Requirement"}, "SOC361": {"name": " Contemporary Communities", "semester": "Spring of every year", "credits": " 3", "description": "Approaches to the study of contemporary communities. Differential levels of community complexity. Social problems and dynamics of community change and development in local settings and their relation to external institutions."}, "SOC362": {"name": " Developing Societies", "semester": "Fall of every year", "credits": " 3", "description": "Dynamics of agricultural and industrial transformations in developing nations. Structural problems, behavioral patterns, and institutional changes at local and societal levels. Socioeconomic interdependencies in the world system."}, "SOC363": {"name": " Rural Sociology", "semester": "Fall of every year", "credits": " 3", "description": "Overview of rural societies in transition. Adjustments of rural people, families, and communities to societal changes. Survival strategies. Social aspects of contemporary agriculture and rural development processes."}, "SOC368": {"name": " Science, Technology, and Society", "semester": "Fall of every year, Spring of every year", "credits": " 4", "description": "Role of science and technology in social change. Values and ethics in contemporary perspectives, controversies, and cases. Science and technology as forms of knowledge.", "restrictions": "Not open to freshmen or sophomores."}, "SOC375": {"name": " Urban Sociology", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Social theories and research on urban development, organization, and change. Urban social life. Sociological aspects of urban planning and redevelopment."}, "SOC412": {"name": " Animals, People, and Nature", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Sociological overview of the intersecting roles of animals, culture, and nature in contemporary society.", "restrictions": "Not open to freshmen."}, "SOC416": {"name": " Global Regions", "semester": "Fall of every year", "credits": " 3", "description": "Overview of a specified global region within a context of global transformations.", "restrictions": "Not open to freshmen."}, "SOC424": {"name": " Organizations and Society", "semester": "Spring of every year", "credits": " 3", "description": "Formal and informal organizations and bureaucracies. Interorganizational relationships. Structural and procedural problems of organizations. Utility of analytical models of organizations.", "restrictions": "Not open to freshmen or sophomores."}, "SOC427": {"name": " Environmental Toxicology and Society", "semester": "Spring of odd years", "credits": " 3", "description": "Impact of environmental chemicals on health and modern society. Cellular and organ functions and their interface with the environment. Limitations of scientific investigation and environmental regulations."}, "SOC447": {"name": " Community Economic Development", "semester": "Spring of every year", "credits": " 3", "description": "Theories, frameworks, policies, concepts, principles, models, and skills for community economic development. Community participation in local development initiatives.", "prerequisite": "EC 201 or EC 202", "alias": "ESA 470, RD 470"}, "SOC451": {"name": " Dynamics of Population", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Size, distribution, and composition of population by age and sex. Theories of the effect of fertility, mortality, and migration on population structures. Successful and unsuccessful population policies.", "restrictions": "Not open to freshmen."}, "SOC452": {"name": " Advanced Seminar in Environmental Sociology", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Environmental conditions and social organization. Social relations and connection to resource use, pollution, energy, and risks. Growth and limits to growth. Environmental attitudes, actions, movements, and regulation.", "restrictions": "Not open to freshmen."}, "SOC463": {"name": " Food Fight: Politics of Food", "semester": "Spring of odd years", "credits": " 3", "description": "Social power and its influence in US agrifood system. Structural and cultural issues related to politics of food consumption, production, labor, processing, retail, techno-science, policy, resistance movements.", "prerequisite": "CSUS 200 or SOC 100", "restrictions": "Not open to freshmen or sophomores."}, "SOC475": {"name": " Health and Society", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Social causes of Health and disease. Health disparities related to race-ethnicity, socioeconomic status, gender and family. Organizations, professions and institutions of health care. Medical standards and evidence. Global public health.", "restrictions": "Not open to freshmen or sophomores."}, "SOC477": {"name": " Visual Sociology", "semester": "Fall of every year", "credits": " 3", "description": "Use of visual images to understand power, ideology, politics, and cultural constructions.", "restrictions": "Not open to freshmen."}, "SOC478": {"name": " Climate Change and Society", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Climate change as a societal challenge. The nature of climate change, its role in human history, and vulnerabilities of coupled human and natural systems to climate change.", "prerequisite": "Completion of Tier I Writing Requirement"}, "SOC480": {"name": " Advanced Research Methods in Sociology", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Advanced training and hands-on practice in methodologies commonly used in specific sub-fields of sociology.", "prerequisite": "SOC 281 or approval of department", "restrictions": "Open to sophomores or juniors or seniors."}, "SOC481": {"name": " Social Movements and Collective Identities", "semester": "Fall of every year", "credits": " 3", "description": "How social movements emerge, change, and are challenged by others. Identity issues within social movements.", "restrictions": "Not open to freshmen."}, "SOC488": {"name": " Sociological Theory (W)", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Development of sociological theory. Problems of theory construction. Current theoretical perspectives.", "prerequisite": "Completion of Tier I Writing Requirement"}, "SOC490": {"name": " Special Topics in Sociology", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Experimental courses and courses taught by visiting scholars.", "restrictions": "Open to students in the Department of Sociology."}, "SOC496": {"name": " Individual Readings", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 3", "description": "Supervised individual readings and study in sociology.", "restrictions": "Approval of department."}, "SOC497": {"name": " Individual Research", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 3", "description": "Supervised individual research in sociology.", "restrictions": "Approval of department."}, "SOC498": {"name": " Sociology Internship", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 3", "description": "Practical experience with a public, private, or nonprofit organization.", "restrictions": "Approval of department."}, "SOC499": {"name": " Social Issues and Change in Contemporary Society (W)", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Selected major social problems in contemporary societies. Sources and consequences of social change. Application of sociological theory to selected cases.", "prerequisite": "Completion of Tier I Writing Requirement", "restrictions": "Not open to freshmen."}, "SOC801": {"name": " Global Transformations", "semester": "Fall of every year", "credits": " 3", "description": "The impact of political, economic, and cultural globalization on states, cities, and local communities."}, "SOC815": {"name": " Classical Sociological Theory", "semester": "Fall of every year", "credits": " 3", "description": "Nineteenth- and early twentieth-century sociological theory from Marx to Pareto in socio-historical context. Development of contemporary sociology theory and research from the classics."}, "SOC816": {"name": " Contemporary Sociological Theory", "semester": "Spring of every year", "credits": " 3", "description": "Theories and conceptual schemes of contemporary social theorists. Relevance for sociological research."}, "SOC820": {"name": " Contemporary Sociological Research in the Family", "semester": "Fall of odd years", "credits": " 3", "description": "Family structure. Family and marital attitudes. Family and social policy."}, "SOC833": {"name": " Gender and Power", "semester": "Spring of even years", "credits": " 3", "description": "Theory and research on gender and sexual inequality in socially-based systems of production and reproduction. Global and national gender inequalities in selected institutional settings."}, "SOC836": {"name": " Race, Politics, and Social Structure", "semester": "Fall of odd years", "credits": " 3", "description": "National and international perspectives on the structures and manifestations of racial inequality. Concepts, methods, and quantitative and qualitative analysis."}, "SOC839": {"name": " Structural Inequalities and Families", "semester": "Fall of odd years", "credits": " 3", "description": "Macrostructural forces and family life. Role of class, race, and gender."}, "SOC840": {"name": " Animals and Social Transformations", "semester": "Spring of every year", "credits": " 3", "description": "Historical examination of the human-animal relationships."}, "SOC852": {"name": " Migration and Social Change", "semester": "Fall of odd years, Spring of even years", "credits": " 3", "description": "Theory and research on the causes and consequences of human migration. Sociological, social psychological, and demographic perspectives."}, "SOC858": {"name": " Gender, Justice and Environmental Change : Issues and Concepts", "semester": "Fall of every year", "credits": " 3", "description": "Issues and concepts related to gender, ecology, and environmental studies. Key debates and theoretical approaches to addressing environmental issues from a gender and social justice perspective. Gender and environment issues and processes from a global perspective."}, "SOC859": {"name": " Gender, Justice, and Environmental Change: Methods and Application", "semester": "Spring of every year", "credits": " 3", "description": "Methods and case studies related to gender, ecology, and environmental studies. Methodological and fieldwork issues from a feminist perspective in international and intercultural contexts. Qualitative and quantitative methods for integrating social and environmental data."}, "SOC865": {"name": " Environmental Sociology", "semester": "Fall of odd years", "credits": " 3", "description": "Effects of attitudes, social structure, and policy on the causes and consequences of natural resource depletion, pollution, energy use, growth, and technological risks. Response of movements and policies to environmental problems."}, "SOC869": {"name": " Community and Conservation", "semester": "Fall of even years, Summer of even years", "credits": " 3", "description": "Use of experiential, participatory, field-based mode of inquiry to develop understanding of social and cultural issues associated with conservation. Understanding of different social positions and perspectives."}, "SOC873": {"name": " Social Organization of Health and Medicine", "semester": "Spring of every year", "credits": " 3", "description": "Organization, delivery, and financing of health care. Public health systems, professional training and associations, and technology. International comparisons."}, "SOC881": {"name": " Analysis of Social Data I", "semester": "Fall of every year", "credits": " 3", "description": "Applications of statistical techniques to social science data. Multiple regression. SPSS. Interpretation, strengths, and weaknesses of various statistical practices.", "restrictions": "Open to graduate students in the Department of Sociology."}, "SOC882": {"name": " Analysis of Social Data II", "semester": "Spring of every year", "credits": " 3", "description": "Applications of multiple regression, path analysis, and factor analysis to social science data. Interpretation, strengths, and weaknesses of commonly used statistical practices.", "restrictions": "Open to graduate students in the Department of Sociology."}, "SOC883": {"name": " Multi-Equation Quantitative Models", "semester": "Spring of every year", "credits": " 3", "description": "Quantitative methodology", "prerequisite": "SOC 881 and SOC 882 or approval of department", "restrictions": "Open to graduate students in the Department of Sociology and open to graduate students in the Environmental Science and Policy Specialization or approval of department."}, "SOC884": {"name": " Applied Longitudinal Data Analysis", "semester": "Fall of every year", "credits": " 3", "description": "Application of statistical methods to analyze data in a longitudinal design.", "prerequisite": "SOC 881 and SOC 882"}, "SOC885": {"name": " Methods of Sociological Inquiry", "semester": "Spring of every year", "credits": " 3", "description": "Methods of social science. Comparison of methods. Philosophy of science and social science. Epistemology.", "restrictions": "Open only to graduate students in the Sociology major or approval of department."}, "SOC890": {"name": " Individual Readings", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 9", "description": "Faculty-supervised readings in Sociology.", "restrictions": "Approval of department."}, "SOC897": {"name": " Seminar in Feminist Theories, Epistemologies, and Pedagogy", "semester": "Spring of odd years", "credits": " 3", "description": "Foundational knowledge, theory, epistemology, and pedagogy in women’s and gender studies from a multi-disciplinary, global perspective."}, "SOC899": {"name": " Master's Thesis Research", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 9", "description": "Master's thesis research."}, "SOC931": {"name": " Topics in Structural Inequality", "semester": "Fall of even years", "credits": " 3", "description": "Current research on socioeconomic class, gender inequality, racial and ethnic inequality, power structures, social conflict, urban dynamics, or social change."}, "SOC950": {"name": " Topics in Rural and Environmental Studies", "semester": "Spring of even years", "credits": " 3", "description": "Adoption of innovations, consolidation of food production enterprises, or community response to farm crises."}, "SOC970": {"name": " Topics in Wellbeing and Health", "semester": "Spring of even years", "credits": " 3", "description": "Topics such as family work and stress, risk and uncertainty, social epidemiology, and life course."}, "SOC977": {"name": " Social Epidemiology", "semester": "Fall of even years", "credits": " 3", "description": "Introduction to the field of social epidemiology and the social determinants of health. Contemporary theoretical and methodological issues in social epidemiology.", "prerequisite": "EPI 810 or approval of department", "restrictions": "Open to graduate students in the Department of Epidemiology and Biostatistics or approval of department."}, "SOC985": {"name": " Qualitative Field Research", "semester": "Fall of every year", "credits": " 3", "description": "Qualitative research methods. Participant observation, interview, and field documents. Design, data gathering, and analysis.", "restrictions": "Open only to graduate students in Sociology."}, "SOC986": {"name": " Survey Research Principles", "semester": "Spring of every year", "credits": " 3", "description": "Design, analysis, sampling, questionnaire construction, interviewing, and data processing."}, "SOC989": {"name": " Topics in Sociological Methodology", "semester": "Fall of odd years", "credits": " 3", "description": "Evaluation research. Experimental or comparative research methods."}, "SOC995": {"name": " Professional Training Seminar", "semester": "Spring of every year", "credits": " 3", "description": "Development of knowledge and skills for the profession of sociology. Course design, teaching techniques, acquiring grants, outreach activities, collaboration with community and government, publishing and networking. Preparation of course syllabi, teaching philosophy, research agenda and job application.", "restrictions": "Open to graduate students in the Department of Sociology."}, "SOC999": {"name": " Doctoral Dissertation Research", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 12", "description": "Doctoral dissertation research."}}}