{"code": "STT", "name": "Statistics and Probability", "courses": {"STT180": {"name": " Introduction to Data Science", "semester": "Fall of every year, Spring of every year", "credits": " 4", "description": "Pervasiveness and utility of data in modern society. Obtaining and managing data. Summarizing and visualizing data. Ethical issues in data science. Communication with data. Fundamentals of probability and statistics.", "prerequisite": "(MTH 124 or concurrently) or (MTH 132 or concurrently) or (MTH 152H or concurrently) or (LB 118 or concurrently)", "exclude": "STT 301"}, "STT191": {"name": " Selected Topics in Statistics", "semester": "Fall of every year, Spring of every year", "credits": "Variable from 1 to 4", "description": "Topics in statistics and probability selected to complement existing courses."}, "STT200": {"name": " Statistical Methods", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": " 3", "description": "Data analysis, probability models, random variables, estimation, tests of hypotheses, confidence intervals, and simple linear regression.", "prerequisite": "(MTH 101 or MTH 102 or MTH 103 or MTH 110 or MTH 116 or MTH 124 or MTH 132 or LB 118) or designated score on Mathematics Placement test", "restrictions": "Open to undergraduate students.", "exclude": "STT 201 or STT 421"}, "STT201": {"name": " Statistical Methods", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": " 4", "description": "Probability and statistics with computer applications. Data analysis, probability models, random variables, tests of hypotheses, confidence intervals, simple linear regression. Weekly lab using statistical software.", "prerequisite": "(MTH 101 or MTH 102 or MTH 103 or MTH 110 or MTH 116 or MTH 124 or MTH 132 or LB 118) or designated score on Mathematics Placement test", "restrictions": "Open to undergraduate students.", "exclude": "STT 200 or STT 421"}, "STT224": {"name": " Introduction to Probability and Statistics for Ecologists", "semester": "Spring of every year", "credits": " 3", "description": "Probability and statistics with computer applications for the analysis, interpretation and presentation of ecological data. Data analysis, probability models, random variables, estimation, confidence intervals, test of hypotheses, and simple linear regression with applications to ecology.", "prerequisite": "MTH 103 or MTH 116 or (MTH 124 or concurrently) or (MTH 132 or concurrently) or (MTH 152H or concurrently) or (LB 118 or concurrently)", "alias": "FW 324", "exclude": "STT 231"}, "STT231": {"name": " Statistics for Scientists", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": " 3", "description": "Calculus-based course in probability and statistics. Probability models, and random variables. Estimation, confidence intervals, tests of hypotheses, and simple linear regression with applications in sciences.", "prerequisite": "MTH 124 or MTH 132 or MTH 152H or LB 118", "restrictions": "Open to students in the College of Natural Science and open to students in the Lyman Briggs College.", "alias": "STT 331"}, "STT250": {"name": " Statistics and Probability for K-8 Teachers", "semester": "Spring of every year", "credits": " 4", "description": "Data collection and analysis. Statistics, probability models. Decision-making in the presence of variability. Computer software relevant for teaching practice.", "prerequisite": "MTH 103", "restrictions": "Open to undergraduate students in the College of Education or approval of department."}, "STT290": {"name": " Topics in Statistics and Probability", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 3", "description": "Individualized study of selected topics.", "restrictions": "Approval of department."}, "STT301": {"name": " Computational Methods for Data Science", "semester": "Fall of every year", "credits": " 3", "description": "Obtaining and managing data using statistical software. Data visualization and graphics. Special challenges in working with high-dimensional data.", "prerequisite": "(MTH 132 or LB 118 or MTH 152H) and (STT 200 or STT 201 or STT 231 or STT 315 or STT 421 or STT 441)"}, "STT315": {"name": " Introduction to Probability and Statistics for Business", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": " 3", "description": "A first course in probability and statistics primarily for business majors. Data analysis, probability models, random variables, confidence intervals, and tests of hypotheses with business applications.", "prerequisite": "MTH 124 or MTH 132 or MTH 152H or LB 118"}, "STT317": {"name": " Market Analytics", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": " 3", "description": "Descriptive and predictive market analytics. Applications of analytics to real-world business decisions. Assessment and manipulation of large datasets. Application of statistical techniques to convert data into useable information. Communication of findings in a meaningful way.", "prerequisite": "STT 200 or STT 201 or STT 315 or STT 351", "restrictions": "Open to sophomores or juniors or seniors in the Accounting major or in the Business - Admitted major or in the Finance Major or in the Human Resource Management Major or in the Management Major or in the Supply Chain Management Major or in the Marketing Major or in the Applied Engineering Sciences Major.", "alias": "MSC 317"}, "STT351": {"name": " Probability and Statistics for Engineering", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": " 3", "description": "Probability models and random variables. Estimation, confidence intervals, tests of hypotheses, simple linear regression. Applications to engineering.", "prerequisite": "MTH 234 or MTH 254H or LB 220", "exclude": "STT 430"}, "STT380": {"name": " Probability and Statistics for Data Science", "semester": "Fall of every year, Spring of every year", "credits": " 4", "description": "Fundamental concepts and methods in probability and statistics from a data science perspective.", "prerequisite": "((MTH 234 or concurrently) or (MTH 254H or concurrently) or (LB 220 or concurrently)) and (MTH 314 or concurrently)"}, "STT381": {"name": " Fundamentals of Data Science Methods", "semester": "Fall of every year, Spring of every year", "credits": " 4", "description": "Data science methods, including unsupervised learning and supervised learning, feature extraction, dimension reduction, clustering, regression and classification.", "prerequisite": "(STT 180 and MTH 314 and CMSE 201 and STT 380) or (STT 180 and MTH 314 and CMSE 201 and STT 441 and STT 442)"}, "STT404": {"name": " Introduction to Machine Learning", "semester": "Fall of every year", "credits": " 3", "description": "Core principles and techniques of all machine learning including model design and programming algorithms.", "prerequisite": "(CSE 331) and (STT 351 or STT 380 or STT 430 or STT 441)", "restrictions": "Open to juniors or seniors in the College of Engineering or in the Computer Science Minor or in the Lyman Briggs Computer Science Coordinate Major or in the Lyman Briggs Computer Science Major."}, "STT421": {"name": " Statistics I", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": " 3", "description": "Basic probability, random variables, and common distributions. Estimation and tests for one-, two-, and paired sample problems. Introduction to simple linear regression and correlation, one-way ANOVA.", "prerequisite": "MTH 103 or MTH 110 or MTH 116", "exclude": "STT 200 or STT 201"}, "STT422": {"name": " Statistics II", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": " 3", "description": "Goodness of fit and other non-parametric methods. Linear models including multiple regression and ANOVA for simple experimental designs.", "prerequisite": "STT 421 or STT 441", "exclude": "STT 464"}, "STT430": {"name": " Introduction to Probability and Statistics", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": " 3", "description": "Calculus-based probability and statistics with applications. Discrete and continuous random variables and their expectations. Point and interval estimation, tests of hypotheses, and simple linear regression.", "prerequisite": "(MTH 234 or concurrently) or (MTH 254H or concurrently) or (LB 220 or concurrently)", "exclude": "STT 351"}, "STT441": {"name": " Probability and Statistics I: Probability", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": " 3", "description": "Probability, conditional probability and independence. Random variables. Discrete, continuous, univariate, and multivariate distributions. Expectation and its properties, moment generating functions. Law of large numbers, central limit theorem.", "prerequisite": "MTH 234 or MTH 254H or LB 220 or approval of college"}, "STT442": {"name": " Probability and Statistics II: Statistics", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Parameter estimation, sampling distributions, confidence intervals, hypothesis testing, simple and multiple regression, analysis of variance. Time series models, data analysis and forecasting", "prerequisite": "STT 441 and (MTH 309 or MTH 314 or MTH 317H or MTH 415)"}, "STT455": {"name": " Actuarial Models I", "semester": "Fall of every year", "credits": " 3", "description": "Stochastic models used in insurance. Survival distributions, life insurance, life annuities, benefit premiums, benefit reserves, and analysis of benefit reserves.", "prerequisite": "STT 441 and MTH 360"}, "STT456": {"name": " Actuarial Models II", "semester": "Spring of every year", "credits": " 3", "description": "Continuation of STT 455. Benefit reserves. Multiple life functions. Multiple decrement models and their applications. Elements of stochastic processes for actuaries including Markov chains and Poisson processes", "prerequisite": "STT 455"}, "STT458": {"name": " Financial Mathematics for Actuaries II", "semester": "Fall of every year", "credits": " 3", "description": "Evaluate and construct interest rate models. Rational valuation of derivative securities using put-call parity and calculation of European and American options. Risk management techniques using the method of delta-hedging.", "prerequisite": "MTH 361 and STT 441"}, "STT459": {"name": " Construction and Evaluation of Actuarial Models", "semester": "Spring of every year", "credits": " 3", "description": "Severity, frequency, and aggregate models. Construction of empirical models. Parametric statistical methods. Credibility analysis. Simulation methods.", "prerequisite": "STT 442"}, "STT461": {"name": " Computations in Probability and Statistics", "semester": "Spring of every year", "credits": " 3", "description": "Computer algorithms for evaluation, simulation and visualization. Sampling and prescribed distributions. Robustness and error analysis of procedures used by statistical packages. Graphics for data display, computation of probabilities and percentiles.", "prerequisite": "(STT 441 and CSE 231) and (MTH 309 or MTH 314 or MTH 317H or MTH 415)"}, "STT464": {"name": " Statistics for Biologists", "semester": "Fall of every year", "credits": " 3", "description": "Biological random variables. Estimation of population parameters. Testing hypotheses. Linear correlation and regression. Analyses of counted and measured data to compare several biological groups including contingency tables and analysis of variance.", "prerequisite": "MTH 103 or MTH 110 or MTH 116 or MTH 132"}, "STT465": {"name": " Bayesian Statistical Methods", "semester": "Fall of every year", "credits": " 3", "description": "Probability, belief, and exchangeability. Objective, subjective, and empirical Bayes approaches. Applications to one-parameter models, linear regression models, and multivariate normal models. Hierarchical modeling. Computational methods.", "prerequisite": "STT 442"}, "STT467": {"name": " Insurance Operations", "semester": "Spring of every year", "credits": " 3", "description": "Regulation, marketing and distribution, underwriting, risk control, premium auditing, the claim function, actuarial operations, and reinsurance.", "prerequisite": "(ACC 230 and FI 321 and MTH 360) and completion of Tier I writing requirement"}, "STT468": {"name": " Predictive Analytics", "semester": "Spring of every year", "credits": " 3", "description": "Predictive analytics for insurance business and risk management with an emphasis on the use of machine learning tools.", "prerequisite": "(CSE 231) and (MTH 235 or MTH 340) and MTH 360 and STT 442"}, "STT481": {"name": " Capstone in Statistics (W)", "semester": "Spring of every year", "credits": " 3", "description": "Selected readings and projects illustrating special problems encountered by statisticians in their roles as consultants, educators, researchers and analysts.", "prerequisite": "(STT 442 or approval of department) and completion of Tier I writing requirement", "restrictions": "Open to seniors in the Department of Statistics and Probability or approval of department."}, "STT490": {"name": " Directed Study of Statistical Problems", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 3", "description": "Individualized study of selected topics.", "restrictions": "Open to seniors in the Department of Statistics and Probability. Approval of department."}, "STT492": {"name": " Selected Topics in Data Science", "semester": "Fall of every year, Spring of every year", "credits": "Variable from 1 to 4", "description": "Topics selected to supplement and enrich existing courses in Data Science.", "restrictions": "Approval of department."}, "STT495": {"name": " Experiential Learning in Data Science (W)", "semester": "Fall of every year, Spring of every year", "credits": " 4", "description": "Team-based data science projects on realistic, large-scale data.", "prerequisite": "(CSE 232 and CMSE 382) and completion of Tier I writing requirement", "restrictions": "Open to seniors."}, "STT800": {"name": " Quantitative Foundations for Machine Learning", "semester": "Fall of every year", "credits": " 3", "description": "Advanced calculus and linear algebra tools for machine learning algorithms.", "prerequisite": "MTH 132 and MTH 133 or approval of department"}, "STT801": {"name": " Design of Experiments", "semester": "Fall of even years", "credits": " 3", "description": "Blocking and randomization. Split-plot, latin square and factorial designs. Fractional factorial designs, aliasing and confounding of effects. Mixture and central composite designs and response surface exploration. Clinical trials."}, "STT802": {"name": " Statistical Computation", "semester": "Fall of even years", "credits": " 3", "description": "Computational techniques commonly used in Statistics. Matrix decompositions. Least squares and Least Absolute Deviations. Solution of nonlinear equations. Optimization techniques including the EM algorithm and constrained optimization. Numerical integration. Generation of random numbers and stochastic simulation. Implementation in statistical software."}, "STT804": {"name": " Statistical Consulting and Practice", "semester": "Fall of every year", "credits": " 3", "description": "Statistical consulting and the practical aspects of the consulting environment. Ethics. Communication skills. Data management, and statistical methods.", "restrictions": "Open to master's students in the College of Natural Science. Approval of department."}, "STT805": {"name": " Statistical Modeling for Business Analytics", "semester": "Summer of every year", "credits": " 3", "description": "Low dimensional data visualization. Simple linear regression. Regression diagnostics. Analysis of variance. Multiple linear regression. Regression model building. Variable selection. Categorical data. Logistic regression. Proportional odds model. Introduction to time series.", "restrictions": "Open to master's students in the Business Analytics Major."}, "STT808": {"name": " Biostatistics I", "semester": "Fall of every year", "credits": " 3", "description": "Applications of probability and statistics in the applied health sciences. Probability distributions, estimation and tests for one-, two-, and paired samples, linear regression, correlation, and ANOVA. Use of statistical software. Critical appraisal of statistical methods in the biomedical literature.", "restrictions": "Open to master's students or doctoral students in the Epidemiology major or approval of department.", "alias": "STT 425"}, "STT809": {"name": " Biostatistics II", "semester": "Spring of every year", "credits": " 3", "description": "Analysis of categorical data in epidemiologic studies. Contingency tables and logistic regression.", "prerequisite": "EPI 808", "restrictions": "Open to master's students or doctoral students in the Epidemiology major or approval of department.", "alias": "STT 426"}, "STT810": {"name": " Mathematical Statistics for Data Scientists (Interim New)", "semester": "Fall of every year, Summer of every year", "credits": " 3", "description": "Random variables; Probability distributions; transformation of variables; maximum likelihood estimation; interval estimation; hypothesis testing", "restrictions": "Not open to freshmen or sophomores or juniors and not open to graduate students in the Department of Statistics and Probability and open to seniors. Approval of department."}, "STT811": {"name": " Applied Statistical Modeling for Data Scientists (Interim New)", "semester": "Spring of every year, Summer of every year", "credits": " 3", "description": "Data Visualization; Linear regression; Analysis of variance; Logistic regression; Generalized linear models; Variable selection; Categorical data analysis; Models for design of experiments; models for time series data", "restrictions": "Not open to freshmen or sophomores or juniors and not open to graduate students in the Department of Statistics and Probability and open to seniors in the Department of Statistics and Probability. Approval of department."}, "STT812": {"name": " Statistical Learning and Data Analysis (Interim New)", "semester": "Spring of every year, Summer of every year", "credits": " 3", "description": "Low dimensional data visualization; Linear Regression;Binary Regression; Linear discriminant analysis; Probabilistic classification; Model selection via regularization; LASSO; Non-parametric smoothing; CART; MART; support vector machine; neural network; clustering; random forest", "prerequisite": "(STT 441 and STT 442) or (STT 810 and STT 811) or (STT 863 and STT 864)", "restrictions": "Not open to freshmen or sophomores or juniors and not open to graduate students in the Department of Statistics and Probability and open to seniors in the Department of Statistics and Probability."}, "STT814": {"name": " Advanced Statistics for Biologists", "semester": "Spring of every year", "credits": " 4", "description": "Concepts of reducing experimental error for biological and agricultural research. Covariance, randomized block designs, latin squares, split plots, repeated-measures designs, regression applications, and response surface designs. Analyses using statistical software."}, "STT820A": {"name": " Econometrics IA", "semester": "Fall of every year", "credits": " 3", "description": "Statistical tools for econometrics. Applications of statistical tools,including probability distributions, estimation, hypothesis testing, and maximum likelihood to econometric problems.", "restrictions": "Open only to doctoral students in the Economics major or the Department of Agricultural Economics or the Business Administration major or approval of department."}, "STT821A": {"name": " Cross Section and Panel Data Econometrics I", "semester": "Fall of every year", "credits": " 3", "description": "Analyses of systems of equations, panel data models, instrumental variables and generalized method of moments, M-estimation, quantile regression, maximum likelihood estimation, binary and multinomial response models, Tobit and two-part models, and other selected topics.", "prerequisite": "EC 820B", "alias": "EC 821"}, "STT821B": {"name": " Cross Section and Panel Data Econometrics II", "semester": "Spring of every year", "credits": " 3", "description": "Analyses of quasi-maximum likelihood estimation, count data models, fractional response models, duration models, sample selection and attrition, stratified sampling, estimating treatment effects, stochastic frontier models, and other advanced topics.", "prerequisite": "EC 821A"}, "STT822A": {"name": " Time Series Econometrics I", "semester": "Fall of every year", "credits": " 3", "description": "Analyses of time series regression, stationary time series analysis, ARMA models, Wold decomposition, spectral analysis, vector autoregressions, generalized method of moments, functional central limit theorem, nonstationary time series, unit root processes, cointegration, and other advanced topics.", "prerequisite": "EC 820B", "alias": "EC 822"}, "STT822B": {"name": " Time Series Econometrics II", "semester": "Spring of every year", "credits": " 3", "description": "Analyses of multivariate time series, time series volatility models, long memory, nonlinear time series models, and other advanced topics.", "prerequisite": "EC 822A"}, "STT825": {"name": " Sample Surveys", "semester": "Fall of every year", "credits": " 3", "description": "Application of statistical sampling theory to survey designs. Simple random, stratified, and systematic samples. Sub-sampling, double sampling. Ratio and regression estimators."}, "STT843": {"name": " Multivariate Analysis", "semester": "Spring of even years", "credits": " 3", "description": "Multivariate normal distribution, tests of hypotheses on means, multivariate analysis of variance. Discriminant analysis. Principal components. Factor analysis. Analysis of frequency data.", "exclude": "FW 850"}, "STT844": {"name": " Time Series Analysis", "semester": "Spring of odd years", "credits": " 3", "description": "Stationary time series. Autocorrelation and spectra. ARMA and ARIMA processes"}, "STT847": {"name": " Analysis of Survival Data", "semester": "Spring of odd years", "credits": " 3", "description": "Analysis of lifetime data. Estimation of survival functions for parametric and nonparametric models. Censored data. The Cox proportional hazards model. Accelerated failure time models. Frailty models. Use of statistical software packages."}, "STT849": {"name": " Applied Bayesian Inference using Monte Carlo Methods for Quantitative Biologists", "semester": "Fall of even years", "credits": " 3", "description": "Applications of Bayesian inference using software in quantitative biology and genetics. Hierarchical and non-hierarchical models. Model checking, model selection and model comparison. Markov chain Monte Carlo methods.", "restrictions": "Not open to undergraduate students."}, "STT850": {"name": " Applied Multivariate Statistical Methods", "semester": "Spring of even years", "credits": " 4", "description": "Application of multivariate methods to research problems. Hotelling's T-test, profile analysis, discriminant analysis, canonical correlation, principal components, principal coordinates, correspondence analysis, and cluster analysis.", "alias": "FOR 976"}, "STT855": {"name": " Statistical Genetics", "semester": "Fall of odd years", "credits": " 3", "description": "Probabilistic and statistical methods for genetic linkage and association studies. Quantitative trait locus mapping."}, "STT860": {"name": " Advanced Inference for Biostatistics", "semester": "Fall of every year", "credits": " 3", "description": "Statistical inference problems with biomedical applications.", "prerequisite": "STT 861 and (STT 862 or concurrently) or approval of department", "restrictions": "Open to doctoral students in the Department of Epidemiology and Biostatistics or approval of department."}, "STT861": {"name": " Theory of Probability and Statistics I", "semester": "Fall of every year", "credits": " 3", "description": "Probability models, random variables and vectors. Special distributions including exponential family. Expected values, covariance matrices, moment generating functions. Convergence in probability and distribution. Weak Law of Large Numbers and Lyapunov Central Limit Theorem."}, "STT862": {"name": " Theory of Probability and Statistics II", "semester": "Spring of every year", "credits": " 3", "description": "Statistical inference", "prerequisite": "STT 861"}, "STT863": {"name": " Statistical Methods I", "semester": "Fall of every year", "credits": " 3", "description": "Introduction to the general theory of linear models. Application of regression models. Interval estimation, prediction and hypothesis testing. Contrasts; model diagnostics; model selection. LASSO type and high dimensional variable selection. Introduction to Linear mixed effect models.", "alias": "STT 841"}, "STT864": {"name": " Statistical Methods II", "semester": "Spring of every year", "credits": " 3", "description": "Generalized linear models(GLMs). Deviance and residual analysis in GLMs. Analysis of two-way and three-way contingency tables. Logistic regression. Log-linear models. Multicategorical response models. Poisson regression. Introduction to generalized estimating equations. Introduction to longitudinal data. Bayesian analysis using WinBUGS.", "prerequisite": "STT 863"}, "STT866": {"name": " Spatial Data Analysis", "semester": "Fall of every year", "credits": " 4", "description": "Theory and techniques for statistical analysis of point patterns, spatially continuous data, and data in spatial zones.", "alias": "GEO 466"}, "STT867": {"name": " Linear Model Methodology", "semester": "Fall of every year", "credits": " 3", "description": "Properties of the multivariate normal distribution, Cochran's Theorem, simple and multiple linear regression models, Gauss-Markov Theorem, best linear unbiased prediction, one- and two-way ANOVA models, sums of squares, diagnostics and model selection, contingency tables and multinomial models, generalized linear models, logistic regression.", "prerequisite": "STT 862", "restrictions": "Open to doctoral students in the Department of Statistics and Probability or approval of department."}, "STT868": {"name": " Mixed Models: Theory, Methods and Applications", "semester": "Spring of every year", "credits": " 3", "description": "Maximum likelihood estimation and other estimation methods for linear mixed models. Statistical properties of LME models. Prediction under LME models. Generalized linear mixed models. Quasi-likelihood estimation, generalized estimating equations for GLMM. Nonlinear mixed models. Diagnostics and influence analysis. Bayesian development in mixed linear models. Application of mixed models.", "prerequisite": "STT 867", "restrictions": "Open to doctoral students in the Statistics major or approval of department."}, "STT872": {"name": " Statistical Inference I", "semester": "Spring of every year", "credits": " 3", "description": "Statistical distributions, decision-theoretic formulation of estimation and testing of hypotheses, sufficiency, Rao-Blackwellization, admissibility, Bayes and minimax estimation, maximum likelihood estimation, inference based on order statistics, Neyman-Pearson Lemma and applications, multiple testing.", "prerequisite": "STT 862 and STT 881", "restrictions": "Open to doctoral students in the Statistics major or approval of department."}, "STT873": {"name": " Statistical Learning and Data Mining", "semester": "Fall of odd years", "credits": " 3", "description": "Statistical methods focusing on machine learning and data mining, modern regression and classification techniques, support vector machines, boosting, kernel methods and ensemble methods, clustering dimension reduction, manifold learning, and selected topics.", "prerequisite": "STT 868 and STT 872", "restrictions": "Open to doctoral students in the Statistics major or approval of department."}, "STT874": {"name": " Introduction to Bayesian Analysis", "semester": "Fall of even years", "credits": " 3", "description": "Bayesian methods including empirical Bayes, hierarchical Bayes and nonparametric Bayes, computational methods for Bayesian inference including the Gibbs Sampler and Metropolis-Hastings method, and applications.", "prerequisite": "STT 868 and STT 872", "restrictions": "Open to doctoral students in the Statistics major or approval of department."}, "STT875": {"name": " R Programming for Data Sciences", "semester": "Summer of every year", "credits": " 3", "description": "Programming in R and use of associated open source tools. Addressing practical issues in documenting workflow, data management, and scientific computing."}, "STT881": {"name": " Theory of Probability I", "semester": "Fall of every year", "credits": " 3", "description": "Measures and their extensions, integration. Lp spaces and Inequalities. Lebesgue decomposition, the Radon-Nikodym theorem. Product measures, Fubini's theorem. Kolmogorov consistency theorem. Independence, Kolmogorov's zero-one law, the Borel-Cantelli lemma. Law of large numbers. Central limit theorems, characteristic functions, the Lindeberg-Feller theorem, asymptotic normality of sample median. Poisson convergence. Conditional expectations.", "prerequisite": "STT 861 and MTH 421", "restrictions": "Open to doctoral students in the Statistics major or approval of department."}, "STT882": {"name": " Theory of Probability II", "semester": "Spring of every year", "credits": " 3", "description": "Random walks, transcience and recurrence. Martingales, martingale convergence theorem, Doob's inequality, optional stopping theorem. Stationary processes and Ergodic theorem. Brownian motion. Kolmogorov's continuity theorem, strong Markov property, the reflection principle, martingales related to Brownian motion. Weak convergence in C([0,1]) and D([0,1]), Donsker's invariance principle, empirical processes.", "prerequisite": "STT 881", "restrictions": "Open to doctoral students in the Statistics major or approval of department."}, "STT886": {"name": " Stochastic Processes and Applications", "semester": "Fall of every year", "credits": " 3", "description": "Markov chains and their applications in both discrete and continuous time, including classification of states, recurrence, limiting probabilities. Queuing theory, Poisson process and renewal theory."}, "STT888": {"name": " Stochastic Models in Finance", "semester": "Spring of even years", "credits": " 3", "description": "Stochastic models used in pricing financial derivatives. Discrete-time models. Brownian motion. Stochastic integrals and Ito's formula. Basic Black-Scholes model. Risk neutral distribution. European and American options. Exotic options. Interest rate market, futures, and interest rate options.", "alias": "STT 887"}, "STT890": {"name": " Statistical Problems", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 3", "description": "Individualized study on selected problems.", "restrictions": "Approval of department."}, "STT899": {"name": " Master's Thesis Research", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 6", "description": "Master's thesis research.", "restrictions": "Approval of department."}, "STT914": {"name": " Advanced Organizational Research Methods", "semester": "Spring of every year", "credits": " 3", "description": "Methods for empirically testing scientific theories in organizational contexts.", "prerequisite": "MGT 906"}, "STT920": {"name": " Advanced Methods in Epidemiology and Applied Statistics", "semester": "Spring of every year", "credits": " 3", "description": "Pattern recognition and cluster analysis, longitudinal data analysis, path analysis, repeated measures and time-series analysis.", "prerequisite": "(EPI 826B or concurrently) or EPI 826 or approval of department", "restrictions": "Open to graduate students in the Department of Epidemiology and Biostatistics or approval of department."}, "STT951": {"name": " Statistical Inference II", "semester": "Spring of odd years", "credits": " 3", "description": "Decision theoretic estimation", "prerequisite": "STT 872 and STT 882", "restrictions": "Open to doctoral students in the Statistics major or approval of department."}, "STT953": {"name": " Asymptotic Theory", "semester": "Spring of even years", "credits": " 3", "description": "Locally asymptotic normal models, empirical likelihood, U-statistics, Asymptotically efficient and adaptive procedures", "prerequisite": "STT 872 and STT 882", "restrictions": "Open to doctoral students in the Statistics major or approval of department."}, "STT961": {"name": " Weak Convergence and Asymptotic Theory", "semester": "Fall of odd years", "credits": " 3", "description": "Maximal inequalities, covering numbers, symmetrization technique, Glivenko-Cantelli Theorems, Donsker Theorems and some results for Gaussian processes, Vapnik-Chervonenkis classes of sets and functions, applications to M-estimators, bootstrap, delta-method", "prerequisite": "STT 872 and STT 882", "restrictions": "Open to doctoral students in the Statistics major or approval of department."}, "STT962": {"name": " Fractional Processes and Power Laws", "semester": "Spring of even years", "credits": " 3", "description": "Self-similar processes. Fractional Brownian motion, fractional stable motions. Fractional calculus, Laplace and Fourier transforms, semigroups and generators. Continuous time random walks. Connections between long range dependence, heavy tails, and fractional calculus. Inference for processes with long range dependence and heavy tails, including fractional ARIMA models, ARCH/GARCH models, and random difference equations.", "prerequisite": "STT 872 and STT 882", "restrictions": "Open to doctoral students in the Statistics major or approval of department."}, "STT964": {"name": " Stochastic Analysis", "semester": "Spring of even years", "credits": " 3", "description": "Stochastic integrals and semi-martingales, Ito formula, stochastic differential equations. Applications."}, "STT990": {"name": " Problems in Statistics and Probability", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 3", "description": "Individual study on an advanced topic in statistics or probability.", "restrictions": "Approval of department."}, "STT996": {"name": " Advanced Topics in Probability", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": " 3", "description": "Current topics in probability.", "restrictions": "Approval of department."}, "STT997": {"name": " Advanced Topics in Statistics", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": " 3", "description": "Topics selected from non- and semi parametric statistics, multivariate analysis, time series analysis, Bayesian statistics, regression and kernel estimation, and other topics in advanced statistics.", "restrictions": "Approval of department."}, "STT999": {"name": " Doctoral Dissertation Research", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 24", "description": "Doctoral dissertation research.", "restrictions": "Approval of department."}}}