{"code": "TE", "name": "Teacher Education", "courses": {"TE100": {"name": " Introduction to Early Childhood and Elementary Education", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": " 1", "description": "Teaching practices and child development across grades PK-6. Understanding educational experiences, interests, abilities, and demands of the education profession."}, "TE120": {"name": " Seminar in Integrated Science for Elementary Schools", "semester": "Spring of every year", "credits": " 1", "description": "Exploration of major connecting themes in life sciences, earth science, and physical science as evidenced in the K-8 science curriculum and college science courses.", "prerequisite": "(BS 161 or BS 162 or BS 181H or BS 182H or LB 144 or LB 145) or (CEM 141 or PHY 231 or PSL 250 or GLG 201 or GEO 203)", "restrictions": "Open to students in the College of Education or in the Education major or in the Special Education major or approval of college.", "alias": "SME 120"}, "TE150": {"name": " Reflections on Learning", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": " 3", "description": "Students' experiences as learners in comparison to psychological, sociological, and anthropological theories and assumptions about learning and teaching in and out of school."}, "TE201": {"name": " Current Issues in Education", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Contemporary and perennial issues in elementary, secondary, and higher education."}, "TE250": {"name": " Human Diversity, Power, and Opportunity in Social Institutions", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": " 3", "description": "Comparative study of schools and other social institutions. Social construction and maintenance of diversity and inequality. Political, social and economic consequences for individuals and groups."}, "TE291A": {"name": " Special Topics in Urban Education", "semester": "Fall of every year, Spring of every year", "credits": "Variable from 1 to 6", "description": "Issues in teaching and learning for prospective teachers. Strategies for professional development during and after ones teacher preparation program."}, "TE301": {"name": " Literacy, Learners, and Learning in Context – Elementary (W)", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": " 3", "description": "Language and literacy development in sociocultural context at the elementary level (K-8). Natural and socially constructed differences among learners. How to learn about a child. Ten components of literacy. Assessment. Reading or writing related disability.", "prerequisite": "TE 150 and Completion of Tier I Writing Requirement and (TE 250 or CEP 240 or HDFS 212)", "restrictions": "Not open to freshmen or sophomores and open to students in the elementary teacher certification program (admitted)."}, "TE302": {"name": " Learners and Learning in Contexts – Secondary (W)", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": " 4", "description": "Role of social context and sociocultural background in learning at the secondary level (7-12). Natural and socially constructed differences among learners. Relationship among subject-specific knowledge, teaching and learning that subject, and the institutional and communal context. Multiple literacies.", "prerequisite": "TE 150 and (TE 250 and completion of Tier I writing requirement)", "restrictions": "Not open to freshmen or sophomores and open to students in the Secondary Teacher Certification Program (Admitted).."}, "TE304": {"name": " Algebra for Elementary and Middle School Teachers", "semester": "Fall of every year", "credits": " 3", "description": "Algebra needed for understanding connections between topics of algebra and the mathematics taught in elementary and middle school.", "prerequisite": "(MTH 201 and MTH 202 and MTH 301) and completion of Tier I writing requirement", "restrictions": "Open to undergraduate students in the College of Education or in the Department of Teacher Education. Approval of department."}, "TE305": {"name": " Functions and Calculus for Elementary and Middle School Teachers (W)", "semester": "Spring of every year", "credits": " 3", "description": "Functions and calculus needed for understanding connections between topics of calculus and the mathematics taught in middle school.", "prerequisite": "(MTH 304) and completion of Tier I writing requirement"}, "TE320": {"name": " Integrated Science for Elementary Schools", "semester": "Spring of every year", "credits": " 3", "description": "Analysis of the concepts integrating science across life sciences, earth sciences, and physical sciences. Applications to the K-8 science curriculum.", "prerequisite": "ISE 120 and (BS 161 or BS 162 or BS 181H or BS 182H or LB 144 or LB 145 or PSL 250 or ZOL 355) and (PHY 231 or PHY 231C or CEM 141 or LB 171) and (GLG 201 or GEO 203 or AST 207)", "restrictions": "Open to students in the Integrated Science Elementary Teaching Major.", "alias": "SME 320", "exclude": "ISE 301"}, "TE348": {"name": " Reading and Responding to Children's Literature", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": " 3", "description": "Literary understanding and genres in reading and teaching children's literature. Critical and theoretical perspectives in evaluating children's literature. Children's responses to literature. Literary, social, and pedagogical issues in the study of children's literature."}, "TE351": {"name": " Urban Education", "semester": "Spring of even years", "credits": " 3", "description": "Teaching and learning in urban institutions. Urban context and impact on schools. Urban school reform initiatives."}, "TE352": {"name": " Immigrant Language and Culture", "semester": "Spring of odd years", "credits": " 3", "description": "Minority language communities and cultures. Family literacy issues and values. Emergent and adolescent literacy development. Parenting and parental involvement. Home-school connection. Family literacy programs."}, "TE353": {"name": " International Education", "semester": "Spring of even years", "credits": " 3", "description": "Education in the global economy. Access and achievement, gender differences, pedagogy and culture, role of home and community, school resources, teacher quality and policy, policy challenges in developing countries, role of international organizations, privatization of higher education."}, "TE361": {"name": " Educational Reform and Policy Analysis", "semester": "Fall of every year", "credits": " 3", "description": "Analysis of prominent current K-12 and higher educational reforms and policies in the United States."}, "TE403": {"name": " Teaching of Science to Diverse Learners - Elementary", "semester": "Fall of every year", "credits": " 3", "description": "Teaching science to diverse learners at the elementary level (K-8). Inquiry into and construction of subject-specific meaning. Science subject matter adapted to learner diversity. Teachers’ roles, including professional, intellectual, and sociopolitical responsibilities.", "prerequisite": "((ISE 301 or ISE 320 or ISE 420) and completion of Tier I writing requirement) and TE 301", "restrictions": "Not open to freshmen or sophomores and open to students in the elementary teacher certification program (admitted)."}, "TE404": {"name": " Teaching of Social Studies to Diverse Learners - Elementary", "semester": "Fall of every year", "credits": " 3", "description": "Teaching social studies to diverse learners at the elementary level (K-8). Inquiry into and construction of subject-specific meaning. Social studies subject matter adapted to learner diversity. Teachers’ roles, including professional, intellectual, and sociopolitical responsibilities.", "prerequisite": "(TE 301) and completion of Tier I writing requirement", "restrictions": "Not open to freshmen or sophomores and open to students in the elementary teacher certification program (admitted)."}, "TE405": {"name": " Teaching of Language and Literacy to Diverse Learners - Elementary", "semester": "Spring of every year", "credits": " 3", "description": "Teaching language and literacy to diverse learners at the elementary level (K-8). Inquiry into and construction of subject-specific meaning. Literacy subject matter adapted to learner diversity. Teachers’ roles, including professional, intellectual, and sociopolitical responsibilities.", "prerequisite": "(TE 403 and TE 404 and TE 348) and completion of Tier I writing requirement", "restrictions": "Not open to freshmen or sophomores and open to students in the elementary teacher certification program (admitted)."}, "TE406": {"name": " Teaching of Mathematics to Diverse Learners - Elementary", "semester": "Spring of every year", "credits": " 3", "description": "Teaching mathematics to diverse learners at the elementary level (K-8). Inquiry into and construction of subject-specific meaning. Mathematics subject matter adapted to learner diversity. Teachers’ roles, including professional, intellectual, and sociopolitical responsibilities.", "prerequisite": "(MTH 201 and MTH 202 and TE 403 and TE 404) and completion of Tier I writing requirement", "restrictions": "Not open to freshmen or sophomores and open to students in the elementary teacher certification program (admitted)."}, "TE407": {"name": " Teaching Subject Matter to Diverse Learners – Secondary (W)", "semester": "Fall of every year", "credits": " 5", "description": "Examining teaching as enabling diverse learners to inquire into and construct subject-specific meanings at the secondary level (7-12). Adapting subject matter to learner diversity. Exploring multiple ways diverse learners make sense of the curriculum.", "prerequisite": "(TE 301 or TE 302) and Completion of Tier I Writing Requirement", "restrictions": "Not open to freshmen or sophomores and open to students in the Secondary Teacher Certification Program (Admitted).."}, "TE408": {"name": " Crafting Teaching Practices – Secondary (W)", "semester": "Spring of every year", "credits": " 5", "description": "Gathering data on learners to inform content and instructional decisions. Learning what should be taught and how it should be taught for specific disciplines at the secondary level (6-12). Teachers' multiple roles and their professional, intellectual, sociopolitical, and communal responsibilities.", "prerequisite": "(TE 407) and completion of Tier I writing requirement", "restrictions": "Not open to freshmen or sophomores and open to students in the Secondary Teacher Certification Program (Admitted).."}, "TE409": {"name": " Crafting Teaching Practices in the Secondary Teaching Minor", "semester": "Spring of every year", "credits": " 1", "description": "Deciding what should be taught for specific disciplines at the secondary level (7-12). Discipline-specific strategies for gathering data on learners to inform content and instructional decisions. Discipline-specific instructional strategies and student management and safety strategies.", "prerequisite": "(TE 407 and (TE 408 or concurrently)) and completion of Tier I writing requirement", "restrictions": "Not open to freshmen or sophomores and open to students in the Secondary Teacher Certification Program (Admitted).."}, "TE420": {"name": " Integrated Science Research", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Research design and data analysis of individual research projects relevant to the K-12 science curriculum, integrating topics in life, earth, and physical science.", "restrictions": "Open to seniors in the General Science Secondary Teaching Major and open to seniors in the Integrated Science Elementary Teaching Major.", "alias": "SME 420"}, "TE430": {"name": " Introduction to Arts in the Classroom", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Introduction to the power of teaching and learning through the arts. Explore how performing and visual arts can reach multiple learning styles and nurture the creative process of children through its innate variety of educational methods and expressions.", "restrictions": "Open to undergraduate students in the College of Education."}, "TE431": {"name": " Learning Through Drama", "semester": "Fall of every year", "credits": " 3", "description": "Introduction to the power of teaching and learning through drama. Explores how creative dramatics, and other art forms, can reach multiple learning styles through its innate variety of educational strategies and expressions.", "restrictions": "Open to undergraduate students in the College of Education."}, "TE432": {"name": " Learning Through Movement", "semester": "Spring of every year", "credits": " 3", "description": "Introduction to the power of teaching and learning through movement and dance. Explores how movement and dance can reach multiple learning styles through its innate variety of educational strategies and expressions.", "restrictions": "Open to undergraduate students in the College of Education."}, "TE448": {"name": " Issues of Diversity in Children's and Adolescent Literature", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": " 3", "description": "Theoretical perspectives, controversies, and classroom implications for literature by and about people who have traditionally been underrepresented in children's and adolescent literature. Literature by and about African Americans, Asian Americans, Latinos and Latinas, American Indians, Middle Eastern Americans, and groups traditionally defined by class, religion, ability, gender, and sexuality.", "prerequisite": "TE 348"}, "TE458": {"name": " Reading, Writing, and Teaching Poetry", "semester": "Fall of every year", "credits": " 3", "description": "Reading poetry, writing from prompts, peer workshops, pedagogical strategies.", "restrictions": "Open to undergraduate students in the College of Education."}, "TE490": {"name": " Independent Study in Teacher Education", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 6", "description": "Supervised individual or small group study of the practice of teaching.", "restrictions": "Not open to freshmen or sophomores. Approval of department."}, "TE491": {"name": " Special Topics in Teacher Education", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 6", "description": "Aspects of teaching practice and inquiry into practice.", "restrictions": "Not open to freshmen or sophomores."}, "TE494": {"name": " Field Experience in Teacher Education", "semester": "Fall of every year, Spring of every year", "credits": "Variable from 1 to 10", "description": "Supervised practica and/or observations in educational settings.", "restrictions": "Approval of department."}, "TE495": {"name": " Student Teaching in Music", "semester": "Fall of every year, Spring of every year", "credits": " 9", "description": "Supervised music teaching experience in schools. On-campus seminar required.", "restrictions": "Open to seniors in the Bachelor of Music in Music Education."}, "TE496": {"name": " Becoming a School Music Teacher", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Teachers’ professional and ethical responsibilities. Relations of teachers to colleagues, families, social service providers and community leaders. Teacher’s role in school governance and accountability.", "restrictions": "Open to seniors in the Music Education Major.", "exclude": "TE 801 or TE 803"}, "TE501": {"name": " Internship in Teaching Diverse Learners I", "semester": "Fall of every year", "credits": " 6", "description": "Directed and evaluated internship in heterogeneous classrooms. Teaching worthwhile content to students with varied learning needs. Theoretical and field-based explorations of common teaching dilemmas.", "prerequisite": "TE 405 or TE 406 or TE 408 or STA 482", "restrictions": "Open to students in the Teacher Certification Internship Year Studies Program."}, "TE502": {"name": " Internship in Teaching Diverse Learners II", "semester": "Spring of every year", "credits": " 6", "description": "Continuing internship in heterogeneous classrooms at selected schools. Increased emphasis on independent teaching. Maintaining classroom communities that ensure equitable access to important knowledge and skills. Assessing academic and social outcomes.", "prerequisite": "TE 501", "restrictions": "Open only to students admitted to the Teacher Certification Internship-Year Studies Program.", "exclude": "CEP 502A or CEP 502C"}, "TE801": {"name": " Professional Roles and Teaching Practice I", "semester": "Fall of every year", "credits": " 3", "description": "Teachers' professional and ethical responsibilities. Connections of schools to other social agencies. Relations of teachers to colleagues, families, other social service providers, and community leaders. Roles in school governance.", "prerequisite": "TE 405 or TE 406 or TE 408 or STA 482", "restrictions": "Open to students in the Teacher Certification Internship Year Studies Program.", "exclude": "CEP 801A"}, "TE802": {"name": " Reflection and Inquiry in Teaching Practice I", "semester": "Fall of every year", "credits": " 3", "description": "Qualitative and quantitative research methods on teaching and learning. Criteria for judging the validity and applicability of research-based knowledge. Framing educational problems worthy of inquiry. Designing and assessing studies of teaching practice.", "prerequisite": "TE 405 or TE 406 or TE 408 or STA 482", "restrictions": "Open to students in the Teacher Certification Internship Year Studies Program.", "exclude": "CEP 802A or CEP 802C"}, "TE803": {"name": " Professional Roles and Teaching Practice II", "semester": "Spring of every year", "credits": " 3", "description": "School-agency alliances for fostering student learning. Strategies for working with families and community groups to improve responsiveness of the school curriculum to student needs. Child advocacy in the school and community.", "prerequisite": "TE 801", "restrictions": "Open only to students admitted to the Teacher Certification Internship-Year Studies Program.", "exclude": "CEP 803A or CEP 803C"}, "TE804": {"name": " Reflection and Inquiry in Teaching Practice II", "semester": "Spring of every year", "credits": " 3", "description": "Collecting, analyzing, and interpreting data on teaching, learning, and educational policy. Dilemmas surrounding research on practice. Appraising and reporting results of inquiry.", "prerequisite": "TE 802", "restrictions": "Open only to students admitted to the Teacher Certification Internship-Year Studies Program.", "exclude": "CEP 804A or CEP 804C"}, "TE807": {"name": " Professional Development and Inquiry", "semester": "Fall of every year, Summer of every year", "credits": " 3", "description": "Teacher-centered inquiry through autobiography and documentation of self as learner. Relationship of personal research to classroom-based research. Application to practice."}, "TE808": {"name": " Inquiry into Classroom Teaching and Learning", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": " 3", "description": "Alternative forms of classroom inquiry to improve teaching and learning of subject matter. Social context of teaching and learning, pedagogy, and teaching effects. Social and academic outcomes for diverse learners."}, "TE809": {"name": " Inquiry-Oriented Instructional Strategies for the Elementary Classroom", "semester": "Spring of every year", "credits": " 3", "description": "Learning goals for Prekindergarten to Grade 5 children in mathematics, science, and social studies. Research related to engaged learning. Design and implementation of inquiry-based pedagogical practices, such as group-worthy tasks, place-based learning, and integrated unit planning."}, "TE811": {"name": " Philosophical Inquiry and Contemporary Issues in Education", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Philosophies of education. Analytic tools used for evaluating current educational goals, practices, issues, and reforms."}, "TE812": {"name": " Teacher Leadership in Practice", "semester": "Fall of every year", "credits": " 3", "description": "Teacher leadership through fieldwork in school contexts. Research on teacher leadership and leadership theory.", "prerequisite": "TE 808 or concurrently", "restrictions": "Open to graduate students or lifelong graduate students. Approval of department."}, "TE815": {"name": " Comparative Analysis of Educational Practice", "semester": "Fall of even years", "credits": " 3", "description": "Cross-national comparison of educational practices in light of differences in culture, social organization, economic conditions, and historical circumstance. International perspectives on education in the United States. Borrowing and adapting educational practices."}, "TE818": {"name": " Curriculum In Its Social Context", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Philosophical, social, and historical foundations of curriculum. Issues and practices across subjects, grades, and school settings. Moral consequences of curriculum decisions for teachers and students."}, "TE820": {"name": " Power and Pluralism in School Practice", "semester": "Spring of odd years", "credits": " 3", "description": "Connections between schools and diversity, inequality, and power in society. Genesis and consequences of school policies for diverse learners."}, "TE822": {"name": " Issues of Culture in Classroom and Curriculum", "semester": "Fall of odd years", "credits": " 3", "description": "Socio-cultural contexts and functions of schooling. Cultural diversity in education. Schools and classrooms as cultural systems. Students' cultural backgrounds in relation to curriculum. Developing effective multicultural curricula for all students."}, "TE823": {"name": " Learning Communities and Equity", "semester": "Spring of every year", "credits": " 3", "description": "Cooperative grouping and heterogeneous learning teams. Impact of learning communities on equity and on school curricula."}, "TE825": {"name": " Diverse Learners and Learning Subject Matter", "semester": "Summer of every year", "credits": " 3", "description": "Multiple perspectives on teaching subject matter to diverse learners. Texts, curricula, and pedagogical approaches. Subject-specific issues related to classroom diversity."}, "TE831": {"name": " Teaching School Subject Matter with Technology", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Uses of technologies in teaching subject matter to diverse learners. Critical perspectives on technologies in schools."}, "TE836": {"name": " Awards and Classics of Children's Literature", "semester": "Spring of even years, Summer of odd years", "credits": " 3", "description": "Critical examination of literary classics and award books for children, including children's responses to this literature.", "alias": "TE 883B"}, "TE838": {"name": " Children’s Literature in Film", "semester": "Summer of every year", "credits": " 3", "description": "Applies media and film studies perspectives to films created from children’s literature."}, "TE842": {"name": " Elementary Reading Assessment and Instruction", "semester": "Fall of every year, Summer of every year", "credits": " 3", "description": "Characteristics of effective reading assessment and instruction as identified in research and described by respected reading researchers and practitioners."}, "TE843": {"name": " Secondary Reading Assessment and Instruction", "semester": "Spring of every year", "credits": " 3", "description": "Knowledge and methodology for teaching language, literacy, and thinking in selected secondary school subjects."}, "TE845": {"name": " Language Diversity and Literacy Instruction and Assessment", "semester": "Fall of every year", "credits": " 3", "description": "Acquisition of literacy in schools by and assessment of language minority students and other learners with diverse backgrounds."}, "TE846": {"name": " Accommodating Differences in Literacy Learners", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": " 3", "description": "Developmental processes, instructional practices, and assessment principles that contribute to effective learning of reading and writing. Teaching methods for accommodating the different needs of individual literacy learners."}, "TE848": {"name": " Writing Assessment and Instruction", "semester": "Spring of even years", "credits": " 3", "description": "Writing theory, research, and pedagogy. Writing processes, strategies, assessments, and environments that address diverse writers (K-adult). Expository, narrative, and poetic genres. Prewriting, composing, revising, editing, and publishing."}, "TE849": {"name": " Methods and Materials for Teaching Children's and Adolescent Literature", "semester": "Fall of odd years, Spring of odd years, Summer of even years", "credits": " 3", "description": "Evaluation and utilization of various genres and elements of literature with focus on literature for students in grades K-12."}, "TE853": {"name": " Assessing and Responding to Literacy Learning Difficulties I", "semester": "Fall of every year", "credits": " 3", "description": "Instructional needs of struggling literacy learners. Multiple processes that contribute to proficient reading and writing. Difficulties related to specific reading and writing processes and/or to the orchestration of those processes. Developing and assessing vocabulary, comprehension, and composition skills.", "prerequisite": "(TE 842 or TE 843) and (TE 807 and TE 845 and TE 848)"}, "TE854": {"name": " Assessing and Responding to Literacy Learning Difficulties II", "semester": "Spring of even years", "credits": " 3", "description": "Identification of and response to instructional needs of struggling literacy learners. Collaboration in instructional planning and coordination across instructional settings, causes and correlates of reading difficulties.", "prerequisite": "TE 853"}, "TE855": {"name": " Teaching School Mathematics", "semester": "Fall of every year", "credits": " 3", "description": "Methods, materials, activities, and content important to teaching mathematics. Emphasis on conceptual understanding of mathematical ideas. Implications for lesson development, teaching diverse learners, and evaluating student learning."}, "TE856": {"name": " Language Identity and Ideology in Multilingual Settings", "semester": "Spring of every year", "credits": " 3", "description": "Current debates on the relationship between language, identity, and ideology. Theories of identity and ideology related to a variety of educational settings. Negotiation of identity and ideology with respect to social relationships between writer and reader, teacher and student, classroom and community.", "restrictions": "Open to graduate students in the College of Education or in the Department of Linguistics and Germanic, Slavic, Asian and African Languages or in the Second Language Studies Major or in the Teaching English to Speakers of Other Languages Major or in the Sociology Disciplinary Teaching Minor."}, "TE857": {"name": " Teaching and Learning Mathematical Problem Solving", "semester": "Spring of every year", "credits": " 3", "description": "Alternative approaches to solving mathematical problems and incorporating problem solving into K-12 teaching. Selection, appraisal, and uses of problems in the classroom. Materials and assessment strategies."}, "TE860": {"name": " Practice and Inquiry in Science Education", "semester": "Spring of every year", "credits": " 3", "description": "Teaching science subjects. Emphasis on learner diversity, learning community, conceptual understanding, subject matter content, and learners' prior knowledge."}, "TE861A": {"name": " Teaching Science for Understanding", "semester": "Summer of every year", "credits": " 3", "description": "Responses to contemporary over-emphasis on memorization and coverage of content knowledge in science teaching. Theoretical knowledge, techniques, and practical skills necessary to teach science for understanding."}, "TE861B": {"name": " Inquiry, Nature of Science, and Science Teaching", "semester": "Fall of every year", "credits": " 3", "description": "Inquiry and the nature of science as part of current science education reforms. Theoretical knowledge and practical skills for including inquiry and the nature of science in science instruction."}, "TE861C": {"name": " Action Research in K-12 Science and Mathematics Classrooms", "semester": "Spring of every year", "credits": " 3", "description": "Philosophy and methods supporting action research in sciences and mathematics classrooms. Design and implementation of an action research project in student’s own setting. Analyzing, interpreting, and reporting project results. Reflection on study’s value."}, "TE865": {"name": " Teaching and Learning K-12 Social Studies", "semester": "Summer of every year", "credits": " 3", "description": "Purposes for teaching and learning social studies. Developing citizenship, social science reasoning, and content knowledge with diverse learners."}, "TE867": {"name": " Perspectives in Social Studies: Global Education", "semester": "Fall of odd years, Summer of every year", "credits": " 3", "description": "Issues affecting the global community. Educational strategies for developing a global perspective on human relationships and the environment."}, "TE870": {"name": " Curriculum Design, Development, and Deliberation in Schools", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": " 3", "description": "Simulation in group curriculum deliberation. Critique of curriculum discourse, process, and product. Teachers' roles in site-based curriculum and staff development.", "prerequisite": "(TE 807 or TE 808) and (TE 801 or TE 818)"}, "TE872": {"name": " Teachers as Teacher Educators", "semester": "Spring of every year", "credits": " 3", "description": "Experienced teachers' contributions to the professional development of novice teachers. Implications for school change.", "prerequisite": "(TE 807 or TE 808) and (TE 801 or TE 818)"}, "TE873": {"name": " Literacy Leadership", "semester": "Spring of every year", "credits": " 3", "description": "Leadership roles for teachers in developing and improving literacy programs at preschool, K-12, college, and adult education levels. Assessing local needs in the context of national and state professional standards for literacy instruction. Maximizing use of resources. Evaluating programs and communicating evaluation results."}, "TE879": {"name": " Teaching College Mathematics", "semester": "Fall of even years", "credits": " 3", "description": "Curriculum materials, case studies, approaches to teaching and student learning of particular mathematics topics.", "alias": "SME 879"}, "TE882": {"name": " Seminars in Curriculum and Teaching", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 4", "description": "Intensive study of selected topics in curriculum and teaching."}, "TE883": {"name": " Seminars in Literacy Instruction", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 4", "description": "Intensive study of selected topics in literacy instruction."}, "TE890": {"name": " Independent Study", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 6", "description": "Supervised individual study in an area of curriculum, teaching, or schooling."}, "TE891": {"name": " Special Topics in Teaching, Curriculum, and Schooling", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 4", "description": "Current special topics in various fields of teacher education."}, "TE892": {"name": " ESL/FL Classroom Practice: K-12 Literacy Instruction", "semester": "Fall of every year", "credits": " 3", "description": "Classroom management for the teaching of English as a second language and foreign languages in K-12 settings. Lesson planning and materials development. Adapting authentic materials. Microteaching."}, "TE894": {"name": " Laboratory and Field Experiences in Teaching, Curriculum, and Schooling", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 6", "description": "Supervised graduate practica and internships in curriculum, teaching, and schooling."}, "TE895": {"name": " Research Ethics", "semester": "Summer of every year", "credits": " 1", "description": "Identifying and resolving ethical problems in research. Collegial interactions. Authorship, publication, and reviewing practices. Data management. Ownership of data and intellectual property. Conflicts of interest. Protection of human and animal subjects. Lab safety and compliance.", "restrictions": "Open to graduate students.", "alias": "PES 895"}, "TE896": {"name": " ESL/FL Practicum: K-12", "semester": "Spring of every year", "credits": " 2", "description": "Syllabus and lesson plan development for a four-week field experience in English as a second language or foreign language K-12 setting.", "prerequisite": "TE 892"}, "TE897": {"name": " Seminar in Feminist Theories, Epistemologies, and Pedagogy", "semester": "Spring of odd years", "credits": " 3", "description": "Foundational knowledge, theory, epistemology, and pedagogy in women’s and gender studies from a multi-disciplinary, global perspective."}, "TE899": {"name": " Master's Thesis Research", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 2 to 12", "description": "Master's thesis research."}, "TE901": {"name": " Proseminar in Curriculum, Instruction, and Teacher Education I", "semester": "Fall of every year", "credits": " 3", "description": "Purposes, history, structure, reform and consequences of the K-12 educational enterprise. Teaching practice, student learning, curricula, school organization, and educational policy. Theories and interpretations of educational systems. Schooling experiences of minority populations. Consideration of topics in and outside of the U.S.", "restrictions": "Open to doctoral students in the Curriculum, Instruction and Teacher Education major and open to doctoral students in the Educational Policy major and open to doctoral students in the Mathematics Education major."}, "TE902": {"name": " Proseminar in Curriculum, Instruction, and Teacher Education II", "semester": "Spring of every year", "credits": " 3", "description": "Two historical episodes related to improving teaching practice, teacher and student learning, curricula, and educational policy. Nature and effects of educational reforms.", "restrictions": "Open to doctoral students in the Curriculum, Instruction and Teacher Education major."}, "TE904": {"name": " ELL/ESL Research and Practice: K-12", "semester": "On Demand", "credits": " 3", "description": "Sociocultural and socio-political contexts for research in ELL/ESL teaching and learning; methods in ELL/ESL research; biliteracy/bilingualism, multiliteracies/mulitilingualism, and syncretic literacies; methods and curricula in second language teaching; identity, motivation, gender, race, and class; parent, school, and community partnerships for second language learners.", "restrictions": "Open to doctoral students."}, "TE907": {"name": " Psychological Study of Teaching", "semester": "Spring of odd years", "credits": " 3", "description": "Research literature on psychological aspects of teachers and teaching. Topics include teacher's decision-making, learning from experience, and developmental changes.", "restrictions": "Open to doctoral students."}, "TE908": {"name": " Sociohistorical Perspectives on English Language Learners and Second Language Education in the US", "semester": "Spring of even years", "credits": " 3", "description": "Social and historical contexts in which languages are used, taught, and learned and how they have a profound impact on linguistic practice and language acquisition processes at school and in society at large."}, "TE909": {"name": " English Language Learners in Content Areas: Constructing Research Communities and Resources", "semester": "Spring of odd years", "credits": " 3", "description": "Multiple perspectives on communities and resources for teaching and learning content areas in contexts with English learners. Issues of equity and implications for non-English learners will also be discussed.", "restrictions": "Open to doctoral students."}, "TE910": {"name": " Youth Language and Literacy in Schools and Communities", "semester": "Fall of even years", "credits": " 3", "description": "Contemporary research, theory, and practice critically situate school and beyond school language and literacy learning in the lives of youth and their communities. Focus on social justice-oriented work with youth of color and other young people marginalized by systemic inequalities. Increasing understanding of the oral and written communication many young people engage in through their participation in youth cultures. A study of race, class, gender identity, sexuality, ability, and citizenship status as they are lived through languages and literacies by youth and their communities."}, "TE912": {"name": " Reading Comprehension: Research and Theory", "semester": "Fall of odd years", "credits": " 3", "description": "Theory and research on the development, teaching, and learning of reading comprehension birth through adulthood.", "restrictions": "Open to doctoral students."}, "TE913": {"name": " Psychology and Pedagogy of Mathematics", "semester": "Fall of odd years", "credits": " 3", "description": "Psychological theory and research on the learning of mathematics. Development of mathematical thinking and knowledge in school and other settings.", "restrictions": "Open to doctoral students."}, "TE915": {"name": " Literacy in Sociocultural Context", "semester": "Fall of even years", "credits": " 3", "description": "The learning and development of literacy and the role of literacy in mediating cognition, affect, and action in educational contexts. Relationship between literacy and sociocultural contexts.", "restrictions": "Open to doctoral students."}, "TE917": {"name": " Contemporary Theories and Discourses in Education", "semester": "Fall of even years", "credits": " 3", "description": "Logical positivism, interpretive theories, critical theory, feminist theory, poststructuralism and neo-pragmatism. Applications to curriculum, teaching, and educational policy."}, "TE918": {"name": " Disciplinary Knowledge and School Subjects", "semester": "Spring of every year", "credits": " 3", "description": "Cross-disciplinary comparisons of the nature of knowledge, its creation, refutation, and use. Correspondence between disciplinary knowledge and knowledge as represented in schools."}, "TE920": {"name": " Social Analysis of Educational Policy", "semester": "Spring of every year", "credits": " 3", "description": "Social science perspectives on factors outside and inside school systems which shape policy and influence both the nature of policy problems and the form of educational solutions."}, "TE921": {"name": " Learning to Teach", "semester": "Fall of every year", "credits": " 3", "description": "Intellectual, practical, and moral dimensions of teaching and learning to teach. Impact of formal and informal influences on teachers' knowledge, skills, and attitudes."}, "TE923": {"name": " Comparative Perspectives on Curriculum, Instruction, and Teacher Education", "semester": "Spring of odd years", "credits": " 3", "description": "Contrasting national responses to universal questions. Links among education and other nation-building institutions. Organization and distribution of knowledge. Organization of, preparation for, and practice of teaching."}, "TE924": {"name": " Philosophy of Education: Ideas and Methods", "semester": "Spring of even years", "credits": " 3", "description": "Selected ideas in education from different philosophical traditions. Issues of method, historical perspectives, and textual analysis."}, "TE926": {"name": " Proseminar in Mathematics Education I", "semester": "Fall of odd years", "credits": " 3", "description": "Research on the learning and teaching of mathematics. Focus on curriculum, discourse, equity and teacher education.", "alias": "SME 926"}, "TE927": {"name": " Proseminar in Mathematics Education II", "semester": "Fall of even years", "credits": " 3", "description": "Research on the learning and teaching of mathematics. Focus on teaching, student learning, assessment and policy.", "alias": "SME 927"}, "TE928": {"name": " Proseminar in Educational Policy", "semester": "Fall of every year", "credits": " 3", "description": "Disciplinary perspectives on policy issues. Influence of research on policy process. Politics and educational practice as determinents of policy choice."}, "TE931": {"name": " Introduction to Qualitative Methods in Educational Research", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": " 3", "description": "Concepts and assumptions underlying multiple traditions of qualitative research methods in education. Relationship between research questions and qualitative research design. Epistemology, methods, and ethical issues of ethnography, case study research, grounded theory, oral history and discourse analysis. Criteria for appraising and critiquing qualitative research designs, claims, and evidence,"}, "TE934": {"name": " Introduction to Quantitative Methods in Educational Research", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Concepts and assumptions underlying quantitative research methods in education. Relationship between research questions and quantitative research design. Issues of inference, reliability, and validity. Application of statistical analysis to contemporary issues in education. Criteria for appraising and critiquing quantitative research designs, claims, and evidence. Quantitative research ethics."}, "TE936": {"name": " Topics in Research on Teaching and Learning Science", "semester": "Fall of every year", "credits": "Variable from 3 to 9", "description": "Research on teaching and learning in science. Teacher learning, student learning, and assessment of teaching and/or learning."}, "TE937": {"name": " Topics in Social, Historical, Philosophical Foundations of Science Education", "semester": "Spring of even years", "credits": "Variable from 3 to 9", "description": "Foundations for research in science education. Diversity, social justice, and equity research and cognitive research, and the role of social, historical, and philosophical perspectives on framing research questions, methods and claims in these areas."}, "TE938": {"name": " Qualitative Data Analysis", "semester": "Fall of every year", "credits": " 3", "description": "Qualitative data analysis tools and techniques; approaches and theories that inform and guide the analysis, interpretation, and representation of qualitative data."}, "TE939A": {"name": " Special Topics in Advanced Qualitative Methodology", "semester": "Fall of even years", "credits": " 3", "description": "Special topics in advanced methods of qualitative research in education."}, "TE939B": {"name": " Advanced Qualitative Methods: Critical Ethnography", "semester": "Spring of odd years", "credits": " 3", "description": "Critical theories—postmodernism, poststructuralism, poscolonialism, feminism, queer theory—and their implications for conceptualizing, conducting, analyzing, and representing one’s research. Political and ethical dimensions inherent in qualitative research as well as the amalgamation of epistemology, ontology, and methods into a coherent and purposeful methodology that is ethical, reciprocal, and praxical."}, "TE939C": {"name": " Advanced Qualitative Methods: Discourse Analysis", "semester": "Spring of even years", "credits": " 3", "description": "Discourse analytic approaches to research in education and related areas of inquiry through an interdisciplinary lens and traditions that range from interactional sociolinguistics and narrative analysis to conversation analysis and critical discourse analysis."}, "TE939D": {"name": " Advanced Qualitative Methods: Case Studies", "semester": "Spring of even years", "credits": " 3", "description": "Aims and methods of case study research; conceptions of case study research as well as interpretive methods frequently used in case studies, including ethnographic observations, textual analysis, multimodal/video analysis, interviews, and focus groups."}, "TE939E": {"name": " Advanced Qualitative Methods: Humanities Oriented Research", "semester": "Fall of odd years", "credits": " 3", "description": "Research traditions in history, philosophy, literary criticism, arts, narrative inquiry, language, communication arts, ethics, religion, curriculum theory, and cultural studies. Epistemology, theory, arts, values, and history of science."}, "TE939F": {"name": " Advanced Qualitative Methods: Phenomenology", "semester": "Spring of odd years", "credits": " 3", "description": "Phenomenological methodologies to study the caring professions (education and related fields). Exploring participants’ subjective experiences and interpretations of the phenomenon being studied."}, "TE939G": {"name": " Advanced Qualitative Methods: Humanizing Research—Decolonizing Qualitative Inquiry", "semester": "Fall of even years", "credits": " 3", "description": "Conducting qualitative research for justice with individuals and groups who are marginalized by systems of inequality; contemporary methodological dilemmas and innovations. Building relationships of dignity and care; reciprocity and dialogic consciousness-raising; and ways in which research might be considered an answer to pressing social and educational problems."}, "TE940": {"name": " Curriculum Deliberation and Development", "semester": "Fall of odd years", "credits": " 3", "description": "Research in curriculum deliberation and development. Discourse, group dynamics, processes, and outcomes for teaching and learning."}, "TE942": {"name": " Economics of Education", "semester": "Spring of every year", "credits": " 3", "description": "Economic effects of education. Economic analysis of policy issues in education. Applications to the United States and other countries.", "restrictions": "Open to graduate students."}, "TE943": {"name": " Seminar in Professional Development", "semester": "Spring of even years", "credits": " 3", "description": "Synthesis and application of knowledge acquired through consideration of research and field-based inquiry from teacher practice and change initiatives."}, "TE944": {"name": " Seminar in English Education", "semester": "On Demand", "credits": " 3", "description": "Current issues in research, methods and policy in the field of English education.", "restrictions": "Open to doctoral students."}, "TE945": {"name": " Current Issues in Children's and Adolescent Literature", "semester": "On Demand", "credits": "Variable from 1 to 3", "description": "Intensive study of current issues in writing, publishing, reading, teaching, and analyzing children’s and adolescent literature.", "restrictions": "Open to doctoral students."}, "TE946": {"name": " Current Perspectives on Literacy Research and Instruction", "semester": "Spring of even years", "credits": " 3", "description": "Theoretical and empirical development in literacy research and instruction.", "restrictions": "Open to doctoral students."}, "TE947": {"name": " Comparative International Education Policy", "semester": "Fall of every year", "credits": " 3", "description": "International and comparative education policy. National and international policy actors. Cross-national education policy research. Insights from international research for U.S. education policy.", "restrictions": "Open to graduate students."}, "TE950": {"name": " Mathematical Ways of Knowing", "semester": "Spring of odd years", "credits": " 3", "description": "Philosophical, cultural, political, societal, psychological, and historical perspectives on knowing in mathematics as a discipline."}, "TE954": {"name": " Design and Methods in Mathematics Education Research", "semester": "Fall of every year", "credits": " 3", "description": "History, current trends, and issues pertaining to research design and methods in mathematics education research. Mathematics education research in the areas of policy, teaching, teacher learning, and student learning with particular attention to how research design influence research findings.", "alias": "SME 954"}, "TE958": {"name": " History of Literacy Research and Instruction", "semester": "On Demand", "credits": " 3", "description": "Key historical, political, scholarly, and educational issues influencing literacy curriculum and pedagogy.", "restrictions": "Open to doctoral students."}, "TE959": {"name": " Acquisition and Development of Language and Literacy", "semester": "On Demand", "credits": " 3", "description": "Language and literacy development with an alternating focus on early and middle childhood and adolescence and adulthood. Major areas of language and literacy development including phonology, orthography, morphology, semantics, syntax, and pragmatics. Connections between oral and written language development. Home and school influences on language and literacy development. Individual differences in language and literacy development.", "restrictions": "Open to doctoral students."}, "TE961": {"name": " Urban Politics, Education, and School Reform", "semester": "Spring of even years", "credits": " 3", "description": "Challenges cities face in initiating and sustaining meaningful education reform efforts.", "restrictions": "Open to doctoral students."}, "TE962": {"name": " Teachers and Teaching in Urban Contexts", "semester": "Fall of even years", "credits": " 3", "description": "Effective instruction and instructional support in urban settings.", "restrictions": "Open to doctoral students."}, "TE963": {"name": " Critical Race Theory in Education", "semester": "Spring of even years", "credits": " 3", "description": "Critical race theory as an analytical framework that provides race epistemology, methodological, and pedogogical approaches to study everyday inequalities in P-20 education.", "restrictions": "Open to doctoral students."}, "TE971": {"name": " Teacher Learning in School Settings", "semester": "Fall of odd years", "credits": " 3", "description": "Research about school-based learning by prospective, beginning, and experienced teachers. Observation, conversation, writing, and classroom research as tools for improving teaching."}, "TE980": {"name": " Writing, Research, and Theory", "semester": "Fall of even years", "credits": " 3", "description": "Theory and research on the development, teaching, and learning of writing, birth through adulthood.", "restrictions": "Open to doctoral students."}, "TE982": {"name": " Seminar in Curriculum, Instruction, and Teacher Education", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 4", "description": "Intensive study in an area of curriculum, teaching, and learning; educational policy and social analysis; or teacher education and teacher learning."}, "TE990": {"name": " Independent Study", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 4", "description": "Supervised individual study in an area of curriculum, instruction, and teacher education.", "restrictions": "Open to doctoral students."}, "TE991": {"name": " Special Topics in Curriculum, Instruction, and Teacher Education", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 6", "description": "Special topics in the fields of curriculum, instruction, and teacher education."}, "TE994": {"name": " Laboratory and Field Experience in Curriculum, Instruction, and Teacher Education", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 6", "description": "Supervised practica, observations, and internships in an area of educational policy and social analysis, teacher education and teacher learning, and curriculum, teaching and learning.", "restrictions": "Open to doctoral students. Approval of department."}, "TE995": {"name": " Research Practicum in Curriculum, Instruction, and Teacher Education", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 6", "description": "Supervised research practicum. Design, execution, analysis, presentation, critique, and revision of research projects.", "restrictions": "Open to educational specialists or doctoral students in the Department of Teacher Education and open to students in the Educational Policy major."}, "TE999": {"name": " Doctoral Dissertation Research", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 23", "description": "Doctoral dissertation research.", "restrictions": "Open to doctoral students in the Curriculum, Instruction and Teacher Education major and open to doctoral students in the Educational Policy major."}}}