{"code": "TSM", "name": "Technology Systems Management", "courses": {"TSM121": {"name": " Fundamentals of Electricity", "semester": "Fall of every year", "credits": " 4", "description": "Application of Ohm's law. Kirchoff's laws. Series and parallel circuits. Inductive and capacitive reactance. Power factor. Practical single and three-phase electrical systems. Electromagnetic induction. Transformers. Environmental constraints in power use and production.", "restrictions": "Open to students in the Electrical Technology Major.", "alias": "AE 071"}, "TSM130": {"name": " Energy Efficiency and Conservation in Agricultural Systems", "semester": "Spring of every year, Summer of every year", "credits": " 3", "description": "Introduction and basic concepts of energy efficiency and conservation in agricultural and food production systems."}, "TSM222": {"name": " Fundamentals of Automation and Controls", "semester": "Fall of every year", "credits": " 3", "description": "On-off controllers for electric actuators. Installation according to code. Ladder-logic. Programmable logic controllers. Installation and programming. Interfacing to a computer.", "prerequisite": "(TSM 121 or concurrently) or MTH 103 or approval of department", "alias": "AE 083, TSM 223"}, "TSM251": {"name": " Information Technology in Agricultural Systems", "semester": "Fall of every year", "credits": " 3", "description": "Applications and trends in information systems. Evaluation and use of computer systems, peripherals, networks, management decision support software, presentation systems, and communication systems."}, "TSM331": {"name": " Water Management in Agriculture and Food Systems", "semester": "Spring of every year", "credits": " 3", "description": "Principles of water management, use efficiency and conservation in agricultural production, natural resources and food processing facilities. Best agricultural water management practices, water rights, irrigation scheduling, irrigation systems selection, evaluation and management and drainage principles. Large scale water use, management and conservation in food processing.", "prerequisite": "MTH 103 or MTH 124 or MTH 132 or LB 118", "alias": "TSM 431"}, "TSM343": {"name": " Principles of Precision Agriculture", "semester": "Fall of every year", "credits": " 3", "description": "Global positioning systems (GPS), yield monitors, and computer software. Analysis and interpretation of field maps. Variable-rate application. Economics of precision agriculture.", "prerequisite": "MTH 103 or MTH 114 or MTH 116 or MTH 124 or MTH 132"}, "TSM490": {"name": " Independent Study", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 5", "description": "Supervised individual student research and study in technology systems management.", "restrictions": "Approval of department."}, "TSM491": {"name": " Special Topics", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 5", "description": "Special topics in technology systems management.", "restrictions": "Approval of department."}, "TSM493": {"name": " Professional Internship in Technology Systems Management", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": " 3", "description": "Supervised professional experiences in agencies and businesses related to a student's major field of study.", "restrictions": "Open to juniors or seniors in the College of Agriculture and Natural Resources. Approval of department; application required. A student may earn a maximum of 6 credits A student may earn a maximum of 6 credits in any or all of these courses"}}}