{"code": "UGS", "name": "Undergraduate Studies", "courses": {"UGS100": {"name": " Introduction to the MSU Experience (Interim New)", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": " 1", "description": "Introduction to Michigan State University culture, policies, systems and resources to support successful strategies in college environments."}, "UGS101": {"name": " Big Ideas Seminar", "semester": "Fall of every year, Spring of every year", "credits": "Variable from 1 to 3", "description": "Introduction to inquiry, research, and scholarship of complex issues. Special topics designed to engage new students' interests in the academic life of the university.", "restrictions": "Open to freshmen and open to sophomores. A student may earn a maximum of 6 credits in UGS 100, 101, 102, and 103 or any combination of these courses."}, "UGS102": {"name": " Freshman Seminar Abroad", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 2 to 3", "description": "Introduction to scholarship and inquiry in global and international contexts. Special interdisciplinary-based topics focused to develop intercultural abilities and deepen understanding of global problems. Field trips required.", "restrictions": "Open to freshmen or approval of department; application required. A student may earn a maximum of 6 credits and may enroll a maximum of two times in UGS 101, 102, and 103 or any combination of these courses."}, "UGS103": {"name": " Freshman Seminar Away", "semester": "Fall of every year", "credits": "Variable from 1 to 3", "description": "Introduction to scholarship and academic inquiry in an intensive experiential learning context. Special disciplinary-based topics focused to engage the interests of new students in an off-campus domestic setting appropriate to the topic of study. Field trips required.", "restrictions": "Open to freshmen or approval of department; application required. A student may earn a maximum of 6 credits and may enroll a maximum of two times in UGS 101, 102, and 103 or any combination of these courses."}, "UGS110": {"name": " People, Places, and Purpose", "semester": "Fall of every year, Spring of every year", "credits": "Variable from 1 to 3", "description": "Developing effective intercultural and interpersonal skills, analytical and critical thinking in the university experience, identifying campus resources, and determining one's academic and professional goals.", "restrictions": "Open to freshmen. A student may earn a maximum of 6 credits in UGS 101, 102, 103, and 110 or any combination of these courses."}, "UGS200H": {"name": " Honors Research Seminar", "semester": "Fall of every year", "credits": "Variable from 1 to 4", "description": "Introduction to research and inquiry. Special disciplinary research topics proposed to engage the interests of Honors College students in the scholarly life of the university.", "restrictions": "Open to freshmen or sophomores in the Honors College or approval of college."}}}