{"code": "UP", "name": "Urban Planning", "courses": {"UP100": {"name": " The City", "semester": "Spring of every year", "credits": " 3", "description": "Evolution, character, dimensions and elements of cities."}, "UP201": {"name": " Introduction to Urban and Regional Planning", "semester": "Fall of every year, Spring of every year", "credits": " 4", "description": "Urban planning concepts, contemporary urban issues, historical contexts, and the politics and theory of planning."}, "UP314": {"name": " Methods for Investigation of Urban Systems", "semester": "Spring of every year", "credits": " 4", "description": "Models, approaches, and techniques for urban and regional problem analysis, research, program evaluation, and project management. Application of related computer software."}, "UP353": {"name": " Land Use Planning", "semester": "Fall of every year", "credits": " 4", "description": "Principles and techniques of land use planning, including role of social, economic and political systems. Comprehensive planning, neighborhood/sector planning, practical tools for land regulation and environmentally sensitive development.", "prerequisite": "UP 201", "alias": "UP 323"}, "UP365": {"name": " Planning Law and Ethics (W)", "semester": "Spring of every year", "credits": " 4", "description": "Legal and ethical concepts and processes involved in planning and development.", "prerequisite": "(UP 201) and completion of Tier I writing requirement", "restrictions": "Open to juniors or seniors in the Interdisciplinary Studies in Social Science major or in the Urban and Regional Planning major.", "alias": "UP 465"}, "UP400": {"name": " Special Topics in Urban Planning", "semester": "Fall of every year, Spring of every year", "credits": "Variable from 2 to 4", "description": "Issues and problems in contemporary urban planning."}, "UP413": {"name": " Urban Geography", "semester": "Spring of every year", "credits": " 3", "description": "Theories and models of urban spatial form. Underlying structures and processes. Socio-spatial dimensions of modern urbanism. Differentiation and locational conflict in residential, commercial, and industrial space.", "restrictions": "Not open to freshmen or sophomores."}, "UP414": {"name": " Geography of Transportation", "semester": "Fall of odd years", "credits": " 3", "description": "Spatial principles of transportation. Theories of interaction, network structures, and location-allocation models. Role of transport and transport planning.", "prerequisite": "GEO 113", "restrictions": "Not open to freshmen."}, "UP415": {"name": " Location Theory and Land Use Analysis", "semester": "Fall of even years", "credits": " 3", "description": "Classical and neoclassical, static and dynamic models of industrial location and spatial organization. Land rent theory. Central place theory. Multi-locational organization. Growth transmission.", "prerequisite": "GEO 113 or UP 201", "restrictions": "Not open to freshmen or sophomores."}, "UP418": {"name": " The Ghetto", "semester": "Fall of odd years", "credits": " 3", "description": "Analysis of the ghetto including its spatial organization and structure. Distribution of racial and ethnic populations. Emphasis on U.S. cities.", "restrictions": "Not open to freshmen or sophomores."}, "UP424": {"name": " Geographic Information Systems and Design Tools for Planning", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Introduction to geographic information systems and its applicability to planning. Methods and techniques for analyzing land use planning issues.", "restrictions": "Open to students in the Master in Urban and Regional Planning or in the Urban and Regional Planning major or in the Bachelor of Landscape Architecture and open to students in the Environmental Design major."}, "UP425": {"name": " Problems in Geographic Information Science (W)", "semester": "Spring of every year", "credits": " 3", "description": "Advanced theoretical and technical issues in geographic information science utilizing a problems oriented approach. Development and implementation of geographic information science solutions and formal documentation of work.", "prerequisite": "(GEO 325 or GEO 802) and completion of Tier I writing requirement"}, "UP433": {"name": " Introduction to Environmental Planning", "semester": "Fall of every year", "credits": " 4", "description": "Nature and magnitude of contemporary environmental issues. Political, social and cultural forces that influence environmental policy and planning. Processes and tools available to planning professionals."}, "UP454": {"name": " Local Economic Planning", "semester": "Fall of every year", "credits": " 3", "description": "The economic component of comprehensive community planning. Taxation and services delivery. Fiscal health and physical and social development of a community.", "restrictions": "Open to seniors or juniors in the College of Social Science.", "alias": "UP 354"}, "UP458": {"name": " Housing and Real Estate Development", "semester": "Spring of even years", "credits": " 3", "description": "Real estate development process from idea inception to asset management. Finance, organization, design and implementation. Housing, social impacts, and public sector involvement."}, "UP478": {"name": " Urban Transportation Planning", "semester": "Fall of every year", "credits": " 3", "description": "Principles of decision-making in urban transportation planning. Demand and supply analysis, social and environmental impacts, implementation programs. Use of computer models.", "restrictions": "Open to juniors or seniors in the Geography Major or in the Urban and Regional Planning Major or approval of school."}, "UP488": {"name": " The Sustainable and Climate Resilient City", "semester": "Fall of every year", "credits": " 3", "description": "Multidisciplinary research in sustainability and climate resilience of urban places. Characteristics of sustainable and resilient cities, comparative analysis, and international perspective.", "restrictions": "Open to students or seniors in the Urban and Regional Planning Major or approval of school.", "exclude": "UP 888"}, "UP490": {"name": " Independent Study in Urban Planning", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 4", "description": "Faculty-supervised individual study in aspects of urban planning.", "restrictions": "Not open to freshmen or sophomores. Approval of school."}, "UP494": {"name": " Planning Practicum", "semester": "Spring of every year", "credits": " 4", "description": "Collection, analysis and synthesis of planning information for an established urban or regional area. Problem identification and alternative plan formulation. Formulation of comprehensive physical development policies and plans, implementation of programs.", "prerequisite": "UP 314 and UP 365 and UP 454", "alias": "UP 494A, UP 494B"}, "UP800": {"name": " Special Topics in Urban Planning", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 2 to 4", "description": "Issues and current research in urban planning.", "restrictions": "Open only to graduate students in Urban and Regional Planning."}, "UP801": {"name": " Concepts and Issues in Planning and Development", "semester": "Fall of every year", "credits": " 4", "description": "Urban and regional planning and development. History of the planning profession. Current urban issues and planning approaches."}, "UP814": {"name": " Applied Research Methods for Planning and Development", "semester": "Spring of every year", "credits": " 4", "description": "Techniques in urban and regional planning analysis. Forecasting models. Methods of urban project evaluation."}, "UP823": {"name": " Urban Land Management and the Environment", "semester": "Fall of every year", "credits": " 3", "description": "Concepts, principles, tools, and techniques of urban and regional land management. Land use planning, public facilities, infrastructure location, and environmental sensitivity in land management."}, "UP824": {"name": " Geographic Information Systems and Design Tools for Planning", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Introduction to geographic information systems and its applicability to planning. Methods and techniques for analyzing land use and planning issues.", "restrictions": "Open to graduate students in the Master in Urban and Regional Planning or approval of school."}, "UP844": {"name": " Planning Theory and Ethics", "semester": "Fall of every year", "credits": " 3", "description": "The planning and development process. Decision making in a political context. Professional ethics and practice. Gender, class, race and ethnicity in relationship to planning and development."}, "UP854": {"name": " Economics of Planning and Development", "semester": "Fall of every year", "credits": " 4", "description": "Physical urban environment and local economic development."}, "UP855": {"name": " Urban Sustainability and Climate Change", "semester": "Fall of even years", "credits": " 3", "description": "Urban sustainability in the context of the global climate change, tools for sustainability planning, adaptation to climate change, risk and vulnerability in different climate zones", "restrictions": "Open to master's students in the Master in Urban and Regional Planning or approval of school.", "exclude": "UP 455"}, "UP865": {"name": " Planning and Development Law", "semester": "Spring of every year", "credits": " 3", "description": "Constitutional and statutory bases for planning and development. Effects of case law on design, administration, and implementation of regulations."}, "UP868": {"name": " Planning Resilience against Extreme Events", "semester": "Spring of every year", "credits": "Variable from 1 to 4", "description": "Theory on ephemeral planning and contemporary urbanism. Characteristics of disruptive technologies, disaster planning, and mega-events. Case studies of US and international cities in duress and recovery. Strategic and tactical planning, management practices, and ‘winging it’ in a state of exception. Implications for policy, management, operations, and planning."}, "UP878": {"name": " Autonomous Futures: Self-driving Vehicles, Domotics, and Artificial Intelligence in Smart Cities", "semester": "Fall of every year", "credits": " 3", "description": "Characteristics of autonomous systems and emerging technology. Perceptions of people on future transport, mobility, housing, and living. International perspectives on ethics and transitions towards autonomous futures. Implications for engineering, policy, business, and planning."}, "UP889": {"name": " Master's Research", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 3", "description": "Supervised individual research for Plan B master's.", "restrictions": "Open to master's students in the Master in Urban and Regional Planning. Approval of school."}, "UP890": {"name": " Independent Study", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 4", "description": "Faculty-supervised study in aspects of urban planning.", "restrictions": "Approval of department."}, "UP892": {"name": " Research Seminar in Planning and Construction Management", "semester": "Fall of every year", "credits": " 2", "description": "Research concepts. Research writing. Presentation methods.", "restrictions": "Open to graduate students in the Master in Urban and Regional Planning.", "alias": "UP 897"}, "UP893": {"name": " Internship in Urban Planning", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 2 to 4", "description": "Supervised individual experience in approved agencies and departments in the Lansing area.", "restrictions": "Approval of department."}, "UP894": {"name": " Planning Practicum", "semester": "Spring of every year", "credits": " 4", "description": "Professional practice in the collection, analysis and synthesis of information by students or student groups under faculty supervision. Developing solutions to specific urban problems.", "restrictions": "Open to master's students in the Urban and Regional Planning Major.", "alias": "UP 894A, UP 894B"}, "UP899": {"name": " Master's Thesis Research", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 6", "description": "Master's thesis research.", "restrictions": "Open to master's students in the Master in Urban and Regional Planning. Approval of school."}}}