{"code": "WRA", "name": "Writing, Rhetoric and American Cultures", "courses": {"WRA0102": {"name": " Preparation for College Writing", "semester": "Fall of every year, Spring of every year", "credits": " 0", "description": "Practice in applying varied strategies of invention, arrangement, revision, style and delivery.", "restrictions": "Not open to graduate students.", "alias": "ATL 0102"}, "WRA1004": {"name": " Preparation for College Writing (D) (Interim Change)", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "The study and practice of varieties of invention, arrangement, revision, style, and delivery to help students make successful transitions to writing, reading, and researching in Tier 1 writing.", "restrictions": "Not open to graduate students."}, "WRA101": {"name": " Writing as Inquiry", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": " 4", "description": "The study and practice of invention, arrangement, revision, style, and delivery to help students make successful transitions to writing, reading, and researching in higher education.", "prerequisite": "(WRA 1004) or designated score on English Placement test", "exclude": "LB 133 or MC 111 or MC 112 or RCAH 111 or WRA 195H or AL 110"}, "WRA195H": {"name": " Writing as Inquiry Honors", "semester": "Fall of every year, Spring of every year", "credits": " 4", "description": "The study and practice of varieties of invention, arrangement, revision, style and delivery to help students make successful transitions to writing, reading, and researching in higher education.", "prerequisite": "Designated score on English Placement test", "exclude": "AL 110 or LB 133 or MC 111 or MC 112 or RCAH 111 or WRA 101"}, "WRA202": {"name": " Introduction to Professional and Public Writing", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Principles of rhetoric and writing applied to professional and public writing, with emphasis on writing as social and professional action. Definition and major theories of the field, research tools and practices, genres and conventions, and professional style.", "prerequisite": "Completion of Tier I Writing Requirement", "restrictions": "Open to students in the Professional and Public Writing Major or approval of department.", "alias": "AL 202"}, "WRA210": {"name": " Introduction to Web Authoring", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Analyzing, evaluating, and authoring Web sites through principles of design rhetoric. Practices of Web accessibility, usability, and sustainability by using HTML and CSS.", "prerequisite": "(WRA 202 or concurrently) or (WRA 260 or concurrently)", "restrictions": "Open to students in the Experience Architecture Major or in the Professional and Public Writing Major or approval of department."}, "WRA211": {"name": " Documentary History and Theory", "semester": "Fall of every year", "credits": " 3", "description": "Documentary history and theory form its origins to the present.", "restrictions": "Open to students in the School of Journalism or in the Department of Media and Information or in the Department of Writing, Rhetoric and American Cultures or in the Documentary Studies Specialization or in the Film Studies major."}, "WRA214": {"name": " Social Media and the Start-up", "semester": "Spring of every year, Summer of every year", "credits": " 3", "description": "Introduction to using digital spaces and social media to propel entrepreneurship ideas forward. Survey of how businesses and organizations' websites, videos, podcasts, and social media presence brand products and organizations. Website, mobile and social media presence to promote entrepreneurial idea.", "prerequisite": "BUS 190 and CAS 114", "restrictions": "Open to undergraduate students in the Entrepreneurship and Innovation Minor."}, "WRA225": {"name": " Introduction to Composing Digital for Video", "semester": "Fall of every year", "credits": " 3", "description": "Rhetorical and design theories applied to digital video composing and producing. Analyzing and composing digital video for professional and public contexts.", "prerequisite": "(WRA 202 or concurrently) or (WRA 260 or concurrently)", "restrictions": "Open to undergraduate students in the Professional and Public Writing Major.", "alias": "WRA 417"}, "WRA260": {"name": " Writing, Rhetoric, Cultures, and Community", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Introduction to rhetorical practices, processes, and strategies. Study of intersections of rhetorical theories and cultural engagement, with emphasis on analyzing and composing for different professional and public settings. Exploration of different knowledge-making processes and influences on writing. Reading- and discussion-intensive course.", "prerequisite": "Completion of Tier I Writing Requirement", "restrictions": "Open to undergraduate students in the Experience Architecture Major or in the Professional and Public Writing Major or approval of department.", "alias": "AL 260"}, "WRA290": {"name": " Independent Study", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 4", "description": "Special projects arranged by an individual student and a faculty member in areas supplementing regular course offerings.", "prerequisite": "Completion of Tier I Writing Requirement", "restrictions": "Open to undergraduate students in the Professional and Public Writing Major. Approval of department.", "alias": "ATL 290"}, "WRA291": {"name": " Special Topics", "semester": "Fall of every year, Spring of every year", "credits": "Variable from 1 to 4", "description": "Writing- and reading-intensive course on special topics in professional and public writing. Topics vary.", "prerequisite": "(WRA 202 or concurrently) or (WRA 260 or concurrently)", "restrictions": "Open to undergraduate students in the Professional and Public Writing Major."}, "WRA311": {"name": " Introduction to Documentary Production", "semester": "Spring of every year", "credits": " 3", "description": "Introduction to documentary production using accessible and affordable digital technology.", "prerequisite": "MI 211", "restrictions": "Open to students in the Documentary Production Minor.", "alias": "TC 233"}, "WRA320": {"name": " Technical Communication (W)", "semester": "Spring of every year", "credits": " 3", "description": "Principles and practices of communicating technical and procedural information for different audiences. Methods of audience-based research, information design, project management, and technical style.", "prerequisite": "WRA 202 or WRA 260", "restrictions": "Open to undergraduate students in the Experience Architecture Major or in the Forestry Major or in the Professional and Public Writing Major or approval of department.", "alias": "AL 320"}, "WRA325": {"name": " Writing and Multimodality", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Rhetorical and cultural dimensions of composing in digital spaces. Study of and practice with the rhetorical affordances and expectations of different writing spaces. Practice in messaging across contexts and composing with multiple technologies.", "prerequisite": "(WRA 202 or concurrently) or (WRA 260 or concurrently)", "restrictions": "Open to undergraduate students in the Department of Writing, Rhetoric and American Cultures or approval of department."}, "WRA330": {"name": " Writing Research in Communities and Cultures", "semester": "Fall of every year", "credits": " 3", "description": "Writing and research methods in and with local, global, and online communities and organizations. Topics include methods of field research and textual analysis, working with quantitative and qualitative data, and ethics of representation. Focus on the ways in which culture informs and influences community and writing by/with communities.", "prerequisite": "(WRA 202 or concurrently) or (WRA 260 or concurrently)", "restrictions": "Open to undergraduate students in the Professional and Public Writing Major or approval of department."}, "WRA331": {"name": " Writing in the Public Interest (W)", "semester": "Spring of every year", "credits": " 3", "description": "Various forms of public writing and rhetoric and their roles in civic and public culture. Emphasis on nonprofit communication practices, tools, and genres, and orientation toward culture and its influence on public and community writing. Practice in modes of public and civic discourse, including deliberative strategies and a range of public literacies with attention to cultural engagement.", "prerequisite": "(WRA 202 or WRA 260) and completion of Tier I writing requirement", "restrictions": "Open to students in the Forestry Major or in the Professional and Public Writing Major or approval of department.", "alias": "AL 331"}, "WRA341": {"name": " Nature and Environmental Writing", "semester": "Fall of even years", "credits": " 3", "description": "Place-based writing that engages the environmental imagination, shaped by the variety of human relationships with place.", "prerequisite": "Completion of Tier I Writing Requirement", "restrictions": "Open to undergraduate students in the Department of Forestry or in the Professional Writing major or in the Fisheries and Wildlife major or approval of department.", "alias": "AL 341"}, "WRA345": {"name": " Topics in Writing", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Courses supplementing regular course offerings. Topics recommended by students, proposed by faculty, and/or offered due to intellectual or professional need or interest.", "prerequisite": "WRA 202 or WRA 260", "restrictions": "Open to undergraduate students in the Department of Writing, Rhetoric and American Cultures or approval of department."}, "WRA350": {"name": " Sound Writing and Rhetoric", "semester": "Spring of every year", "credits": " 3", "description": "Theories and principles of sound composing. Intensive reading and practice with emphasis on rhetorical dimensions of listening to and composing sound. Expectation of the roles of editing, equalization, and mastering as rhetorical variables that affect how audiences respond to sound. Practice with accessible and ethical audio writing and editing techniques.", "prerequisite": "WRA 202 or WRA 260", "restrictions": "Open to undergraduate students in the Department of Writing, Rhetoric and American Cultures or approval of department."}, "WRA355": {"name": " Writing for Publication Workshop", "semester": "Summer of every year", "credits": " 3", "description": "Workshop for students developing writing for a variety of print and online publications. Discussion of and practice with freelance writing, author guidelines, and editorial processes.", "prerequisite": "WRA 202 or WRA 260", "restrictions": "Open to undergraduate students in the Professional and Public Writing Major or approval of department.", "alias": "AL 355"}, "WRA360": {"name": " Design of Print and Digital Documents", "semester": "Fall of every year, Spring of every year", "credits": " 4", "description": "Rhetorical and cultural dimensions of composing and designing print and digital documents. Analysis and composing of documents with attention to rhetorical affordances including typography, and color theory.", "prerequisite": "(WRA 202 or concurrently) or (WRA 260 or concurrently)", "restrictions": "Open to students in the Experience Architecture Major or in the Professional and Public Writing Major or approval of department.", "alias": "AL 360"}, "WRA370": {"name": " Introduction to Grammar and Editing (W)", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Principles and practices of copyediting for professional and public writers, with special attention to grammar, style, and rhetorical issues.", "prerequisite": "(WRA 202 or WRA 260) and completion of Tier I writing requirement", "restrictions": "Open to undergraduate students in the Professional and Public Writing Major or approval of department."}, "WRA395": {"name": " Writing Center Theory and Practice", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Writing center theory and practice. Consulting practices.", "prerequisite": "Completion of Tier I Writing Requirement", "restrictions": "Approval of department."}, "WRA401": {"name": " Rhetoric, Leadership, and Innovation", "semester": "Spring of every year", "credits": " 3", "description": "Exploration of rhetorical theories applied to managing and leading communication in civic and professional organizations. Emphasis on team dynamics and on managing and leading teams and projects. Discussion of entrepreneurial thinking in professional and public writing.", "prerequisite": "WRA 202 or WRA 260", "restrictions": "Open to undergraduate students in the Professional and Public Writing Major or approval of department."}, "WRA410": {"name": " Advanced Web Authoring", "semester": "Spring of every year", "credits": " 3", "description": "Introduction to team-based approaches to web development, with focus on rhetorical strategies and ethical practices. Visual design, usability, media integration, site management and sustainability, and web accessibility. Grounded in content-management systems and advanced programming languages.", "prerequisite": "(WRA 202 or WRA 260) and WRA 210", "restrictions": "Open to students in the Digital Rhetoric and Professional Writing Major or in the Experience Architecture Major or in the Professional and Public Writing Major or approval of department.", "alias": "AL 410"}, "WRA411": {"name": " Collaborative Documentary Design and Production (W)", "semester": "Spring of every year", "credits": " 3", "description": "Design and development of documentaries in a team setting using video and audio, still photography, web design, and print media. Participation in a production cycle including idea generation, research, design, production, and distribution.", "prerequisite": "Completion of Tier I Writing Requirement", "restrictions": "Open to students in the Documentary Production Minor.", "alias": "TC 411"}, "WRA415": {"name": " Digital Rhetoric", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Rhetorical, social, political, economic, and ethical dimensions of digital communication, including identity, community, genre, and events. Rhetorical dynamics of communication across digital spaces such as apps, websites, software, and other experiences.", "prerequisite": "WRA 202 or WRA 260", "restrictions": "Open to students in the Digital Rhetoric and Professional Writing Major or in the Professional and Public Writing Major or approval of department.", "alias": "AL 415"}, "WRA420": {"name": " Content Strategy", "semester": "Spring of every year", "credits": " 3", "description": "Exploration of theory, practice, and ethics of content strategy in professional and public writing settings. Understanding the content management life cycle, aligning content strategy to various goals, assessing communication needs for audiences and participants. Issues in project leadership, management, intellectual property, and organizational communication for creating flexible, dynamic content and content structures.", "prerequisite": "WRA 320", "restrictions": "Open to students in the Experience Architecture Major or in the Professional and Public Writing Major and open to graduate students in the Department of Writing, Rhetoric and American Cultures or approval of department."}, "WRA441": {"name": " Social Justice as Rhetorical Practice", "semester": "Fall of odd years", "credits": " 3", "description": "Rhetorical, cultural, and historical analyses of significant texts in peace and justice movements. Production of effective texts in support of social, economic, and environmental justice and social entrepreneurship.", "prerequisite": "(WRA 202 or WRA 260) and completion of Tier I writing requirement", "restrictions": "Open to students in the Department of Writing, Rhetoric and American Cultures or approval of department."}, "WRA453": {"name": " Grant and Proposal Writing", "semester": "Fall of every year", "credits": " 3", "description": "Researching and writing grants and proposals for corporations, nonprofit organizations, businesses, and government agencies. Rhetorical dimensions of pitching and proposing, with various moves and methods of support such as preparing rationale statements, and creating budgets.", "prerequisite": "WRA 202 or WRA 260", "restrictions": "Open to students in the Department of Forestry and open to students in the Professional and Public Writing Major or approval of department.", "alias": "AL 453"}, "WRA455": {"name": " Portfolio Seminar", "semester": "Spring of every year", "credits": " 3", "description": "Workshop for students preparing professional document portfolios in print and digital formats, including application materials for careers in professional and public writing or for graduate study.", "prerequisite": "WRA 202 and WRA 260", "restrictions": "Open to seniors in the Department of Writing, Rhetoric and American Cultures."}, "WRA471": {"name": " Rhetoric of Grammar", "semester": "Spring of every year", "credits": " 3", "description": "Rhetorical, cultural, and ethical dimensions of grammar and style, paying special attention to the role of rhetorical context in ideas of grammaticality and appropriateness.", "prerequisite": "WRA 370", "restrictions": "Open to students in the Professional and Public Writing Major or approval of department."}, "WRA480": {"name": " Publication Management", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Experience in publication processes", "prerequisite": "WRA 370 or approval of department", "restrictions": "Open to students in the Professional and Public Writing Major or approval of department.", "alias": "WRA 380"}, "WRA482": {"name": " Information and Interaction Design", "semester": "Fall of even years", "credits": " 3", "description": "Design of information systems for professional and public writers. Activity analysis, object-oriented modeling, prototyping, technical specifications, and implementation planning. Pitching ideas. Developing information and interfaces. User-centered design lifecycle.", "prerequisite": "WRA 210", "restrictions": "Open to students in the Department of Writing, Rhetoric and American Cultures or approval of department."}, "WRA483": {"name": " Community Publishing", "semester": "Spring of every year", "credits": " 3", "description": "Project-based focus on developing and producing writing projects coordinated with the Digital Publishing Lab. Emphasis on collaborative action, drafting, and editing, defining goals; managing publication distribution.", "prerequisite": "(WRA 202 or WRA 260) and (WRA 360 or WRA 370)", "restrictions": "Open to undergraduate students in the Department of Writing, Rhetoric and American Cultures or approval of department."}, "WRA484": {"name": " Ethics in Writing", "semester": "Fall of every year", "credits": " 3", "description": "Ethical issues related to professional and public writing including censorship, copyright, ethical practices and philosophies of editing, open access, privacy, preservation, and accessibility. Attention to cultural issues, including cultural appropriation and culturally relevant practices.", "prerequisite": "WRA 202 or WRA 260", "restrictions": "Open to undergraduate students in the Department of Writing, Rhetoric and American Cultures or approval of department."}, "WRA490": {"name": " Independent Study", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 4", "description": "Special projects arranged by an individual student and a faculty member in areas supplementing regular course offerings.", "prerequisite": "WRA 202 or WRA 260", "restrictions": "Approval of department."}, "WRA491": {"name": " Special Topics", "semester": "Fall of every year, Spring of every year", "credits": "Variable from 1 to 4", "description": "Writing-and reading-intensive special topics in professional and public writing. Topics vary.", "prerequisite": "WRA 202 or WRA 260"}, "WRA493": {"name": " Internship in Public or Professional Writing", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 3", "description": "Supervised work as writers and editors in an organizational setting.", "prerequisite": "(WRA 202 or WRA 260 or approval of department) and (WRA 325 or WRA 360)", "restrictions": "Open to juniors or seniors in the Professional and Public Writing Major. Approval of department.", "alias": "AL 493E, WRA 493E, WRA 493D"}, "WRA499": {"name": " International Research in Public or Professional Writing", "semester": "Summer of every year", "credits": "Variable from 1 to 3", "description": "Supervised research experiences in professional or public writing topics and sites.", "prerequisite": "(WRA 202 or WRA 260) and completion of Tier I writing requirement", "restrictions": "Approval of department."}, "WRA805": {"name": " Rhetoric Theory and History", "semester": "Fall of every year", "credits": " 3", "description": "Historical perspective on major theories, issues, and topics in rhetoric and writing from classical times to the present.", "restrictions": "Open to graduate students in the College of Arts and Letters or in the College of Communication Arts and Sciences or approval of college.", "alias": "AL 805"}, "WRA841": {"name": " Professional Writing Theory and Research", "semester": "Spring of odd years", "credits": " 3", "description": "Theory and research informing technical and professional writing practices. Workplace studies, usability research, information design theory, rhetoric of science and technology, research on computer-mediated writing.", "restrictions": "Open to master's students or doctoral students in the Digital Rhetoric and Professional Writing major or in the Rhetoric and Writing major.", "alias": "AL 841"}, "WRA848": {"name": " Cultural Rhetorics Theory and Methodology", "semester": "Spring of every year", "credits": " 3", "description": "Current methodological issues in rhetorical approaches to American cultural rhetorics.", "restrictions": "Open to graduate students in the College of Arts and Letters or in the College of Communication Arts and Sciences or approval of college.", "alias": "AL 848"}, "WRA853": {"name": " Workshop in Rhetoric and Writing", "semester": "Spring of every year", "credits": " 3", "description": "Directed practice in various forms of academic and professional writing necessary to scholars and teachers in the discipline of rhetoric and writing.", "restrictions": "Open to graduate students in the Department of Writing, Rhetoric and American Cultures."}, "WRA860": {"name": " Multimodal Composing Theory and Practice", "semester": "Fall of even years", "credits": " 3", "description": "Theories of multimodal composing, including issues of visual rhetoric and consideration of document design. Effects of visual elements in print and online documents. Intensive writing, analysis, and production.", "restrictions": "Open to graduate students in the Department of Writing, Rhetoric and American Cultures or approval of department.", "alias": "AL 860"}, "WRA870": {"name": " Research Methodologies in Rhetoric and Writing", "semester": "Spring of every year", "credits": " 3", "description": "Exploration of inquiry approaches in rhetoric and writing. Discussion of methodologies, theoretical foundations, methods and tools, and project design.", "restrictions": "Open to doctoral students in the Rhetoric and Writing major and open to master's students in the Critical Studies in Literacy and Pedagogy major and open to master's students in the Digital Rhetoric and Professional Writing major.", "alias": "AL 870"}, "WRA878": {"name": " Composition Studies: Issues, Theory, and Research", "semester": "Fall of every year", "credits": " 3", "description": "Issues, research, and theories shaping current work in composition studies. Intersections with studies in literacy, discourse, and critical theory.", "restrictions": "Open to graduate students in the College of Arts and Letters or in the College of Education or approval of college.", "alias": "ENG 876, AL 878"}, "WRA882": {"name": " Contemporary Theories of Rhetoric", "semester": "Spring of every year", "credits": " 3", "description": "Modern, postmodern, and contemporary rhetoric theories and their impact on writing and writing instruction. Cultural studies, critical theory, feminist discourse theory, rhetorical ethics, visual rhetoric, digital and media theory.", "restrictions": "Open to graduate students or master's students or doctoral students in the Department of English or in the Professional Writing Major or in the Rhetoric and Writing Major.", "alias": "AL 882"}, "WRA885": {"name": " Research Colloquium", "semester": "Fall of every year", "credits": " 3", "description": "Professional development seminar focused on developing research skills, designing research projects, and preparing publications and conference presentations.", "restrictions": "Open to doctoral students in the Rhetoric and Writing major.", "alias": "AL 885"}, "WRA886": {"name": " Master’s Research Colloquium", "semester": "Fall of every year", "credits": " 1", "description": "Professional development seminar focused on developing research skills, designing research projects, and preparing publications, conference presentations, and other professional materials unique to master's students.", "restrictions": "Open to master's students in the Department of Writing, Rhetoric and American Cultures."}, "WRA888": {"name": " Methods in the Teaching of College-Level Writing", "semester": "Spring of even years", "credits": " 3", "description": "Strategies and methods of teaching college-level writing.", "restrictions": "Open to graduate students in the Department of Writing, Rhetoric and American Cultures."}, "WRA889": {"name": " Writing Center Theory and Administration", "semester": "Spring of odd years", "credits": " 3", "description": "Examination of theoretical and practical components of writing center work. Theories of writing, culture, education, and administration shaping writing center theory, practice, and administration.", "restrictions": "Approval of department."}, "WRA890": {"name": " Independent Study in Rhetoric and Writing", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 6", "description": "Special projects, directed reading, and research arranged by an individual graduate student and a faculty member in areas supplementing regular course offerings.", "restrictions": "Open to graduate students in the Department of Writing, Rhetoric and American Cultures or approval of department."}, "WRA891": {"name": " Special Topics in Rhetoric and Writing", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": " 3", "description": "Special topics supplementing regular course offerings, proposed by faculty on a group study basis.", "restrictions": "Open to graduate students in the Department of Writing, Rhetoric and American Cultures or approval of department."}, "WRA893B": {"name": " Internship in Professional Writing", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 6", "description": "Internship in professional writing for master's students.", "restrictions": "Open to graduate students in the Department of Writing, Rhetoric and American Cultures or approval of department."}, "WRA893D": {"name": " Internship in Literacy and Pedagogy", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 6", "description": "Internship in literacy and pedagogy for master's students.", "restrictions": "Open to graduate students in the Department of Writing, Rhetoric and American Cultures or approval of department."}, "WRA898": {"name": " Master's Research", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 3", "description": "Master's research for Plan B students.", "restrictions": "Open to graduate students in the Department of Writing, Rhetoric and American Cultures or approval of department."}, "WRA899": {"name": " Master's Thesis Research", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 3", "description": "Master's thesis for Plan A students.", "restrictions": "Open to graduate students in the Department of Writing, Rhetoric and American Cultures or approval of department."}, "WRA992": {"name": " Seminar in Literacy Studies", "semester": "Fall of even years", "credits": " 3", "description": "Literacy theory and research for/in rhetoric and writing studies.", "restrictions": "Open to graduate students in the Department of Writing, Rhetoric and American Cultures or approval of college.", "alias": "ENG 992A, AL 992"}, "WRA999": {"name": " Doctoral Dissertation Research", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 12", "description": "Dissertation research for doctoral students.", "restrictions": "Open to graduate students in the Department of Writing, Rhetoric and American Cultures or approval of department."}}}