{"code": "WS", "name": "Women's Studies", "courses": {"WS153": {"name": " Introduction to Women Authors", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": " 4", "description": "Writings by women from various racial, socio-economic and historical backgrounds. Women's choices of subject matter and style. Women's redefinition of literary genres."}, "WS201": {"name": " Introduction to Women's and Gender Studies", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": " 3", "description": "Foundational knowledge, theories, methods in women's and gender studies and of women's experience historically and across the globe."}, "WS202": {"name": " Introduction to Contemporary Feminisms and Gender Theories", "semester": "Spring of every year", "credits": " 3", "description": "Theories of feminism and gender from a variety of intellectual, political, cultural, religious, sexual, racial, ethnic, national, and global perspectives.", "prerequisite": "WS 201", "restrictions": "Not open to freshmen."}, "WS203": {"name": " Introduction to Methods for Women's and Gender Studies Research", "semester": "Fall of even years", "credits": " 3", "description": "Interdisciplinary research methods for global women's and gender studies.", "prerequisite": "Completion of Tier I Writing Requirement"}, "WS225": {"name": " Language and Gender", "semester": "Fall of every year", "credits": " 3", "description": "Gender and language in societies around the world. Issues such as status, power and politeness in monolingual and multilingual societies. The role of gender in language development, language variation and language change."}, "WS301": {"name": " Sexual Violence Against Women and Children: Theory and Response", "semester": "Spring of every year", "credits": " 3", "description": "Sexual violence against women and children from theoretical and applied perspectives. Rape, battering, incest and sexual harassment. Intersection of race, class, gender and violence. Individual and collective strategies to prevent or deter assault, race, class, gender and violence.", "restrictions": "Not open to freshmen."}, "WS304": {"name": " Lesbian, Gay, Bisexual, Transgender, Queer (LGBTQ) and Sexuality Studies", "semester": "Spring of every year", "credits": " 3", "description": "Interdisciplinary study of the history, politics, theories, science, cultures, and communities of lesbian, gay, transgender, queer, and intersex people including a global perspective.", "restrictions": "Not open to freshmen.", "alias": "WS 204"}, "WS312": {"name": " African American Women", "semester": "Spring of every year", "credits": " 3", "description": "Black women in American history. Slavery, the work place, politics, and the Civil Rights movement."}, "WS313": {"name": " Women in the United States to 1869", "semester": "Fall of every year", "credits": " 3", "description": "United States history through the experiences of women. Gender, family, work, and political activism."}, "WS314": {"name": " Women in the United States since 1869", "semester": "Spring of every year", "credits": " 3", "description": "United States history through the experiences of women. Gender, family, work, and political activism."}, "WS316": {"name": " Children's Exposure to Domestic Violence: Promoting Resiliency", "semester": "Summer of every year", "credits": " 3", "description": "Prevalence, context and impact of domestic abuse on children. Strategies for promoting resiliency.", "prerequisite": "PSY 101"}, "WS317": {"name": " Sexual Assault: Context, Interventions and Prevention", "semester": "Summer of every year", "credits": " 3", "description": "Nature and context of adult sexual assault in the United States. Current interventions and prevention efforts.", "prerequisite": "PSY 101"}, "WS318": {"name": " Gender-Based Violence Across the Lifespan", "semester": "Summer of every year", "credits": " 3", "description": "Dynamics, risk factors, and community responses to gender-based violence across the lifespan.", "prerequisite": "PSY 101"}, "WS339": {"name": " Psychology of Women", "semester": "Fall of every year", "credits": " 3", "description": "Development and implications of sex-typed behavior and sex differences. Women's decisions about and experiences of menstruation, sexuality, motherhood, relationships, achievement, employment, retirement.", "prerequisite": "PSY 101", "alias": "PSY 239"}, "WS351": {"name": " Gendered Violence and Intersections of Power", "semester": "Summer of every year", "credits": " 3", "description": "Gendered violence from an intersectional perspective. Ways intersecting social statuses such as race, class, and sexuality shape gendered experiences."}, "SOC351": {"name": " Gendered Violence and Intersections of Power (Interim Change)", "semester": "Summer of every year", "credits": " 3", "description": "Gendered violence from an intersectional perspective. Ways intersecting social statuses such as race, class, and sexuality shape gendered experiences."}, "WS353": {"name": " Readings in Women Writers", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Extensive reading in texts by women, focused within a particular national tradition or period or within a particular genre. Critical responses to these texts. Feminist approaches to literature.", "prerequisite": "Completion of Tier I Writing Requirement", "restrictions": "Not open to freshmen."}, "WS355": {"name": " Readings in Sexuality and Literature", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Extensive reading in literature drawing on gay, lesbian, bisexual, transgender, and/or queer perspectives.", "prerequisite": "Completion of Tier I Writing Requirement", "restrictions": "Not open to freshmen."}, "WS356": {"name": " Philosophical Aspects of Feminism", "semester": "Fall of every year, Spring of every year", "credits": " 4", "description": "Conceptual and normative issues in feminist theory. Topics such as sexism, oppression, coercion, control, power, equality, personhood, respect and self-respect, rape, separatism, community, intimacy, and autonomy."}, "WS403": {"name": " Women and Change in Developing Countries", "semester": "Spring of every year", "credits": " 3", "description": "Effects of economic, political, and social change on women in developing countries. Interrelationships of gender, class, race, and nationality.", "restrictions": "Not open to freshmen or sophomores."}, "WS404": {"name": " Women and the Law in the United States", "semester": "Fall of odd years, Spring of odd years", "credits": " 3", "description": "Law in the United States as a vehicle for structuring and maintaining women's social roles, and for social change.", "restrictions": "Not open to freshmen or sophomores."}, "WS412": {"name": " Women in Modern European History", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Women in European society, economy, and politics since 1750, emphasizing the lives of ordinary women and the impact of industrial capitalism and the nation-state.", "restrictions": "Not open to freshmen."}, "WS413": {"name": " Families in Historical Perspective", "semester": "Fall of every year", "credits": " 3", "description": "Family forms and socio-economic change in Europe and the United States. Gender, childhood, courtship, sexual relations, marriage, divorce, childbearing, and old age in peasant, industrial, and postindustrial society. War, welfare state, and the family. The marginalized", "restrictions": "Not open to freshmen."}, "WS420": {"name": " History of Sexuality since the 18th Century", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Changing gender roles, sex in the Victorian era, prostitution, pornography, birth control, emergence of homo- and heterosexuality, sex under fascism, the sexual revolution, contemporary conflicts.", "restrictions": "Not open to freshmen."}, "WS421": {"name": " Women and Gender in Africa", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Gender-aware and women-centered approaches to the study of African history", "restrictions": "Not open to freshmen or sophomores."}, "WS424": {"name": " Seminar in Queer Studies", "semester": "Spring of every year", "credits": " 3", "description": "Advanced topics in queer studies. In-depth analysis of major topics and developments in queer studies, queer theory, or related interdisciplinary studies in sexuality.", "prerequisite": "(WS 304 or approval of department) and Completion of Tier I Writing Requirement", "restrictions": "Open to undergraduate students."}, "WS425": {"name": " Women and Criminal Justice", "semester": "Spring of every year", "credits": " 3", "description": "Theories on women's victimization and criminality. Women's experiences as victims, offenders, and criminal justice employees. Laws and their effects on the rights of women in the criminal justice system.", "restrictions": "Open to juniors or seniors."}, "WS448": {"name": " Seminar in Gender and Literature", "semester": "Spring of every year", "credits": " 3", "description": "Advanced analysis in literary works within the context of sexual differences or sexuality studies. May include women writers, feminism, masculinity studies, gay, lesbian, or transgender studies. Topics vary.", "prerequisite": "(ENG 360 or ENG 362 or ENG 364 or ENG 368) or (WS 202 or WS 304 or approval of department)", "restrictions": "Open to juniors or seniors in the Department of English or in the Women, Gender and Social Justice Specialization or approval of department."}, "WS452": {"name": " Studies in Film, Gender, and Sexuality", "semester": "Fall of every year", "credits": " 3", "description": "Study of films by women and about women, gender, masculinity, or sexuality.", "prerequisite": "FLM 230", "alias": "ENG 431C"}, "WS456": {"name": " Topics in Feminist Philosophy", "semester": "Fall of odd years", "credits": " 4", "description": "Philosophical issues in a framework of feminist politics and critique. Standpoint theories, care/justice ethics, ontological status of genders/races, theories of power/domination, determinism/freedom."}, "WS482": {"name": " Seminar in Feminist Literary and Cultural Theory", "semester": "Spring of every year", "credits": " 3", "description": "Advanced analysis in feminist literary, critical, and cultural theory and its implications for reading and studying literature.", "prerequisite": "(ENG 280 or ENG 353 or ENG 448 or WS 202) and completion of Tier I writing requirement", "restrictions": "Open to juniors or seniors in the Department of English or in the Women's and Gender Studies Minor."}, "WS490": {"name": " Independent Study", "semester": "Fall of every year, Spring of every year", "credits": "Variable from 1 to 3", "description": "Individual reading and research on women and gender."}, "WS491": {"name": " Special Topics", "semester": "Fall of every year, Spring of every year", "credits": "Variable from 3 to 4", "description": "In-depth study of special topic emphasizing women and gender.", "restrictions": "Not open to freshmen or sophomores."}, "WS492": {"name": " Advanced Seminar in Women's and Gender Studies (W)", "semester": "Spring of every year", "credits": " 4", "description": "Guided advanced reading, research, and writing in topics in global gender and women's studies", "prerequisite": "(WS 201 or approval of college) and completion of Tier I writing requirement", "restrictions": "Not open to freshmen or sophomores."}, "WS493": {"name": " Internship", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 2 to 4", "description": "Application of course work in Women's and Gender Studies through work experience related to women's and gender concerns. Experience in legislative, community, or educational settings in the U.S. and overseas.", "prerequisite": "WS 201 or WS 202 or WS 203", "restrictions": "Not open to freshmen or sophomores."}, "WS858": {"name": " Gender, Justice and Environmental Change : Issues and Concepts", "semester": "Fall of every year", "credits": " 3", "description": "Issues and concepts related to gender, ecology, and environmental studies. Key debates and theoretical approaches to addressing environmental issues from a gender and social justice perspective. Gender and environment issues and processes from a global perspective."}, "WS859": {"name": " Gender, Justice, and Environmental Change: Methods and Application", "semester": "Spring of every year", "credits": " 3", "description": "Methods and case studies related to gender, ecology, and environmental studies. Methodological and fieldwork issues from a feminist perspective in international and intercultural contexts. Qualitative and quantitative methods for integrating social and environmental data."}, "WS860": {"name": " Seminar in Women's History", "semester": "Fall of every year, Spring of every year", "credits": " 3", "description": "Political, social, and economic history of women. Major interpretations and research findings. Topics vary."}, "WS890": {"name": " Individual Reading", "semester": "Fall of every year, Spring of every year, Summer of every year", "credits": "Variable from 1 to 4", "description": "Faculty supervised graduate level reading in special topics.", "restrictions": "Approval of department."}, "WS897": {"name": " Seminar in Feminist Theories, Epistemologies, and Pedagogy", "semester": "Spring of odd years", "credits": " 3", "description": "Foundational knowledge, theory, epistemology, and pedagogy in women’s and gender studies from a multi-disciplinary, global perspective."}}}